import 'package:beyish_jolu/features/main/models/umra_model.dart';

final List<SectionModel> hadj = [
  SectionModel(
    title: 'Мекке бөлүмү',
    duas: [
      DuaModel(
        subtitle: 'Сапарга аттануунун дуасы',
        arabicText:
            'بِسْمِ اللَّهِ تَوَكَّلْتُ عَلَى اللَّهِ، لَا حَوْلَ وَلَا قُوَّةَ إِلَّا بِاللَّهِ',
        transliteration:
            'Бисмиллахи таваккалту аълаллохи лаа хавла ва лаа куввата илла биллахи.',
        translation:
            'Мен Аллахтын ысымы менен сапарга чыгып жатам жана Аллахка гана тобокел кылдым',
      ),
      DuaModel(
        subtitle:
            'Аба учагына отурганда же башка унааларга отурганда окулуучу дуа',
        arabicText:
            'سُبْحَانَ الَّذِي سَخَّرَ لَنَا هَـٰذَا وَمَا كُنَّا لَهُ مُقْرِنِينَ وَإِنَّا إِلَىٰ رَبِّنَا لَمُنقَلِبُونَ',
        transliteration:
            'Субхааналлазии саххоро ланаа хаазаа ва маа куннаа лаху мукриниин ва иннаа илаа роббинаа ламуңколибуун.',
        translation:
            'Аллах таала бардык кемчилик,айыптардан таза Зат. Ал Зат аны бизге өзүбүздүн ыктыярыбызга берди.Биз баш ийдире албаган бул унааны бизге баш ийдирип койду. Албетте, биз Роббибизге кайтып баруучубуз.',
      ),
      DuaModel(
        subtitle: 'Сапар учурунда окуулучу дуа',
        arabicText:
            'اللَّهُمَّ هوِّنْ عَلَيْنَا سَفَرَنَا هَذَا وَطَوِّ عَنَّا بُعْدَهُ اللَّهُمَّ أَنْتَ الصَّاحِبُ فِي السَّفَرِ وَالْخَلِيفَةُ فِي الْأَهْلِ اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ وَعَاءِ السَّفَرِ وَكَآبَةِ الْمَنْظَرِ وَسُوءِ الْمُنْقَلَبِ فِي الْمَالِ وَالْأَهْلِ',
        transliteration:
            "Аллоохумма хаввин аълайнаа сафа-ранаа хазаа ватви аъннаа буъдаху аллоохумма антас соохибу фис сафари,вал холиифату фил ахли аллохумма иннии аъуузу бика мин ва’аъаис сафари ва ка'аабатил манзари, ва суу'ил муңколаби фил маали вал ахли.",
        translation:
            'Оо Аллахым! Бул сапарыбызды жеңил кылып узакты жакын кыл. Оо Аллахым! Cен гана сапарда бизге шериксиң, Cен гана биздин артыбызда калган үй-бүлө, балдарыбызды сактоочусуң. Оо Аллахым! Мен Cенден сапардын машакатынан, кыжаалат кыла турган көрүнүштөн жана үй-бүлөнүн алдына жаман абалда кайтып баруудан паана тилеймин!',
      ),
      DuaModel(
        subtitle: ' Ажылыктын ихрамын байлап жаткан убакта окулуучу дуа',
        arabicText:
            'اللَّهُمَّ إِنِّي أُرِيدُ الْحَجَّ فَيَسِّرْهُ لِي وَتَقَبَّلْهُ مِنِّي',
        transliteration:
            'Аллохумма иннии урийду-л хажжа фаяссир-ху-ли ва такоббал ху миннии.',
        translation:
            'Оо Аллахым! Мен ажылыкты ниет кылып жатам, аны мага жеңил кылып кабыл кыл! ',
      ),
      DuaModel(
        subtitle:
            'Умра же таматтуъ ажылыгынын ихрамын байлап жаткан убакта окулуучу дуа',
        arabicText:
            'اللَّهُمَّ إِنِّي أُرِيدُ الْعُمْرَةَ فَيَسِّرْهَا لِي وَتَقَبَّلْهَا مِنِّي',
        transliteration:
            'Аллохумма иннии урийду-л умрата фаяссир-ху-ли ва такоббал ху миннии.',
        translation:
            'Оо Аллахым! Мен умраны ниет кылып жатам, аны мага жеңил кылып кабыл кыл!',
      ),
      DuaModel(
        subtitle: 'Кирон ажылыгынын ихрамын байлап жаткан убакта окулуучу дуа',
        arabicText:
            'اللَّهُمَّ إِنِّي أُرِيدُ الْعُمْرَةَ وَالْحَجَّ فَيَسِّرْهُمَا لِي وَتَقَبَّلْهُمَا مِنِّي',
        transliteration:
            'Аллохумма иннии урийду-л умрата ва-л хажжа фаяссир-ху-ли ва такоббал ху миннии',
        translation:
            'Оо Аллахым! Мен умраны жана ажылыкты ниет кылып жатам, аны мага жеңил кылып кабыл кыл!',
      ),
      DuaModel(
        subtitle: 'Харамдын чегине киргенде окулуучу дуа',
        arabicText:
            'اللَّهُمَّ إِنَّ هَذَا حَرَامُكَ وَحَرَامُ رَسُولِكَ فَحَرِّمْ لَحْمِي وَدَمِي وَعَظْمِي وَبَشَرِي عَلَى النَّارِ، اللَّهُمَّ آمِنِّي مِنْ عَذَابِكَ يَوْمَ تَبْعَثُ عِبَادَكَ',
        transliteration:
            'Аллохумма инна хаза харамук ва харому росуулик фа харрим лахмии ва дамии ва ъазмии ва башарии ъала-н наар,аллохумма ааминнии мин аъзаабика явма табъасу иъбаадак.',
        translation:
            'Оо Аллахым! Шек күмөнү жок бул сенин жана Пайгамбарыңдын Харамы. Менин этим, каным, сөөгүм жана теримди тозок отуна арам кыл. Оо Аллахым! Пенделериңди кайра тирилте турган күндө азабыңдан мени сактагын! ',
      ),
      DuaModel(
        subtitle: 'Харам мечитине кирип жатканда окулуучу дуа',
        arabicText:
            'بِسْمِ اللَّهِ وَالصَّلَاةُ وَالسَّلَامُ عَلَى رَسُولِ اللَّهِ، اللَّهُمَّ اغْفِرْ لِي ذُنُوبِي وَافْتَحْ لِي أَبْوَابَ رَحْمَتِكَ',
        transliteration:
            'Бисмиллахи ва-с солаату ва-с саламу ъалаа росуулиллахи аллохума игфир лии зунуубии ва ифтах лии абвааба рохматик.',
        translation:
            'Алланын аты менен киремин. Алланын элчисине салам салаваттар болсун! Оо Аллахым! Мени күнөөлөрүмдү кечирип мен үчүн Өзүңдүн рахмат эшиктериңди ач!',
      ),
      DuaModel(
        subtitle: 'Каабаны биринчи жолу көргөндө окула турган дуа',
        arabicText:
            'اللَّهُمَّ أَنْتَ السَّلَامُ وَمِنْكَ السَّلَامُ، فَحَيِّنَا بِالسَّلَامِ، اللَّهُمَّ زِدْ بَيْتَكَ هَذَا تَعْظِيمًا وَتَشْرِيفًا، وَتَكْرِيمًا وَتَعْظِيمًا وَبِرًّا',
        transliteration:
            'Аллоохумма аңта-с салаам ва минка-с салаам фа хаййинаа бис-салаам аллохумма зид байтака хазаа таъзииман ва ташриифан,ва такрииман ва таъзииман ва бирроо.',
        translation:
            'Оо Аллахым! Сен дайыма саламат болуучусуң. Саламаттык Сенин тарабыңдан болот. Оо Аллахым!Бизди саламаттуулук менен жашоо кечиртир. Оо Аллахым! Өзүңдүн бул үйүңдүн урмат-сыйын,улуулугун жана сүрүн көбөйткүн. Жана ким ага ажылык жана умра кылган болсо,анын да урмат-сыйын, улуулугун жана жакшылыгын көбөйткүн.',
      ),
      DuaModel(
        subtitle: ' Мултазамда окулуучу дуа',
        arabicText:
            'اللَّهُمَّ إِنَّ هَذَا بَيْتُكَ الَّذِي جَعَلْتَهُ مُبَارَكًا وَهُدًى لِلْعَالَمِينَ، اللَّهُمَّ كَمَا هَدَيْتَنِي لَهُ فَتَقَبَّلْ مِنِّي، وَلَا تَجْعَلْ آخِرَ عَهْدِي مِنْ بَيْتِكَ وَارْزُقْنِي الْعَوْدَةَ إِلَيْهِ حَتَّى تَرْضَى عَنِّي بِرَحْمَتِكَ يَا أَرْحَمَ الرَّاحِمِينَ.',
        transliteration:
            'Аллохумма инна хаза байтука-л лазии жа’аълтаху мубаарокан ва худан лил-аъааламиин. Аллохумма камаа хадайтании лахуу фатакоббал миннии ва лаа таж’аъл хаза аахиро-л аъхди мин байтика ва-р зукния-л аъвдата илайъхи хатта тардоо аъннии бирохматика яаа ар-хамар роохимиин.',
        translation:
            'Оо Аллахым! Бул- Сен берекелүү кылган жана ааламга хидаят кылган үйүң. Оо Аллахым! Өзүң мага ажылыкты насип кылгандай, аны менден кабыл кыл! Мен үчүн бул сапарды үйүңө кылган акыркы учурашуу кылбагын. Менден ыраазы болгонго чейин кайта-кайта келүүнү насип кылгын. Оо Мээримдүүлөрдүн Мээримдүүсү! Өзүңдүн Мээримиң менен менин дубамды кабыл кылгын! ',
      ),
      DuaModel(
        subtitle: 'Рахмат мийзабтын астында окулуучу дуа',
        arabicText:
            'اللَّهُمَّ إِنِّي أَسْأَلُكَ إِيمَانًا لَا يَزُولُ وَيَقِينًا لَا يَنْفَدُ وَمُرَافَقَةَ نَبِيِّكَ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ. اللَّهُمَّ أَظِلَّنِي تَحْتَ ظِلِّ عَرْشِكَ يَوْمَ لَا ظِلَّ إِلَّا ظِلُّ عَرْشِكَ وَاسْقِنِي بِكَأْسِ مُحَمَّدٍ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ شَرْبَةً لَا أَظْمَأُ بَعْدَهَا أَبَدًا.',
        transliteration:
            'Аллохумма иннии ас-алука иимаанан лаа язуулу ва якиинан лаа янфаду ва муроофакота набаййика соллолоху алайхи ва салам.Аллохумма азиллании тахта зилли аършика явма ла зилла илла зиллу аършика ва аскинии би ка-си мухаммадин соллоллоху алайхи ва саллама шарбатан лаа азмау баъдахаа абадан.',
        translation:
            'Оо Аллахым! Сенден эч качан менден ажырабай турган ыйман, түгөнүп бүтпөс ишенич жана Пайгамбарың Мухаммад (с.а.в) менен бирге болууну сураймын. Аршыңдын көлөкөсүнөн башка көлөкө жок күнү мени Аршыңдын көлөкөсүнүн астында кыл! Мухаммад(с.а.в)дын идиши менен мени андан кийин эч качан чаңкабай тургандай кылып сугаргын! ',
      ),
    ],
  ),
  SectionModel(
    title: 'Таваф бөлүмү',
    duas: [
      DuaModel(
        subtitle: 'Таваф кылып баштаганда окуулучу дуа',
        arabicText:
            'بِسْمِ اللَّهِ اللَّهُ أَكْبَرُ وَلِلَّهِ الْحَمْدُ وَالصَّلَاةُ وَالسَّلَامُ عَلَى رَسُولِ اللَّهِ، اللَّهُمَّ إِيمَانًا بِكَ وَتَصْدِيقًا بِكِتَابِكَ وَوَفَاءً بِعَهْدِكَ وَاتِّبَاعًا لِسُنَّةِ نَبِيِّكَ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ',
        transliteration:
            'Бисмиллах Аллоху акбар ва лиллахил хамд вассолаату вас салааму ъалаа росуулиллах. Аллохумма иимаанан бика ва тасдиикон би китаабика ва вафаа-ан би ъахдика ва иттибааъан ли суннати набиййика саллаллаху алайхи ва саллам.',
        translation:
            ' Алланын аты менен тавафты(баштаймын). Аллах Улук! Бардык алкыш мактоолор Аллага гана таандык. Салам салаваттар Алланын элчисине болсун! Оо Аллахым! Мен сага ыйман келтирип,сенин китебиңди тастыктап, Сага берген убаданы аткарып, Пайгамбарың Мухаммад ъалайхис саламдын сүннөтүн ээрчиген абалда бул тавафты баштаймын! ',
      ),
      DuaModel(
        subtitle: ' Биринчи айлануунун дуасы',
        arabicText:
            'بِسْمِ اللهِ اَللهُ أَكْبَرُ، اَللّٰهُمَّ إِيمَانًا بِكَ ، وَ تَصْدِيقًا بِكِتَابِكَ ، وَ وَفَاءً بِعَهْدِكَ ، وَاتِّبَاعًا لِسُنَّةِ نَبِيِّكَ سُبْحَانَ اللهِ ، وَالْحَمْدُ لِلهِ ، وَلَٓا إِلٰهَ إِلَّا اللهُ ، وَاللهُ أَكْبَرُ ، وَلَا حَوْلَ وَلَا قُوَّةَ إِلَّا بِاللهِ الْعَلِيِّ الْعَظِيمِ. وَالصَّلَاةُ وَالسَّلَامُ عَلٰى سَيِّدِنَا مُحَمَّدٍ وَ عَلٰى آلِهِ وَ صَحْبِهِ أَجْمَعِينَ. رَبَّنَا تَقَبَّلْ مِنَّا إِنَّكَ أَنْتَ السَّمِيعُ الْعَلِيمُ. رَبَّنَا وَاجْعَلْنَا مُسْلِمَيْنِ لَكَ وَ مِنْ ذُرِّيَّتِنَا أُمَّةً مُسْلِمَةً لَكَ ، وَ أَرِنَا مَنَاسِكَنَا وَ تُبْ عَلَيْنَا إِنَّكَ أَنْتَ التَّوَّابُ الرَّحِيمُ. اَللّٰهُمَّ اجْعَلْهُ سَعْيًا مَشْكُورًا ، وَ ذَنْبًا مَغْفُورًا ، وَ عَمَلًا صَالِحًا مَقْبُولًا ، وَ تِجَارَةً لَنْ تَبُورَ. اَللّٰهُمَّ إِنَّكَ دَعَوْتَ عِبَادَكَ إِلٰى بَيْتِكَ الْحَرَامِ ، وَ قَدْ جِئْتُ طَالِبًا مَرْضَاتَكَ ، وَ أَنْتَ مَنَنْتَ عَلَيَّ بِذَلِكَ ، فَاغْفِرْ لِي وَ ارْحَمْنِي وَعَافِنِي وَاعْفُ عَنِّي ، إِنَّكَ عَلٰى كُلِّ شَيْءٍ قَدِيرٌ. اَللّٰهُمَّ إِنِّي عَبْدُكَ وَ زَائِرُكَ وَ لِكُلِّ زَائِرٍ حَقٌّ عَلٰى مَزُورٍ وَ أَنْتَ خَيْرُ مَزُورٍ ، فَأَسْأَلُكَ أَنْ تَغْفِرَ لِي ، وَ تَرْحَمَنِي ، وَ تَفُكَّ رَقَبَتِي مِنَ النَّارِ. رَبَّنَٓا اٰتِنَا فِي الدُّنْيَا حَسَنَةً وَ فِي الْاٰخِرَةِ حَسَنَةً وَ قِنَا عَذَابَ النَّارِ ، وَ أَدْخِلْنَا الْجَنَّةَ مَعَ الْأَبْرَارِ ، يَا عَزِيزُ يَا غَفَّارُ يَا رَبَّ الْعَالَمِينَ.',
        transliteration:
            'Бисмиллахи Аллаху Акбар, аллохумма иимаанан бика, ва тасдиикан бикитаабика,ва вафаа-ан биъаҳдика, ва иттибааъан лисуннати набийика. Субханалла,вал-хамду лиллахи, ва ла илаха иллалла, валлаху акбар, ва ла хавла ва ла куввата илла биллахил ъалийил ъазиим. Вас-салаату вас-салааму ъалаа саййидина Мухаммад ва ъалаа алиҳи ва сахбихи ажмаъин. Раббана такаббал миннаа иннака антас-самиъул ъалим. Раббана важъалнаа муслимайни лака ва мин зуррийяатинаа умматан муслиматан лака ва аринаа манасиканаа ва туб ъалайнаа иннака антат-таввабур-рахиим. Аллохумма ижъалху са’аъйан машкуран, ва занбан магфууран, ва ъамалан саалихан макбуулан, ва тижааратан лан табур. Аллохумма иннака да’аъвта ъибадака ила байтикал-хараам, ва код жи’ту тоолибан мардоотик, ва анта мананта ъалайа бизалика, фагфир ли вархамни ва ъафини ва’аъфу ъанни, иннака ъала кулли шайин кодир. Аллохумма инни ъабдука ва заа’ирукa ва ликулли заа’ирин хаккун ъала мазуурин, ва анта хайру мазуурин, фа ас’алука ан тагфира ли, ва тархамани, ва тафукка рокабати минан-наар. Раббана аатини фид-дунйа хасанатан ва фил-ахирати хасанатан ва кынаа ъазабан-наар, ва адхылнаа ал-жанната маъал-абраар, яа ъазиизу яа гаффаару яа роббал-ъааламиин. ',
        translation:
            'Аллах Таала бардык айыптардан таза.Бардык мактоолор Аллахка  гана болсун! Аллахтан башка ибадатка татыктуу Зат жок! Аллах Таала- баарынан Улуу Зат! Күнөөдөн сактанууга жана моюн сунууга күч кубат бир гана Алланын жардамы менен гана болот. Салам салаваттар Алланын элчисине болсун. Оо Аллахым! Мен сага ыйман келтирген, Сенин китебиңди тастыктаган, Сага берген убаданы аткарган жана Пайгамбарың Мухаммад ъалайхис саламдын сүннөтүнө ылайык бул тавафты баштаймын! Оо Аллахым! Мен Сенден динимде,дүйнөмдө акыретимде кечирим, аманчылык жана бейишке жетүүнү, тозоктон сактоону сураймын! Оо Аллахым!  Бизди Өзүңө ибадат кылуучулардан кыл. Урпактарыбызды да ибадатка бекем кыл. Тооболорубузду кабыл кыл. Сен Мээримдүү жана Даанышмансың. Оо Аллахым! Мээнетибизди текке кетирбегин, күнөөлөрүбүздү кечир, жакшы амалдарыбызды кабыл кылгын.Оо  Аллахым!Пенделериңди ыйык жерге чакырдың. Сенин ыраазычылыгыңды сураганы келдим. Сен мага бул мүмкүнчүлүктү бердиң. Мени кечир, мага ырайым кыл, ден соолук бер жана тозок отунан сакта. ',
      ),
      DuaModel(
        subtitle: '  Рүкүн Яаминийден Хажар Асвад ортосундагы дуа',
        arabicText:
            'اللَّهُمَّ إِنِّي أَسْأَلُكَ الْعَفْوَ وَالْعَافِيَةَ فِي الدُّنْيَا وَالْآخِرَةِ. رَبَّنَا آتِنَا فِي الدُّنْيَا حَسَنَةً وَفِي الْآخِرَةِ حَسَنَةً وَقِنَا عَذَابَ النَّارِ وَادْخِلْنَا الْجَنَّةَ مَعَ الْأَبْرَارِ يَا عَزِيزُ يَا غَفَّارُ يَا رَبَّ الْعَالَمِينَ',
        transliteration:
            'Аллохумма иннии ас-алука-л ъафва ва-л ъаафията фид дунйа ва-л аахироти. Роббанаа аатинаа фи-д дунйа хасанатан ва фил-аахироти хасанатан ва кынаа аъзаабан наар ва адхылнаа-л жанната маъал аброор яаа ъазиизу яаа гоффар яаа роббал ъааламин.',
        translation:
            'Оо Аллахым! Сен мага дүйнө-акыретте кечирип, амандык берүүңдү сураймын. Оо, биздин Роббибиз! Бизге дүйнөдө да, акыретте да жакшылык берип бизди тозок азабынан сакта! Оо, Бүткүл ааламдын Роббиси! Бизди жакшы адамдар менен бирге Бейишке киргиз! ',
      ),
      DuaModel(
        subtitle: 'Экинчи айлануунун дуасы',
        arabicText:
            'بِسْمِ اللهِ اَللهُ أَكْبَرُ، اَللّٰهُمَّ إِيمَانًا بِكَ ، وَ تَصْدِيقًا بِكِتَابِكَ ، وَ وَفَاءً بِعَهْدِكَ ، وَاتِّبَاعًا لِسُنَّةِ نَبِيِّكَ. سُبْحَانَ اللهِ ، وَالْحَمْدُ لِلهِ ، وَلَٓا إِلٰهَ إِلَّا اللهُ ، وَاللهُ أَكْبَرُ وَلَا حَوْلَ وَلَا قُوَّةَ إِلَّا بِاللهِ الْعَلِيِّ الْعَظِيمِ. وَالصَّلَاةُ وَالسَّلَامُ عَلٰى سَيِّدِنَا مُحَمَّدٍ وَ عَلٰى آلِهِ وَ صَحْبِهِ أَجْمَعِينَ. رَبِّ اشْرَحْ لِي صَدْرِي وَ يَسِّرْ لِي أَمْرِي. رَبِّ إِنِّي ظَلَمْتُ نَفْسِي فَاغْفِرْ لِي. لَٓا إِلٰهَ اِلَّٓا أَنْتَ سُبْحَانَكَۗ إِنِّي كُنْتُ مِنَ الظَّالِمِينَ. اَللّٰهُمَّ إِنَّ هٰذَا الْبَيْتَ بَيْتُكَ ، وَالْحَرَمَ حَرَمُكَ ، وَالْأَمْنَ أَمْنُكَ ، وَالْعَبْدَ عَبْدُكَ ، و أَنَا عَبْدُكَ وَابْنُ عَبْدِكَ ، أَتَيْتُكَ بِذُنُوبٍ كَثِيرَةٍ ، وَ أَعْمَالٍ سَيِّئَةٍ ، وَ هٰذَا مَقَامُ الْعَائِذِ بِكَ مِنَ النَّارِ ، فَحَرِّمْ لُحُومَنَا ، وَ بَشَرَتَنَا عَلَى النَّارِ ، إِنَّكَ أَنْتَ الْغَفُورُ الرَّحِيمُ. رَبِّ اغْفِرْ وَارْحَمْ وَ أَنْتَ خَيْرُ الرَّاحِمِينَ. رَبِّ زِدْنِي عِلْمًا و فَهْمًا وَ أَلْحِقْنِي بِالصَّالِحِينَ. اَللّٰهُمَّ حَبِّبْ إِلَيْنَا الْإِيمَانَ ، وَ زَيِّنْهُ فِي قُلُوبِنَا ، وَ كَرِّهْ إِلَيْنَا الْكُفْرَ وَالْفُسُوقَ وَالْعِصْيَانَ ، وَاجْعَلْنَا مِنَ الرَّاشِدِينَ. اَللّٰهُمَّ اجْعَلْهُ سَعْيًا مَشْكُورًا ، وَ ذَنْبًا مَغْفُورًا ، وَ عَمَلًا صَالِحًا مَقْبُولًا ، وَ تِجَارَةً لَنْ تَبُورَ. رَبَّنَٓا اٰتِنَا فِي الدُّنْيَا حَسَنَةً وَ فِي الْاٰخِرَةِ حَسَنَةً وَ قِنَا عَذَابَ النَّارِ وَ أَدْخِلْنَا الْجَنَّةَ مَعَ الْأَبْرَارِ يَا عَزِيزُ يَا غَفَّارُ يَا رَبَّ الْعَالَمِينَ',
        transliteration:
            " Бисмиллахи Аллаху акбар, аллахумма ииманан бика, ва тасдиикон бикитаабика, ва вафаа’ан биъахдика, ва иттибаа’ан ли-суннати набийика. Субхааналлах, ва л-хамду лиллаах, ва лаа илааха иллаллох, валлаху акбар, ва лаа хаула ва лаа куввата илла биллахи л-'алиййи л-'аъзим. Вас-солаату ва с-салааму ъалаа саййидинаа Мухаммадин ва ъалаа аалихи ва сохбихи ажма'ийин. Рабби ишрах ли садрии, ва йассир ли амрии. Рабби иннии заламту нафсии фагфир лии. Лаа илааха илла анта субхаанака, иннии кунту миназ-зоолимин. Аллохумма инна хаазал-байта байтука,вал-харама харамука, вал-амна амнука, вал-ъабда аъбдука, ва ана аъбдука ва бну  аъбдика, атайтука бизунубин касиратин, ва а‘аъмаалин сайи'атин, ва хааза макоому л-'аъаизи бика минан-наари, фахаррим лухуумана, ва башаратана ъалан-наари, иннака анта л-гафуру р-рахиим. Рабби гфир вархам,ва анта хайру р-рохимиин. Рабби зиднии  иълман ва фахман, ва алхикнии бис-соолихиин. Аллохумма хаббиб илайна л-иимана, ва заййинху фии кулуубинаа,ва каррих илайна л-куфро ва-л-фусууко ва-л-иъсйана, ва-ж’аълнаа минар-роошидиин. Аллохумма иж’аълху са’аъйан машкууран.",
        translation:
            " Аллах Таала бардык айыптардан таза.Бардык мактоолор Аллага  гана болсун! Алладан башка ибадатка татыктуу Зат жок. Алла Таала- баарынан Улуу Зат. Күнөөдөн сактанууга жана моюн сунууга күч кубат бир гана Алланын жардамы менен гана болот. Салам-салаваттар Алланын элчисине болсун.Оо Аллахым! Мен сага ыйман келтирип, китебиңди тастыктап, Сага берген убаданы аткарып, Пайгамбарың Мухаммад ъалайхис саламдын сүннөтүнө ээрчиген абалда бул тавафты баштаймын. Мага бейпилдик берип, ишимди жеңилдет. Аллахым! Мен көп күнөө кылдым, Сенден кечирим сурайм.Оо  Аллахым! Бул Сенин үйүң.Бул харам Сенин харамың. Бул жердин аманчылыгын Сен тургузгансың. Ар бир пенде Сенин пендең жана мен дагы Сенин алсыз пендеңмин жана бир алсыз пендеңдин баласымын. Бул жер- сенин жардамың менен тозок отунан паана суроочу жай. Эттерибизди, тээрилерибизди тозок отуна арам кылгын. Оо Аллахым! Бизге ыйманды сүйкүмдүү кылып,  жүрөктөрүбүздү ыймандын нуру менен нурланткын. Бизге адашууну,  фаасыктыкты жана күнөө иштерди жек көргөзүп койгун. Хидаят табуучу адамдардын катарында кылгын. Оо Аллахым! Пенделериңди кайта тирилте турган күндө азабыңдан сактагын. Оо Аллахым! Эсепсиз Бейишиңди бере көр! Оо Аллахым! Бизге бул дүйнөдө жана акыретте жакшылык бер.Бизди тозок азабынан сактап,бизди бейиште салихтер менен бирге кыл.Оо Аллахым! Оо Кудуреттүү Кечиримдүү Зат! Оо ааламдардын Раббиси!",
      ),
      DuaModel(
        subtitle: 'Үчүнчү айлануунун дуасы',
        arabicText:
            'بِسْمِ اللهِ اَللهُ أَكْبَرُ، اَللّٰهُمَّ إِيمَانًا بِكَ، وَ تَصْدِيقًا بِكِتَابِكَ ، وَ وَفَاءً بِعَهْدِكَ ، وَاتِّبَاعًا لِسُنَّةِ نَبِيِّكَ. سُبْحَانَ اللهِ ، وَالْحَمْدُ لِلهِ ، وَلَٓا إِلٰهَ إِلَّا اللهُ ، وَاللهُ أَكْبَرُ وَلَا حَوْلَ وَلَا قُوَّةَ إِلَّا بِاللهِ الْعَلِيِّ الْعَظِيمِ. وَالصَّلَاةُ وَالسَّلَامُ عَلٰى سَيِّدِنَا مُحَمَّدٍ وَ عَلٰى آلِهِ وَ صَحْبِهِ أَجْمَعِينَ. رَبَّنَا ظَلَمْنَٓا أَنْفُسَنَا وَإِنْ لَمْ تَغْفِرْ لَنَا وَ تَرْحَمْنَا لَنَكُونَنَّ مِنَ الْخَاسِرِينَ. رَبَّنَٓا إِنَّنَٓا اٰمَنَّا فَاغْفِرْ لَنَا وَارْحَمْنَا وَ أَنْتَ خَيْرُ الرَّاحِمِينَ. اَللّٰهُمَّ أَنْتَ رَبِّي لَٓا إِلٰهَ إِلَّا أَنْتَ خَلَقْتَنِي وَ أَنَا عَبْدُكَ وَ أَنَا عَلٰى عَهْدِكَ وَ وَعْدِكَ مَا اسْتَطَعْتُ ، أَعُوذُ بِكَ مِنْ شَرِّ مَا صَنَعْتُ ، أَبُوءُ لَكَ بِنِعْمَتِكَ عَلَيَّ ، وَ أَبُوءُ لَكَ بِذَنْبِي ، فَاغْفِرْ لِي فَإِنَّهُ لَا يَغْفِرُ الذُّنُوبَ إِلَّا أَنْتَ. اَللّٰهُمَّ إِنِّي أَعُوذُ بِكَ مِنَ الْخِيَانَةِ وَالْكُفْرِ وَالشِّرْكِ وَالشِّقَاقِ وَالنِّفَاقِ وَالرِّيَاءِ وَسُوءِ الْأَخْلَاقِ. اَللّٰهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ عِلْمٍ لَا يَنْفَعُ ، وَ مِنْ قَلْبٍ لَا يَخْشَعُ ، وَ مِنْ نَفْسٍ لَا تَشْبَعُ، وَ مِنْ عَيْنٍ لَا تَدْمَعُ ، وَ مِنْ دُعَاءٍ لَا يُسْتَجَابُ. اَللّٰهُمَّ اجْعَلْهُ سَعْيًا مَشْكُورًا ، وَ ذَنْبًا مَغْفُورًا، وَ عَمَلًا صَالِحًا مَقْبُولًا ، وَ تِجَارَةً لَنْ تَبُورَ. يَا عَالِمَ مَا فِي الصُّدُورِ ، أَخْرِجْنِي يَا اَللهُ مِنَ الظُّلُمَاتِ إِلَي النُّورِ. رَبَّنَٓا اٰتِنَا فِي الدُّنْيَا حَسَنَةً وَ فِي الْاٰخِرَةِ حَسَنَةً وَ قِنَا عَذَابَ النَّارِ وَ أَدْخِلْنَا الْجَنَّةَ مَعَ الْأَبْرَارِ يَا عَزِيزُ يَا غَفَّارُ يَا رَبَّ الْعَالَمِينَ.',
        transliteration:
            " Бисмиллахи аллаху акбару, аллахумма ииманан бика, ва тасдикон бикитаабика, ва вафаа’ан биъахдика, ва иттибаан ли-суннати набийика. Субханаллах, вал-хамду лиллахи, ва лаа илаха иллаллоху, валлоху акбар, ва лаа хаула ва лаа куввата илла биллахи л-аълиййи л-аъзиим. Вас-солаату ва с-саламу ъала саййидина Мухаммад ва ъалаа аалихи ва сахбихи ажмаъиин. Раббана заламна анфусана ва иллам тагфир ланаа ва тархамнаа ланакуунанна минал-хоосириин. Раббанаа иннаннаа ааманнаа фагфир ланаа ва р-рахамнаа ва 'анта хойру р-роохимиин. Аллохумма анта рабби лаа илааха илла анта холактании ва ана аъбдука ва ана аълаа аъхдика ва-ваъдика ма истатоъту,  ауъзу бика мин-шарри ма сонаъту,  абуу’у лака биниъматика аълайа,  абуу’у лака бизамбии,  фагфир лии фа'иннаху лаа ягфируз-зунууба илла анта. Аллохумма иннии ауъузу бика мин-хыяанати, вал-куфри,ваш-ширки,ваш-шикоокы, ван-нифаакы, вар-рийаа,вас-суу'ил-ахлаак. Аллохумма иннии ауъзу бика мин иълмин лаа янфауъ, ва мин колбин лаа яхшаъ, ва мин нафсин лаа ташбаъ, ва мин аъйнин лаа тадмаъ, ва мин дуаъа'ин ла юстажаабу. Аллохумма иж’аълху са’аъян машкуурон. Я аълиим ма фис- судуур, ахрижнии яа Аллах  миназ-зулумаати илан-нуур. Раббанаа аатина фид-дунйаа хасанатан ва фил-аахыроти хасанатан, ва кына аъзаабан-наари, ва адхылнаа  ал-жанната ма’аъл-абраари.Яа аъзиизу, Яа гоффаару, Яа Роббал-аъаламиин. ",
        translation:
            ' Аллах Таала бардык айыптардан таза,бардык мактоолор Аллахга  гана болсун! Аллахтан башка ибадатка татыктуу Зат жок. Аллах Таала- баарынан Улуу Зат. Күнөөдөн сактанууга жана моюн сунууга күч кубат бир гана Алланын жардамы менен гана болот. Алланын элчисине салам-салаваттар болсун.Оо  Аллахым! Мен сага ыйман келтирип,китебиңди тастыктап, Сага берген убаданы аткарып, Пайгамбарың Мухаммад ъалайхис саламдын сүннөтүнө ээрчип бул тавафты баштаймын. Оо Аллахым! Биз өзүбүзгө адилетсиздик кылдык. Эгерде Сен бизди кечирип бизге ырайым кылбасаң, анда биз кыйроого дуушар болобуз. Оо Аллахым! Ыйман келтирдик, бизди кечир, бизге ырайым кыл, Сен ырайымдуулардын эң ырайымдуусусуң. Аллахым, Сен менин Раббимсиң. Сенден башка кудай жок. Сен мени жараттың жана мен Сенин кулуңмун.Мени кечир, анткени Сенден башка эч ким күнөөлөрдү кечире  албайт. Оо Аллахым! Шек-күмөнгө түшүүдөн, ширктен, акмактыктан, эки жүздүүлүктөн,  жаман кулк мүнөздөн, кыжаалат кыла турган көрүнүштөн  жана үй-бүлө, балдардын алдына жаман абалда кайтып баруудан паана тилеймин. Тирүүлүктөгү жана жан берип жаткан учурдагы фитнадан жана дүйнө,акыретте кор болуудан паана сурайм. Оо Аллахым! Аракетибизди текке кетирбе, күнөөлөрүбүздү кечир,  амалдарыбызды женил кыл жана кабыл кыл. Бизге эч качан жоготууларды алып келбеген руханий сооданы бер.Оо баарын билүүчү Аллах!Бизди караңгылыктан жарыкка чыгар.Оо Аллахым! Бизге бул дүйнөдө жана акыретте жакшылык бер.Бизди тозок азабынан сакта. Бизди салихтер менен бирге бейишке киргиз. Оо кудуреттүү Зат! Оо Кечиримдүү! Оо ааламдардын Раббиси!',
      ),
      DuaModel(
        subtitle: '  Төртүнчү айлануунун дуасы',
        arabicText:
            'بِسْمِ اللهِ اَللهُ أَكْبَرُ، اَللّٰهُمَّ إِيمَانًا بِكَ ، وَ تَصْدِيقًا بِكِتَابِكَ ، وَ وَفَاءً بِعَهْدِكَ ، وَاتِّبَاعًا لِسُنَّةِ نَبِيِّكَ. سُبْحَانَ اللهِ ، وَالْحَمْدُ لِلهِ ، وَلَٓا إِلٰهَ إِلَّا اللهُ ، وَاللهُ أَكْبَرُ وَلَا حَوْلَ وَلَا قُوَّةَ إِلَّا بِاللهِ الْعَلِيِّ الْعَظِيمِ. وَالصَّلَاةُ وَالسَّلَامُ عَلٰى سَيِّدِنَا مُحَمَّدٍ وَ عَلٰى آلِهِ وَ صَحْبِهِ أَجْمَعِينَ. اَللّٰهُمَّ إِنِّي أَسْأَلُكَ مُوجِبَاتِ رَحْمَتِكَ ، وَ عَزَائِمَ مَغْفِرَتِكَ ، وَالسَّلَامَةَ مِنْ كُلِّ إِثْمٍ، وَالْغَنِيمَةَ مِنْ كُلِّ بِرٍّ ، وَالْفَوْزَ بالْجَنَّةِ ، وَالنَّجَاةَ مِنَ النَّارِ. رَبِّ قَنِّعْنِي بِمَا رَزَقْتَنِي ، وَ بَارِكْ لِي فِيمَا أَعْطَيْتَنِي ، وَاخْلُفْ عَلَيَّ كُلَّ غَائِبَةٍ لِي مِنْكَ بِخَيْرٍ. رَبَّنَا لَا تُؤَاخِذْنَٓا إِنْ نَسِينَٓا أَوْ أَخْطَأْنَا ، رَبَّنَا وَ لَا تَحْمِلْ عَلَيْنَٓا إِصْرًا كَمَا حَمَلْتَهُ عَلَى الَّذِينَ مِنْ قَبْلِنَا ، رَبَّنَا وَلَا تُحَمِّلْنَا مَا لَا طَاقَةَ لَنَا بِهِ ، وَاعْفُ عَنَّا وَاغْفِرْ لَنَا وَارْحَمْنَا ، أَنْتَ مَوْلٰينَا فَانْصُرْنَا عَلَى الْقَوْمِ الْكَافِرِينَ. اَللّٰهُمَّ طَهِّرْ قَلْبِي مِنَ النِّفَاقِ ، وَ عَمَلِي مِنَ الرِّيَاءِ ، وَ لِسَانِي مِنَ الْكَذِبِ ، وَ عَيْنِي مِنَ الْخِيَانَةِ ، فَإِنَّكَ تَعْلَمُ خَائِنَةَ الأَعْيُنِ وَ مَا تُخْفِي الصُّدُورُ. اَللّٰهُمَّ اهْدِنِي لِأَحْسَنِ الْأَعْمَالِ وَ أَحْسَنِ الْأَخْلَاقِ ، لَا يَهْدِي لِأَحْسَنِهَا إِلَّا أَنْتَ ، وَ قِنِي سَيِّءَ الْأَعْمَالِ وَ سَيِّءَ الْأَخْلَاقِ ، لَا يَقِي سَيِّئَهَا إِلَّا أَنْتَ. رَبَّنَٓا اٰتِنَا فِي الدُّنْيَا حَسَنَةً وَ فِي الْاٰخِرَةِ حَسَنَةً وَ قِنَا عَذَابَ النَّارِ وَ أَدْخِلْنَا الْجَنَّةَ مَعَ الْأَبْرَارِ يَا عَزِيزُ يَا غَفَّارُ يَا رَبَّ الْعَالَمِينَ.',
        transliteration:
            "Бисмиллахи аллаху акбару, аллахумма ииманан бика, ва тасдикон бикитаабика, ва вафаа’ан биъахдика, ва иттибаа’ан ли-суннати набийика. Субханаллах, вал-хамду лиллахи, ва лаа илаха иллаллоху, валлоху акбару, ва лаа хаула ва лаа куввата илла биллахил-аълийил-аъзиим. Вас-солаату вас-салааму аълаа сайидина Мухаммад ва аълаа аалиихи ва сахбихи ажмаиъин. Аллохумма иннии ас-’алука муужибаати рохматика,ва аъзааима магфиротика, вас-салаамата мин кулли исмин, вал-гониимата мин кулли биррин, вал-фавза бил-жанна, ван-нажаата минан-наар. Рабби канниъ’нии бима розактании, ва баарик лии фиимаа аътойтании, вахлуф аълайа кулла гоо’ибатин лии минка бихойрин. Раббана лаа туаахизнаа ин’насийнаа ау ахто’наа, раббанаа ва лаа тахмил аълайнаа исрон кама хамалтаху аълал-лазийна мин коблинаа, раббанаа ва лаа тухаммилнаа маа лаа тоокота ланаа бихи, ва’аъфу аъннаа вагфир ланаа вархамнаа, анта маулаанаа фансурнаа аълал-коумил-каафириин. Аллохумма тоххир колбии минан-нифаакы, ва аъмалии минар-рияа, ва лисаании минал-казиби, ва аъйнии минал-хыйанати, фа’иннака та’аъламу хоо’инатал-а’аъюн, ва ма тухфис-судуур. Аллохумма ихдинии ли-ахсанил-а’аъмали ва ахсанил-ахлааки, лаа яхдии ли-ахсанихаа илла анта, вакынии сайи-’ал-а’аъмали ва сайи’ал-ахлааки, лаа якыы сайи’ахаа илла анта. Роббанаа аатинаа фид-дунйа хасанатан ва фил-аахыроти хасанатан, ва кинаа аъзаабан-наари,ва адхылнаал-жанната ма’аъл-аброори. Яа Аъзиизу, Яа Гоффаару, Яа Роббал-аъаламиин. ",
        translation:
            'Аллах Таала кемчиликтен алыс. Аллахка мактоолор болсун. Аллахтан башка кудай жок. Аллах улук. Бардык күч жана күч Алла Таалага таандык. Пайгамбарыбыз Мухаммад(саллаллаху алейхи васаллам), анын үй-бүлөсүнө жана сахабаларына салам жана салаваттар болсун. Оо Аллахым! Мени Өзүңдүн ырайымыңа жеткир. Мага Сенин кечиримине жана ырайымыңа себеп боло турган амалдарды жасоого жардам бер. Мени бардык күнөөлөрдөн алыс кыл. Мага ар бир жакшылыкка жетүүгө жардам бер, мени Бейишке киргиз жана тозоктон сакта.Оо Аллахым! Мага берген ырыскыңа шүгүр кылуучулардан кыл жана мага пайдалуу жана берекелүү ырыскы бер. Мен ала албаган нерсени жашоомо киргизип, анын ордуна мага жакшыраак насип кыл. Оо Аллахым! Эгер биз унутуп же ката кетирсек, анда ал үчүн бизди жазалаба. Мурунку муундарга жүк кылгандай, бизге оор жүк салба. Бизге көтөрө албаган жүктү бере көрбө. Бизди кечир, бизге ырайым кыл, Сен биздин Раббибизсиң. Бизге каапырларга каршы жардам бер. Оо Аллахым! Жүрөгүмдү эки жүздүүлүктөн, амалдарымды эл көрсөндүктөн, тилимди жалган сүйлөөдөн, көзүмдү кыянаттыктан тазала! Ал тургай биздин жүрөгүбүздө катылган сырларды да билесиң. Оо Аллахым! Мага эң жакшы амалдарга жана эң сонун адеп-ахлакка жетүүгө жардам бер. Муну Сен гана жасай аласың. Мени жаман иштерден жана жаман ахлактан сакта, муну Сен гана кыла аласың. Оо,Аллахым! Бизге бул дүйнөдө жана акыретте жакшылык бер. Бизди тозок азабынан сакта. Бизди салихтер менен бирге бейишке киргиз.Оо, Жараткан! Оо, Кечиримдүү Зат! Оо, Ааламдардын Раббиси!',
      ),
      DuaModel(
        subtitle: ' Бешинчи айлануунун дуасы',
        arabicText:
            'بِسْمِ اللهِ اَللهُ أَكْبَرُ، اَللّٰهُمَّ إِيمَانًا بِكَ ، وَ تَصْدِيقًا بِكِتَابِكَ ، وَ وَفَاءً بِعَهْدِكَ ، وَاتِّبَاعًا لِسُنَّةِ نَبِيِّكَ. سُبْحَانَ اللهِ ، وَالْحَمْدُ لِلهِ ، وَلَٓا إِلٰهَ إِلَّا اللهُ ، وَاللهُ أَكْبَرُ، وَلَا حَوْلَ وَلَا قُوَّةَ إِلَّا بِاللهِ الْعَلِيِّ الْعَظِيمِ. وَالصَّلَاةُ وَالسَّلَامُ عَلٰى سَيِّدِنَا مُحَمَّدٍ وَ عَلٰى آلِهِ وَ صَحْبِهِ أَجْمَعِينَ. رَبِّ هَبْ لِي مِنْ لَدُنْكَ ذُرِّيَّةً طَيِّبَةً ، إِنَّكَ سَمِيعُ الدُّعَٓاءِ. رَبِّ اجْعَلْنِي مُقِيمَ الصَّلٰوةِ وَ مِنْ ذُرِّيَّتِي رَبَّنَا وَ تَقَبَّلْ دُعَٓاءِ. رَبِّ هَبْ لِي مِنَ الصَّالِحِينَ. تَوَفَّنِي مُسْلِمًا وَ أَلْحِقْنِي بِالصَّالِحِينَ. رَبَّنَا هَبْ لَنَا مِنْ أَزْوَاجِنَا وَ ذُرِّيَّاتِنَا قُرَّةَ أَعْيُنٍ وَاجْعَلْنَا لِلْمُتَّقِينَ إِمَامًا. اَللّٰهُمَّ أَظِلَّنِي تَحْتَ ظِلِّ عَرْشِكَ يَوْمَ لَا ظِلَّ إِلَّا ظِلُّكَ ، وَلَا بَاقِيَ إِلَّا وَجْهُكَ ، وَاسْقِنِي مِنْ حَوْضِ نَبِيِّكَ مُحَمَّدٍ صَلَّى اللهُ عَلَيْهِ وَ سَلَّمَ شَرْبةً هَنِيئَةً مَرِيئَةً لَا أَظْمَأُ بَعْدَها أَبَداً. اَللّٰهُمَّ إِنِّي أَسْأَلُكَ مِنَ الْخَيْرِ كُلِّهِ عَاجِلِهِ وَ آجِلِهِ ، مَا عَلِمْتُ مِنْهُ وَ مَا لَمْ أَعْلَمْ ، وَ أَعُوذُ بِكَ مِنَ الشَّرِّ كُلِّهِ ، عَاجِلِهِ وَ آجِلِهِ مَا عَلِمْتُ مِنْهُ وَ مَا لَمْ أَعْلَمْ ، وَ أَسْأَلُكَ الْجَنَّةَ وَ مَا قَرَّبَ إِلَيْهَا مِنْ قَوْلٍ أَوْ عَمَلٍ ، وَ أَعُوذُ بِكَ مِنَ النَّارِ وَ مَا قَرَّبَ إِلَيْهَا مِنْ قَوْلٍ أَوْ عَمَلٍ. وَ أَسْأَلُكَ خَيْرَ مَا سَأَلَكَ عَبْدُكَ وَ رَسُولُكَ مُحَمَّدٌ صَلَّى اللهُ عَلَيْهِ وَ سَلَّمَ ، وَ أَعُوذُ بِكَ مِنْ شَرِّ مَا اسْتَعَاذَ مِنْهُ عَبْدُكَ وَ رَسُولُكَ مُحَمَّدٌ صَلَّى اللهُ عَلَيْهِ وَ سَلَّمَ. رَبَّنَٓا اٰتِنَا فِي الدُّنْيَا حَسَنَةً وَ فِي الْاٰخِرَةِ حَسَنَةً وَ قِنَا عَذَابَ النَّارِ وَ أَدْخِلْنَا الْجَنَّةَ مَعَ الْأَبْرَارِ يَا عَزِيزُ يَا غَفَّارُ يَا رَبَّ الْعَالَمِينَ.',
        transliteration:
            "Бисмиллахи аллаху акбару,аллохумма иимаанан бикат, ва тасдиикон бикитаабика, ва вафаа’ан биаъхдика, ва иттибаа’ан ли-суннати набийика. Субхааналлах, вал-хамду лиллахи,ва лаа илааха иллаллоху, валлоху акбару, ва лаа хаула ва лаа куввата илла биллахил-аълийил-аъзиим. Вас-солаату вас-салааму аълаа сайидинаа Мухаммад ва аълаа аалихи ва сохбихи ажмаиъин. Рабби хаб-лии мин ладунка зуррийатан тойибатан, иннака самииуъд-дуаъа. Рабби ижаълнии мукыымас-солаати ва мин зуррийатии. Раббанаа ва такоббал дуаъа. Рабби хаб-лии минас-соолихиин. Таваффании муслиман ва алхикнии бис-соолихиин. Раббана хаб ланаа мин азваажинаа ва зуррийатинаа куррота а’аъйунин важаълнаа лил-муттакыына имаама. Аллохумма азиллании тахта зилли аршика явма ла зилла илла зиллука, ва ла баакыя илла важхука, васкынии мин хауды набийика Мухаммадин соллаллаху аълайхи ва саллама шарбатан хании’атан марии'атан ла азма’у ба’аъдахаа абадан. Аллохумма иннии ас’алука минал-хойри куллихи аажилихи ва аъжилихи, маа аълимту минху ва маа лам аълам,ва ауъзу бика минаш-шарри куллихи, аъжилихи ва аажилихи, маа аълимту минху ва маа лам а’аълам, ва ас’алукал-жанната ва маа корраба илайхаа мин ковлин ав  аъмалин, ва ауъзу бика минан-наари ва маа корраба илайхаа мин ковлин ав  аъмалин. Ва ас’алука хойра маа са’алака аъбдука ва расуулука Мухаммад соллаллаху аълайхи ва саллама,ва ауъзу бика мин шарри ма истааъаза минху аъбдука ва расуулука Мухаммад соллаллаху  аълайхи ва саллама.Раббанаа аатинаа фид-дунйа хасанатан ва фил-аахыроти хасанатан, ва кынаа аъзаабан-наари, ва адхылнаал-жанната ма’аъл-аброори. Яа Аъзиизу, Яа Гоффаару, Яа Роббал-аъаламиин.",
        translation:
            ' Аллах Таала кемчиликтен алыс. Аллахка мактоолор болсун.  Аллахтан башка кудай жок. Аллах улук. Бардык күч  Алла Таалага таандык. Пайгамбарыбыз Мухаммад(саллаллаху алейхи васаллам), анын үй-бүлөсүнө жана сахабаларына салам жана салаваттар болсун.Оо Аллахым! Мээримиңден таза муун насип эт. Албетте, сен дубаны туура угуп жатасың. Оо Аллахым! Мени дайыма намаз окугандардан кыл. Аллахым тилегимди кабыл кыл. Оо Аллахым! Мага салих урпак бер. Менин рухумду Ислам абалында ал жана мени салихтерге кош. Оо Аллахым! Мээримиң менен бизге үй-бүлөнүн, балдардын амандыгын бер жана бизди Аллахтан корккондор үчүн үлгү кыл. Оо Аллахым! Көлөкөсү жок жана Сенин улуулугуңдан башка эч нерсе калбай турган күнү мени Аршыңдын көлөкөсүнө ал.Мага ушундай ырайым бер, мен эч качан суусабайм. Оо Аллахым! Мен өзүм билген жана билбеген баардык жамандыктардан сактануу сураганымдай, өзүм билген жана билбеген бардык жакшылыктарды да Сенден сурайм. Мага бейишке кирүүнү насип кыл  жана мени тозок отунан сакта. Оо Аллахым! Сенин кулуң жана элчиң Мухаммад сенден сураган нерселердин баарын Сенден сурайм. Жана ал качкан бардык нерседен мени коргоңду сурайм. Оо Аллахым! Бизге бул дүйнөдө жана акыретте жакшылык бер.Бизди тозок азабынан сакта. Бизди салихтер менен бирге бейишке киргиз. Оо,Жараткан! Оо,Кечиримдүү Зат! Оо,Ааламдардын Раббиси!',
      ),
      DuaModel(
        subtitle: ' Алтынчы айлануунун дуасы',
        arabicText:
            'بِسْمِ اللهِ اَللهُ أَكْبَرُ، اَللّٰهُمَّ إِيمَانًا بِكَ ، وَ تَصْدِيقًا بِكِتَابِكَ ، وَ وَفَاءً بِعَهْدِكَ ، وَاتِّبَاعًا لِسُنَّةِ نَبِيِّكَ . سُبْحَانَ اللهِ ، وَالْحَمْدُ لِلهِ ، وَلَٓا إِلٰهَ إِلَّا اللهُ ، وَاللهُ أَكْبَرُ، وَلَا حَوْلَ وَلَا قُوَّةَ إِلَّا بِاللهِ الْعَلِيِّ الْعَظِيمِ. وَالصَّلَاةُ وَالسَّلَامُ عَلٰى سَيِّدِنَا مُحَمَّدٍ وَ عَلٰى آلِهِ وَ صَحْبِهِ أَجْمَعِينَ. رَبَّنَٓا اٰتِنَا مِنْ لَدُنْكَ رَحْمَةً وَهَيِّئْ لَنَا مِنْ أَمْرِنَا رَشَدًا. وَاكْتُبْ لَنَا فِي هٰذِهِ الدُّنْيَا حَسَنَةً وَ فِي الْاٰخِرَةِ إِنَّا هُدْنَٓا إِلَيْكَ. رَبَّنَٓا أَفْرِغْ عَلَيْنَا صَبْرًا وَ تَوَفَّنَا مُسْلِمِينَ. رَبَّنَٓا أَفْرِغْ عَلَيْنَا صَبْرًا وَ ثَبِّتْ أَقْدَامَنَا وَانْصُرْنَا عَلَى الْقَوْمِ الْكَافِرِينَ. رَبَّنَا اغْفِرْ لَنَا وَ لِإِخْوَانِنَا الَّذِينَ سَبَقُونَا بِالْاِيمَانِ وَ لَا تَجْعَلْ فِي قُلُوبِنَا غِلًّا لِلَّذِينَ اٰمَنُوا رَبَّنَٓا إِنَّكَ رَؤُوفٌ رَحِيمٌ. اَللّٰهُمَّ إِنَّ لَكَ عَلَيَّ حُقُوقًا كَثِيرَةً فِيمَا بَيْنِي وَ بَيْنَكَ ؛ وَحُقُوقًا كَثِيرَةً فِيمَا بَيْنِي وَبَيْنَ خَلْقِكَ ، اَللّٰهُمَّ مَا كَانَ لَكَ مِنْهَا فَاغْفِرْهُ لِي ، وَمَا كَانَ لِخَلْقِكَ فَتَحَمَّلْهُ عَنِّي. وَأَغْنِنِي بِحَلَالِكَ عَنْ حَرَامِكَ وَ بِطَاعَتِكَ عَنْ مَعْصِيَتِكَ وَ بِفَضْلِكَ عَمَّنْ سِوَاكَ يَا وَاسِعَ الْمَغْفِرَةِ. رَبَّنَٓا اٰتِنَا فِي الدُّنْيَا حَسَنَةً وَ فِي الْاٰخِرَةِ حَسَنَةً وَ قِنَا عَذَابَ النَّارِ وَ أَدْخِلْنَا الْجَنَّةَ مَعَ الْأَبْرَارِ يَا عَزِيزُ يَا غَفَّارُ يَا رَبَّ الْعَالَمِينَ.',
        transliteration:
            " Бисмиллахи аллаху акбар,аллoхумма иимаанан бика, ва тасдиикон бикитаабика, ва вафаа’ан биаъхдика, ва аттибаа’ан лисуннати набийика. Субхааналлахи вал-хамду лиллахи, ва лаа илааха иллаллаху, валлаху акбару, ва лаа хавла ва лаа куввата иллa биллахил-аълийил-аъзиим. Вас-солаату вас-салааму аълаа сайидинаа Мухаммадин ва аълаа аалихи ва сохбихи ажмаиъин. Раббанаа аатинаа мин ладунка рахматан ва хай’и ланаа мин амринаа рошада. Вактуб ланаа фи хазихид-дунйа хасанатан ва фил-аахыроти иннаа худнаа илайка. Роббанаа африг аълайнаа соброн ва таваффанаа муслимиин. Раббанаа африг аълайна собран ва саббит акдaаманаа вансурнаа аълал-ковмил-каафириин. Роббана игфир ланаа вали-ихваанинаа аллазина сабакуунаа бил-иимани ва лаа тажаъл фи кулуубинаа гиллан лиллазина ааману. Раббана иннака Роууфур-Рохиим. Аллохумма иннa лака аълайa хукуукон касиротан маа байнии ва байнака,  ва хукуукон касиротан маа байнии ва байна холкыка.Аллохумма маа каана лака минха фагфирху ли,  ва маа каана ли холкыка фатахаммалху аъннии. Ва агнинии бихалаалика аън хароомик ва битооаътика аън ма’аъсиятика ва бифадлика аъмман сиваака яа ваасиаъл-магфироти. Раббанаа аатинаа фид-дунйа хасанатан ва фил-аахыроти хасанатан, ва кынаа аъзаабан-наари, ва адхылнаал-жанната ма’аъл-аброори. Яа Аъзиизу, Яа Гоффаару, Яа Роббал-аъаламиин.",
        translation:
            'Оо Аллахым! Бизге Өзүң ырайым кыл жана Сенин ыйманыңды сактоону бизге жеңил кыл. Чындыгында, Сен дубаны Угуучусуң. Оо Аллахым! Бизге бул дүйнөдө да, акыретте да жакшылык бер, анткени биз Сага алып баруучу жолдобуз. Оо Аллахым! Бизге ырайым кыл,бутубузду бекем кыл жана каапырларга каршы турууга жардам бер. Оо Аллахым! Бизге сабырдуулук бер жана жүрөгүбүздө сакта. Момундарга душмандык кылуубузга жол бербе. Оо Аллахым! Сен өтө Мээримдүү жана өтө Боорукерсиң. Оо Аллахым! Сенин кулдарыңдын менин үстүмдө акысы көп болгон сыяктуу, Сенин менин үстүмдө көп акың бар экенин билем. Өзүңдүн алдыңда менин кемчиликтеримди кечирип, жараткандарыңдын таасиринен сактооңду суранам. Мага уруксат берилгенди гана бер, арамдан сактануу үчүн күнөөлөрдөн сактануу үчүн мени Өзүңдүн кызматыңда кыл. Мага молчулук бер, эч кимге муктаж кыла көрбө. Оо,Аллахым! Сен өтө Кечиримдүүсүң!Оо,Аллахым! Бизге бул дүйнөдө жана акыретте жакшылык бер. Бизди тозок азабынан сакта. Бизди салихтар менен бирге бейишке киргиз. Оо,Аллахым! Оо,  Кечиримдүү Зат! Оо,ааламдардын Раббиси!',
      ),
      DuaModel(
        subtitle: 'Жетинчи айлануунун дуасы',
        arabicText:
            'بِسْمِ اللهِ اَللهُ أَكْبَرُ، اَللّٰهُمَّ إِيمَانًا بِكَ ، وَ تَصْدِيقًا بِكِتَابِكَ، وَ وَفَاءً بِعَهْدِكَ ، وَاتِّبَاعًا لِسُنَّةِ نَبِيِّكَ . سُبْحَانَ اللهِ ، وَالْحَمْدُ لِلهِ ، وَلَٓا إِلٰهَ إِلَّا اللهُ ، وَاللهُ أَكْبَرُ وَلَا حَوْلَ وَلَا قُوَّةَ إِلَّا بِاللهِ الْعَلِيِّ الْعَظِيمِ . وَالصَّلَاةُ وَالسَّلَامُ عَلٰى سَيِّدِنَا مُحَمَّدٍ وَ عَلٰى آلِهِ وَ صَحْبِهِ أَجْمَعِينَ. اَللّٰهُمَّ إِنِّي أَسْأَلُكَ إِيمَانًا كَامِلًا ، وَ يَقِينًا صَادِقًا ، وَ رِزْقًا وَاسِعًا حَلَالًا طَيِّبًا، وَ قَلْبًا خَاشِعًا ، وَ لِسَانًا ذَاكِرًا ، وَ تَوْبَةً نَصُوحًا، وَ عِلْمًا نَافِعًا. اَللّٰهُمَّ إِنِّي أَسْأَلُكَ الْهُدَى وَالتُّقَى وَالْعَفَافَ وَالْغِنَى . اَللّٰهُمَّ إِنِّي أَسْأَلُكَ الصِّحَّةَ وَ الْعِفَّةَ وَ الْأَمَانَةَ وَ حُسْنَ الْخُلُقِ وَ الرِّضَى بِالْقَدَرِ. اَللّٰهُمَّ إِنِّي أَسْأَلُكَ الطَيِّبَاتِ ، وَ تَرْكَ الْمُنْكَرَاتِ ، وَ حُبَّ الْمَسَاكِينِ ، وَ أَنْ تَتُوبَ عَلَيَّ ، وَ تَغْفِرَ لِي وَ تَرْحَمَنِي. اَللّٰهُمَّ اغْفِرْ لِي جَمِيعَ مَا مَضَى مِنْ ذَنْبِي، وَاعْصِمْنِي فِيمَا بَقِيَ مِنْ عُمْرِي، وَارْزُقْنِي عَمَلًا زَاكِيًا تَرْضَى بِهِ عَنِّي. اَللّٰهُمَّ لَا تَكِلْنِي إِلٰى نَفْسِي طَرْفَةَ عَيْنٍ، وَ لَا تَنْزِعْ مِنِّي صَالِحَ مَا أَعْطَيْتَنِي. رَبَّنَا اغْفِرْ لِي وَ لِوَالِدَيَّ وَ لِلْمُؤْمِنِينَ يَوْمَ يَقُومُ الْحِسَابُ. رَبَّنَٓا اٰتِنَا فِي الدُّنْيَا حَسَنَةً وَ فِي الْاٰخِرَةِ حَسَنَةً وَ قِنَا عَذَابَ النَّارِ وَ أَدْخِلْنَا الْجَنَّةَ مَعَ الْأَبْرَارِ يَا عَزِيزُ يَا غَفَّارُ يَا رَبَّ الْعَالَمِينَ .',
        transliteration:
            "Бисмиллахи аллаху акбар, аллoхумма иимаанан бика, ва тасдиикон бикитаабика, ва вафаа’ан биаъхдика, ва аттибаа’ан лисуннати набийика, субхааналлахи, вал-хамду лиллахи, ва лаа илааха иллаллаху, валлаху акбару, ва лаа хавла ва лаа куввата иллa биллахил-аълийил-аъзиим. Вас-солаату вас-салааму аълаа сайидинаа Мухаммадин ва аълаа аалихи ва сохбихи ажмаиъин. Аллохумма иннии ас’алука иимаанан каамилан, ва яакыынан соодикон, ва ризкон ваасиаън халаалан тойибан, ва колбан хоошиаън, ва лисаанан заакирон, ва таубатан насухан, ва  иълман наафиаън. Аллохумма иннии ас’алукал-худаа ват-тукоо вал-аъфаафа вал-гинаа. Аллохумма иннии ас’алукас-сиххата вал-иъффата вал-амааната ва хуснал-хулюкы вар-рыдоо бил-кодари .Аллохумма иннии ас’алука тойибаати, ва таркал-мункарооти, ва хуббал-масаакииини, ва ан татууба аълайа, ва тагфиро лии ва тархамани. Аллохумма игфир лии жамиаъ маа мадоо мин замбии, ва’аъсимнии фиимаа бакыя мин уъмрии, варзукнии аъмалан заакиян тард̣оо бихи аъннии. Аллохумма лаа такылни илаа нафсии торфата аъйнии, ва лаа танзи’иъ миннии соолиха ма а’аътойтании. Раббана агфир лии ва ливаалидайя ва лил-му’миниина явма якуумул-хисаабу. Раббанаа аатинаа фид-дунйа хасанатан ва фил-аахыроти хасанатан,ва кынаа аъзаабан-наари, ва адхылнаал-жанната ма’аъл-аброори. Яа Аъзиизу, Яа Гоффаару, Яа Роббал-аъаламиин.",
        translation:
            'Аллах Таала кемчиликтен алыс. Аллахка мактоолор болсун. Аллахтан башка кудай жок. Аллах улук. Бардык күч жана күч Алла Таалага таандык. Пайгамбарыбыз Мухаммад(саллаллаху алейхи васаллам),анын үй-бүлөсүнө жана сахабаларына салам жана салаваттар болсун. Оо Аллахым! Мен Сенден кемчиликсиз ыйман, чыныгы ишеним, берекелүү жана адал ырыскы, Өзүңдөн корко турган жүрөк, сага шүгүр кылуучу тил, дайыма чын жүрөктөн тообо дил жана пайдалуу илим сурайм. Аллахым сенден хидаят, такыбалык, уяттуулук жана байлык сурайм. Оо Аллахым! Сенден ден соолук, уяттуулук, аманатка берилгендик, жакшы адеп-ахлак жана сенин каалооң менен ыраазылык сурайм.Оо Аллахым! Сенден жакшы амалдарды кылууну жана жакшылыктарды сактоону, жамандыктан кайтарууну,  кедей-кембагалдарды сүйүүнү сурайм, күнөөлөрүмдүн кечирилишин жана өзүмө ырайымын тилеймин.Оо Аллахым! Сенден менин мурунку кылган күнөөлөрүмдү кечир, калган өмүрүмдө күнөөлөрдөн сакташыңды суранам. Өзүң ыраазы боло турган таза амалдарды кылууну насип кыл. Оо Аллахым! Кыямат күнү сенден мени, ата-энемди жана бардык момундарды кечирүүңдү сурайм. Оо Аллахым! Бизге бул дүйнөдө да, акыретте да жакшылыктарды бер. Бизди тозок азабынан сакта жана салихтер менен бирге бейишке киргиз. Оо Кудуреттүү Зат! Оо  Мээримдүүлөрдүн Мээримдүүсү, ааламдардын Раббиси!Оо Аллахым! Мени бир көз ирмемге өзүмдүн напсим менен калтырба. Мага берген ырайымыңан куру калтырба.',
      ),
      DuaModel(
        subtitle:
            ' Таваф намазынан кийин Маком Ибрахимде Адам Алайхис-Саламдын дуаларын окуу',
        arabicText:
            'اللَّهُمَّ إِنَّكَ تَعْلَمُ سِرِّي وَتعْلَمُ نِيَّتِي فَاقْبَلْ مَعْذِرَتِي وَتَعْلَمُ حَاجَتِي فَاقْضِ سُؤْلِي وَتَعْلَمُ ما فِي نَفْسِي فَاغْفِرْ لِي ذُنُوبِي. اللَّهُمَّ إِنِّي أَسْأَلُكَ إِيمَانًا يُبَشِّرُ قَلْبِي وَيَقِينًا صَادِقًا حَتَّى أَعْلَمَ أَنَّهُ لَا يُصِيبُنِي إِلَّا مَا كَتَبْتَ لِي وَرِضًا بِمَا قَسَّمْتَ لِي يَا أَرْحَمَ الرَّاحِمِينَ.',
        transliteration:
            "Аллохумма иннака таъламу сиррии ва таъламу нийатии факбал ма’аъзиротии ва таъламу хаажатии факды су’лии ва таъламу маа фии нафсии фагфир лии зунуубии. Аллохумма иннии ас’алука иимаанан юбашширу колбии ва якиинан соодикон хатта а’аълама аннаху лаа юсиибунии илла маа катабта лии ва ридон бимаа коссамта лии яаа архамар-роохимиин. ",
        translation:
            'Оо Аллахым! Сен менин ички жана сырткы абалымды жакшы билесиң, менин кечиримимди кабыл кыл. Муктаждыгымды да билесиң, сураганымды бер. Жүрөгүмдү да билесиң, күнөөлөрүмдү кечир.Оо Аллахым!  Мен сенден,  мага эмнени жазган болсоң,  ошол нерселер гана жетээрин биле турган жана сен мага тагдырга жазган нерселерге ыраазы боло турган жүрөктөгү бекем ыйманды жана чыныгы ишенимди сураймын.',
      ),
      DuaModel(
        subtitle: 'Зам-зам сууну ичүү дуасы',
        arabicText:
            'اللَّهُمَّ إِنِّي أَسْأَلُكَ عِلْمًا نَافِعًا وَرِزْقًا وَاسِعًا وَشِفَاءً مِنْ كُلِّ دَاءٍ.',
        transliteration:
            "Аллохумма иннии ас’алука иълман наафиаън ва ризкон ваасиаън ва шифаа’ан мин кулли даа’ин. ",
        translation:
            'Оо Аллахым!  Сенден пайдалуу илим,кенен ырыскы жана ар бир оорууга шыпаа сураймын.',
      ),
    ],
  ),
  SectionModel(
    title: 'Саъий бөлүмү',
    duas: [
      DuaModel(
        subtitle:
            'Сафа жана Марвага саъий кылуу үчүн Харам мечитинен чыгуу дуасы',
        arabicText:
            'بِسْمِ اللَّهِ وَالصَّلَاةُ وَالسَّلَامُ عَلَى رَسُولِ اللَّهِ، اللَّهُمَّ اغْفِرْ لِي ذُنُوبِي وَافْتَحْ لِي أَبْوَابَ فَضْلِكَ',
        transliteration:
            "Бисмиллахи вас-солаату вас-салааму аълаа росуулиллах. Аллохумма игфир лии зунуубии вафтах лии абвааба фадлика.",
        translation:
            'Алланын аты менен(мечиттен чыгамын).  Алланын элчисине салам салаваттар болсун.  Оо,Аллахым!  Күнөөлөрүмдү кечир жана мага Өзүңдүн рахмат,  фазл эшиктерин ачкын.',
      ),
      DuaModel(
        subtitle: 'Сафа тарапка чыгып баратканда окула турган дуа',
        arabicText:
            'بِسْمِ اللَّهِ أَبْدَأُ بِمَا بَدَأَ اللَّهُ بِهِ، إِنَّ الصًَّفَا وَالْمَرْوَةَ مِنْ شَعَائِرِ اللَّهِ',
        transliteration:
            "Бисмиллахи абдау бимаа бада’аллоху бихии иннас-софаа вал-марвата мин ша’аъаириллахи.",
        translation:
            'Аллах Таала:  "Сафа жана Марва Алланын шиъаарларынан" деп баштаган аятына ылайык Алланын аты менен (саъий кылууну баштаймын).',
      ),
      DuaModel(
        subtitle: 'Сафа тоосунда турган абалда окула турган дуа',
        arabicText:
            ' لا إِلَهَ إِلَّا اللَّهُ وَحْدَهُ لَا شَرِيكَ لَهُ، لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ يُحْيِي وَيُمِيتُ وَهُوَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ، لَا إِلَهَ إِلَّا اللَّهُ وَحْدَهُ، أَنْجَزَ وَعْدَهُ وَنَصَرَ عَبْدَهُ وَهَزَمَ الْأَحْزَابَ وَحْدَهُ.',
        transliteration:
            "Лаа илааха иллаллоху вахдаху лаа шариика лах, лахул мулку ва лахул хамду юхйи ва юмииту ва хува аълаа кулли шайин кодиир,  лаа илааха иллаллоху вахдаху анжаза ваъдаху ва насоро аъбдаху ва хазамал-ахзааба вахдаху.",
        translation:
            'Аллахтан башка илах жок.  Ал жалгыз шериги жок.  Бийлик жана мактоолор Ага гана таандык.  Ал жашоо берет,  өлтүрөт жана ал баардык нерсеге кадыр.  Аллахтан башка илах жок.  Ал жалгыз, Ал убадасын аткарды,  пендесине жардам берди жана Өзү жалгыз душмандарды чегинтти.',
      ),
      DuaModel(
        subtitle: 'Биринчи айлануу саъий дуасы',
        arabicText:
            'اَللهُ أَكْبَرُ، اَللهُ أَكْبَرُ، لَٓا إِلٰهَ إِلَّا اللهُ وَاللهُ أَكْبَرُ، اَللهُ أَكْبَرُ وَ لِلهِ الْحَمْدُ. اَللهُ أَكْبَرُ كَبِيرًا وَالْحَمْدُ لِلهِ كَثِيرًا وَسُبْحَانَ اللهِ بُكْرَةً وَ أَصِيلًا. لَٓا إِلٰهَ إِلَّا اللهُ وَحْدَهُ لَا شَرِيكَ لَهُ ، لَهُ الْمُلْكُ وَ لَهُ الْحَمْدُ يُحْيِي وَ يُمِيتُ ، بِيَدِهِ الْخَيْرُ وَهُوَ عَلٰى كُلِّ شَيْءٍ قَدِيرٌ. رَبَّنَا تَقَبَّلْ مِنَّا إِنَّكَ أَنْتَ السَّمِيعُ الْعَلِيمُ. رَبَّنَا وَاجْعَلْنَا مُسْلِمَيْنِ لَكَ وَ مِنْ ذُرِّيَّتِنَٓا أُمَّةً مُسْلِمَةً لَكَۖ وَ أَرِنَا مَنَاسِكَنَا وَ تُبْ عَلَيْنَاۚ إِنَّكَ أَنْتَ التَّوَّابُ الرَّحِيمُ . رَبِّ اغْفِرْ وَارْحَمْ ، وَاعْفُ وَ تَكَرَّمْ ، وَ تَجَاوَزْ عَمَّا تَعْلَمْ ، إِنَّكَ تَعْلَمُ مَا لَا نَعْلَمُ ، إِنَّكَ أَنْتَ اللهُ الْأَعَزُّ الْأَكْرَمُ . رَبَّنَٓا اٰتِنَا فِي الدُّنْيَا حَسَنَةً وَ فِي الْاٰخِرَةِ حَسَنَةً وَ قِنَا عَذَابَ النَّارِ . اَللّٰهُمَّ إِنِّي أَسْأَلُكَ مِنَ الْخَيْرِ كُلِّهِ عَاجِلِهِ وَ آجِلِهِ ، مَا عَلِمْتُ مِنْهُ وَ مَا لَمْ أَعْلَمْ ، وَ أَعُوذُ بِكَ مِنَ الشَّرِّ كُلِّهِ ، عَاجِلِهِ وَ آجِلِهِ مَا عَلِمْتُ مِنْهُ ، وَ مَا لَمْ أَعْلَمْ ، وَ أَسْأَلُكَ الْجَنَّةَ وَ مَا قَرَّبَ إِلَيْهَا مِنْ قَوْلٍ أَوْ عَمَلٍ ، وَ أَعُوذُ بِكَ مِنَ النَّارِ وَ مَا قَرَّبَ إِلَيْهَا مِنْ قَوْلٍ أَوْ عَمَلٍ. وَ أَسْأَلُكَ خَيْرَ مَا سَأَلَكَ عَبْدُكَ وَ رَسُولُكَ مُحَمَّدٌ ، وَ أَعُوذُ بِكَ مِنْ شَرِّ مَا اسْتَعَاذَ مِنْهُ عَبْدُكَ وَ رَسُولُكَ مُحَمَّدٌ صَلَّى اللهُ عَلَيْهِ وَ سَلَّمَ. اَللّٰهُمَّ اغْفِرْ لِي مَغْفِرَةً تُصْلِحُ بِهَا شَأْنِي فِي الدَّارَيْنِ ، وارْحَمْنِي رَحْمَةً أَسْعَدُ بِهَا فِي الدَّارَيْنِ ، وَ تُبْ عَلَيَّ تَوْبَةً نَصُوحًا لَا أَنْكُثُهَا أَبَدًا ، وَ أَلْزِمْنِي الْاِسْتِقَامَةَ لَا أَزِيغُ عَنْهَا أَبَدًا. لَٓا إِلٰهَ إِلَّا اللهُ وَحْدَهُ ، أَنْجَزَ وَعْدَهُ وَ نَصَرَ عَبْدَهُ وَ هَزَمَ الْأَحْزَابَ وَحْدَهُ. لَٓا إِلٰهَ إِلَّا اللهُ ، وَلَا نَعْبُدُ إِلَّا إِيَّاهُ مُخْلِصِينَ لَهُ الدِّينَ وَلَوْ كَرِهَ الْكَافِرُونَ. إِنَّ الصَّفَا وَ الْمَرْوَةَ مِنْ شَعَٓائِرِ اللهِ ۚ فَمَنْ حَجَّ الْبَيْتَ أَوِ اعْتَمَرَ فَلَا جُنَاحَ عَلَيْهِ أَنْ يَطَّوَّفَ بِهِمَاۜ وَ مَنْ تَطَوَّعَ خَيْرًاۙ فَإِنَّ اللهَ شَاكِرٌ عَلِيمٌ',
        transliteration:
            "Аллоху акбар,  Аллоху акбар,  лаа илааха иллаллаху валлоху акбар, Аллоху акбар ва лиллаахил хамд. Аллоху акбар кабиирон вальхамду лиллаахи касиирон васубханаллаахи букротан ва асыылан.  Лаа илааха иллаллаху вахдаху лаа шариика лаху, лахул-мульку ва лахул-хамду юухйи ва юмииту, биядихил-хайру ва хува аълаа кулли шайин кодиир.  Роббанаа такоббал миннаа иннака антас-Самиуъл-Аълиим. Роббанаа важ’аъльнаа муслимайни лака ва мин зуррийатинаа умматан муслиматан лака, ва аринаа манаасиканаа ва туб аълайнаа, иннака антат-Тавваабур-Рохиим.  Рабби-гфир вархам, ва’аъфу ва такарром, ва тажааваз аъммаа таълам, иннака таъламу маа лаа наълам, иннака анталлохул-А’аъззул -Акром.  Раббана аатинa фид-дунйаа хасанатан ва фил-аахыроти хасанатан ва кынаа аъзаабан-наар.  Аллаахумма иннии ас’алука минал-хойри куллихи аъажилихи ва аажилихи,  маа аълимту минху ва маа лам а’аълам,ва аъуузу бика минаш-шарри куллихи,  аъажилихи ва аажилихи маа аълимту минху,ва маа лам а’аълам,  ва ас’алукал-жанната ва маа корроба илайхаа мин ковлин ав аъмалин,  ва аъуузу бика минан-наари ва маа корроба илайхаа мин ковлин ав аъмалин.  Ва ас’алука хойро маа са’алака аъбдука ва расуулука Мухаммад,ва аъуузу бика мин шарри маа иста’аъаза минху аъбдука ва расуулука Мухаммад соллаллаху алайхи ва саллям.  Аллаахумма-гфирлии магфиротан туслиху бихаа ша’нии фид-даройни, вархамнии рохматан ас’аъду бихаа фид-даройни, ва туб аълайа тавбатан насуухан лаа анкусуха абадан, ва алзимнил-истикоомата лаа азиигу аънхаа абадан. Лаа илааха иллаллаху вахдаху,анжаза ваъдаху ва насоро аъбдаху ва хазамал-ахзааба вахдаху.  Лаа илааха иллаллаху,ва лаа наъбуду иллаа ийаху мухлисиина лахуд-диин ва лав карихал-каафируун.  Иннас-Софаа вал-Марвата мин ша’аъаириллаахи, фа ман хажжал-байта ав иътамаро фа лаа жунааха аълайхи ан яттоввафа бихимаа, ва ман таттовваъа хойрон фа инналлоха шаакирун Аълиим.",
        translation:
            'Аллах эң улуу.  Аллах эң улуу.  Аллахтан башка илах жок.  Аллах эң улуу жана бардык мактоолор Аллахка болсун.Аллах баарынан бийик. Чексиз мактоолор Ага гана таандык. Эртең менен кечинде мактоолор айтылган Аллах кемчиликтен таза.Аллахтан башка кудай жок. Ал Бирөө гана. Анын шериги жок. Падышалык Ага таандык. Мактоолор Ага гана таандык. Ал өмүр берет жана өмүрдү бүтүрөт. Жакшылык Анын гана колунда. Ал кудуреттүү.Оо Аллахым! Ибадаттарыбызды кабыл кыл, кантсе да Сен баарын угуп, билесиң. Оо Аллахым! Бизди Сага берилген үммөт кыл жана урпактарыбызды сага берилген үммөт кыл. Биздин ибадаттарыбызды жана тообобузду кабыл кыл. Анткени, Сен көп тооболорду кабыл кыласың. Оо Аллахым! Бизге бул дүйнөдө да, акыретте да жакшылык бер жана бизди тозок азабынан сакта.Оо Аллахым!  Мен сенден өткөн жана келечек тууралуу билген жана билбеген жакшылыктарымды сурайм. Өзүм билген жана билбеген, өткөн жана келечектеги бардык жамандыктардан Сенден коргоо сурайм. Мен сенден бейишти жана мени ал жакка алып бара турган нерсени сөз менен жана иш аткарууну насип кылууну  сурайм. Оо Аллахым! Мен сенин пайгамбарың жана элчиң Мухаммад сураган бардык жакшылыктарды сенден сурайм жана ал сенден коргоо сураган бардык жамандыктардан сактанамын.Оо Аллахым! Кечир мени эки дүйнөдөгү абалым жакшырт. Ырайым кыл, эки дүйнөдө бактылуу болууну насип кыл. Мага чын жүрөктөн тообо кылууну насип кыл жана такыба кыл, андан эч качан тайбаймын.Аллахтан башка илах жок. Ал Бирөө гана.  Ал убадасын аткарып,кулуна жардам берип, душмандарын жалгыз жеңген. Аллахтан башка илах жок. Каапырларга жакпаса да ибадатыбызды бир гана Аллахка багыштайбыз.Шексиз, Сафа жана Марва – Аллахтын белгилери.Демек, ким Каабага ажылык же умра кылуу ниети менен келип, аларды айланып өтсө, күнөө кылбайт. Ким өз каалоосу менен жакшылык кылса, Аллах аны билет жана анын соопторун берет.',
      ),
      DuaModel(
        subtitle: 'Эки жашыл сызыктын ортосунда окулуучу дуа',
        arabicText:
            'رَبِّ اغْفِرْ وَارْحَمْ وَتَجَاوَزْ عَمَّا تَعْلَمُ إِنَّكَ أَنْتَ الْأَعَزُّ الْأَكْرَمُ',
        transliteration:
            "Роббигфир вархам ва тажааваз аъммаа таълам иннака антал а’аъззул акром.",
        translation:
            'Оо Роббим!Мени кечир, мага ырайым кыл жана мени Сен билген күнөөлөрдөн тазала. Чындыгында,Сен баарынан Сыйлуу жана Берешенсин.',
      ),
      DuaModel(
        subtitle: 'Эки жашыл сызыктан өткөндөн кийин окула турган дуа',
        arabicText:
            'اللَّهُمَّ ثَبِّتْنِي بِسُنَّةِ نَبِيِّكَ مُحَمَّدٍ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَتَوَفَّنِي عَلَى مِلَّتِهِ وَأَعِذْنِي مِنْ مُزِلَّاتِ الْفِتَنِ بِرَحْمَتِكَ يَا أَرْحَمَ الرَّاحِمِينَ.',
        transliteration:
            "Аллохумма саббитни би суннати набийика мухаммадин соллаллоху алайхи ва саллам ва таваффании аълаа миллатихии ва аиъзнии мин музиллаатил фитани бирохматика яа архамар роохимиин. ",
        translation:
            ' Оо Аллахым! Мени Пайгамбарың Мухаммад(с.а.в) сүннөтүнө амал кылуучулардан кылгын. Мага анын дининде гана өлүм бергин. Адаштыруучу баардык фитналардан Өзүңдүн ырахматың мени сактагын.Оо Мээримдүүлөрдүн Мээримдүүсү!',
      ),
      DuaModel(
        subtitle: 'Экинчи айлануу саьий дуасы',
        arabicText:
            'اَللهُ أَكْبَرُ ، اَللهُ أَكْبَرُ ، لَٓا إِلٰهَ إِلَّا اللهُ وَاللهُ أَكْبَرُ ، اَللهُ أَكْبَرُ وَ لِلهِ الْحَمْدُ . لَٓا إِلٰهَ إِلَّا اللهُ الْوَاحِدُ الْأَحَدُ الْفَرْدُ الصَّمَدُ الَّذِي لَمْ يَلِدْ وَلَمْ يُولَدْۙ وَلَمْ يَكُنْ لَهُ كُفُوًا أَحَدٌ . رَبَّنَٓا اٰمَنَّا بِمَٓا اَنْزَلْتَ وَاتَّبَعْنَا الرَّسُولَ فَاكْتُبْنَا مَعَ الشَّاهِدِينَ . رَبَّنَٓا إِنَّنَا سَمِعْنَا مُنَادِيًا يُنَادِي لِلْإِيمَانِ أَنْ اٰمِنُوا بِرَبِّكُمْ فَاٰمَنَّاۗ رَبَّنَا فَاغْفِرْ لَنَا ذُنُوبَنَا وَ كَفِّرْ عَنَّا سَيِّـَٔاتِنَا وَ تَوَفَّنَا مَعَ الْأَبْرَارِۚ . رَبَّنَا وَ اٰتِنَا مَا وَعَدْتَنَا عَلٰى رُسُلِكَ وَلَا تُخْزِنَا يَوْمَ الْقِيٰمَةِۜ إِنَّكَ لَا تُخْلِفُ الْمِيعَادَ. اَللّٰهُمَّ اغْفِرْ لِي مَا قَدَّمْتُ وَ مَا أَخَّرْتُ ، وَ مَا أَسْرَرْتُ وَ مَا أَعْلَنْتُ ، وَ مَا أَنْتَ أَعْلَمُ بِهِ مِنِّي ، أَنْتَ الْمُقَدِّمُ وَ أَنْتَ الْمُؤَخِّرُ وَ أَنْتَ عَلٰى كُلِّ شَيْءٍ قَدِيرٌ لَٓا إِلٰهَ إِلَّا أَنْتَ . اَللّٰهُمَّ عَافِنِي فِي بَدَنِي، اَللّٰهُمَّ عَافِنِي فِي سَمْعِي ، اَللّٰهُمَّ عَافِنِي فِي بَصَرِي ، لَٓا إِلٰهَ إِلَّا أَنْتَ . اَللّٰهُمَّ اسْتُرْ عَوْرَاتِي ، وَ اٰمِنْ رَوْعَاتِي ، وَاحْفَظْنِي مِنْ بَيْنِ يَدَيَّ وَ مِنْ خَلْفِي ، وَ عَنْ يَمِينِي وَ عَنْ شِمَالِي ، وَ مِنْ فَوْقِي ، وَ أَعُوذُ بِكَ اَللّٰهُمَّ مِنْ أَنْ أُغْتَالَ مِنْ تَحْتِي . اَللّٰهُمَّ اجْعَلْنِي مِنَ الَّذِينَ إِذَا أَحْسَنُوا اِسْتَبْشَرُوا وَإِذَا أَسَآؤوا اِسْتَغْفَرُوا . رَبِّ اغْفِرْ وَارْحَمْ وَاعْفُ وَ تَكَرَّمْ ، وَ تَجَاوَزْ عَمَّا تَعْلَمُ ، إِنَّكَ تَعْلَمُ مَا لَا نَعْلَمُ ، إِنَّكَ أَنْتَ الْأَعَزُّ الْأَكْرَمُ. رَبَّنَٓا اٰتِنَا فِي الدُّنْيَا حَسَنَةً وَ فِي الْاٰخِرَةِ حَسَنَةً وَ قِنَا عَذَابَ النَّارِ . لَٓا إِلٰهَ إِلَّا اللهُ وَحْدَهُ لَا شَرِيكَ لَهُ ، لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ يُحْيِي وَ يُمِيتُ بِيَدِهِ الْخَيْرُ وَهُوَ عَلٰى كُلِّ شَيْءٍ قَدِيرٌ . لَٓا إِلٰهَ إِلَّا اللهُ وَحْدَهُ ، أَنْجَزَ وَعْدَهُ وَ نَصَرَ عَبْدَهُ وَ هَزَمَ الْأَحْزَابَ وَحْدَهُ . إِنَّ الصَّفَا وَالْمَرْوَةَ مِنْ شَعَٓائِرِاللهِ ۚ فَمَنْ حَجَّ الْبَيْتَ أَوِ اعْتَمَرَ فَلَا جُنَاحَ عَلَيْهِ أَنْ يَطَّوَّفَ بِهِمَاۜ وَ مَنْ تَطَوَّعَ خَيْرًاۙ فَإِنَّ اللهَ شَاكِرٌ عَلِيمٌ',
        transliteration:
            "Аллоху акбар, Аллоху акбар, лаа илааха иллаллаху валлоху акбар, Аллоху акбар ва лиллаахил-хамд. Лаа илааха иллаллахул-Ваахидул-Ахадул-Фардус-Сомаду алази лам ялид ва лам юулад, ва лам якун лаху куфуван ахад. Раббанаа ааманнаа бимаа анзалта ваттаба’аънар-Расуула фактубнаа маъаш-Шаахидиин. Раббанаа иннанаа самиънаа мунаадийан юнаадии лил-иимаан ан ааминуу би Раббикум фа ааманнаа. Раббанаа фагфир ланаа зунуубанаа ва каффир аъннаа сайиаатинаа ва таваффанаа ма’аъл-аброор. Раббанаа ва аатинаа ма ваъадтанаа аълаа русулика ва лаа тухзинаа яумал-кыйаамах, иннака лаа тухлифул-мииъаад. Аллаахумма-гфир лии маа коддамту ва маа аххорту, ва маа асрорту ва маа а’аъланту, ва маа анта а’аъламу бихи миннии, антал-мукоддиму ва антал-муаххыру ва анта аълаа кулли шайин кодиир, лаа илааха иллаа анта. Аллаахумма аъафинии фии бадании, Аллаахумма аъафинии фии сам’иъи, Аллаахумма аъафинии фии басории, лаа илааха иллаа анта. Аллаахумма-стур аъвроотии, ва аамин раваъатии, вахфазнии мин байни ядайа ва мин холфии, ва аън ямиинии ва аън шимаалии, ва мин фавкыы, ва аъуузу бика Аллаахумма мин ан угтаала мин тахтии. Аллаахумма-ж’аъльнии миналлазиина изаа ахсануу истабшаруу ва изаа асаа’уу истагфаруу. Робби-гфир вархам, ваъфу ва такарром,  ва тажааваз аъммаа таълам,иннака таъламу маа лаа наълам, иннака анталлахуль-Ааъззул-Акром. Раббанаа аатинa фид-дунйаа хасанатан ва фил-аахыроти хасанатан ва кынаа аъзаабан-наар. Лаа илааха иллаллаху вахдаху лаа шариика лаху, лахул-мульку ва лахул-хамду юхйи ва юмиту, бийадихил-хойру ва хува аълаа кулли шайин кодиир. Лаа илааха иллаллаху вахдаху,анжаза ваъдаху ва насора аъбдаху ва хазамал-ахзааба вахдаху. Иннас-Софаа вал-Марвата мин ша’аъаириллаахи, фа ман хажжал-байта ав иътамаро фа лаа жунааха аълайхи ан яттоввафа бихимаа, ва ман таттовваъа хойрон фа инналлоха шаакирун Аълиим.",
        translation:
            'Аллах эң улуу. Аллах эң улуу. Аллахтан башка кудай жок. Аллах эң улуу жана бардык мактоолор Аллахка болсун.Аллахтан башка кудай жок.  Ал жалгыз, Аллах Самад(Ага баары муктаж, Ага эч нерсе жетпейт).  Ал туулбаган туубаган. Эч бир нерсе Ага окшош эмес жана  Ал кимге окшош эмес. Оо Аллахым!  Биз Сен түшүргөн нерсеге ыйман келтирдик жана Пайгамбарды ээрчидик.  Демек, бизди чындыкка күбөлөндүргөндөр менен кошо жаз.  Оо Аллахым!  Момундун: «Раббиңе ыйман келтир!»  деген чакырыгын уктук жана ыйман келтирдик.Оо Аллахым!  Күнөөлөрүбүздү кечир, күнөөлөрүбүздү жашыр, жаныбызды салихтер менен бирге ал. Оо Аллахым! Бизге пайгамбарларың аркылуу убада кылганыңды бер жана Кыямат күнү бизди кор кылба. Анткени, сен убадаларды бузбайсың. Оо Аллахым!  Менин мурунку кылган күнөөлөрүмдү кечир, келечекте жасай турган күнөөлөрүмдү өзүң менден жакшыраак билесиң ошолордон сактай көр. Сен өз каалооңо жараша окуяларды тездетип же кечеңдете аласың.  Сен кудуреттүүсүң жана Сенден башка кудай жок. Оо Аллахым!  Ден-соолук бер. Оо Аллахым кулагыма, көзүмө ден соолук жана аманчылык бер. Оо Аллахым!  Жамандыктарымды жашыр, мени корккон нерседен сакта. Мени алдыдан, арттан, оңдон, солдон жана жогорудан келе турган баардык мүмкүн болгон коркунучтардан, кырсыктардан сакта.',
      ),
      DuaModel(
        subtitle: 'Үчүнчү айлануунун саьий дуасы',
        arabicText:
            'اَللهُ أَكْبَرُ ، اَللهُ أَكْبَرُ ، لَٓا إِلٰهَ إِلَّا اللهُ وَاللهُ أَكْبَرُ ، اَللهُ أَكْبَرُ وَ لِلهِ الْحَمْدُ . لَٓا إِلٰهَ اِلَّا اللهُ الْوَاحِدُ الْأَحَدُ الْفَرْدُ الصَّمَدُ الَّذِي لَمْ يَتَّخِذْ صَاحِبَةً وَلَا وَلَدًا وَ لَمْ يَكُنْ لَهُ شَرِيكٌ فِي الْمُلْكِ وَ لَمْ يَكُنْ لَهُ وَلِيٌّ مِنَ الذُّلِّ وَ كَبِّرْهُ تَكْبِيرًا . رَبَّنَا هَبْ لَنَا مِنْ أَزْوَاجِنَا وَ ذُرِّيَّاتِنَا قُرَّةَ أَعْيُنٍ وَاجْعَلْنَا لِلْمُتَّقِينَ إِمَامًا . رَبِّ اغْفِرْ وَارْحَمْ وَاعْفُ وَ تَكَرَّمْ ، وَ تَجَاوَزْ عَمَّا تَعْلَمُ ، إِنَّكَ تَعْلَمُ مَا لَا نَعْلَمُ ، إِنَّكَ أَنْتَ اللهُ الْأَعَزُّ الْأَكْرَمُ . رَبَّنَٓا اٰتِنَا فِي الدُّنْيَا حَسَنَةً وَ فِي الْاٰخِرَةِ حَسَنَةً وَ قِنَا عَذَابَ النَّارِ . رَبِّ هَبْ لِي مِنْ لَدُنْكَ ذُرِّيَّةً طَيِّبَةًۚ إِنَّكَ سَمِيعُ الدُّعَٓاءِ . رَبِّ اجْعَلْنِي مُقِيمَ الصَّلَاةِ وَ مِنْ ذُرِّيَّتِي رَبَّنَا وَ تَقَبَّلْ دُعَآءِ. فَاطِرَ السَّمٰوَاتِ وَالْأَرْضِ أَنْتَ وَلِيِّي فِي الدُّنْيَا وَالاٰخِرَةِ ۖ تَوَفَّنِي مُسْلِمًا وَ أَلْحِقْنِي بِالصَّالِحِينَ. رَبَّنَا اغْفِرْ لِي وَ لِوَالِدَيَّ وَ لِلْمُؤْمِنِينَ يَوْمَ يَقُومُ الْحِسَابُ. رَبِّ ارْحَمْهُمَا كَمَا رَبَّيَانِي صَغِيرًا . اَللّٰهُمَّ أَسْأَلُكَ حُبَّكَ ، وَ حُبَّ مَنْ يُحِبُّكَ ، وَ حُبَّ عَمَلٍ يُقَرِّبُنِي إِلٰى حُبِّكَ . اَللّٰهُمَّ حَبِّبْ إِلَيْنَا الْإِيمَانَ وَ زَيِّنْهُ فِي قُلُوبِنَا ، وَ كَرِّهْ إِلَيْنَا الْكُفْرَ وَالْفُسُوقَ وَالْعِصْيَانَ ، وَاجْعَلْنَا مِنَ الرَّاشِدِينَ . اَللّٰهُمَّ أَنْتَ رَبِّي لَٓا إِلٰهَ إِلَّا أَنْتَ خَلَقْتَنِي وَ أَنَا عَبْدُكَ وَ أَنَا عَلٰى عَهْدِكَ وَ وَعْدِكَ مَا اسْتَطَعْتُ ، أَعُوذُ بِكَ مِنْ شَرِّ مَا صَنَعْتُ، أَبُوءُ لَكَ بِنِعْمَتِكَ عَلَيَّ ، وَ أَبُوء لَكَ بِذَنْبِي، فَاغْفِرْ لِي فَإِنَّهُ لَا يَغْفِرُ الذُّنُوبَ إِلَّا أَنْتَ. إِنَّ الصَّفَا وَالْمَرْوَةَ مِنْ شَعَٓائِرِ اللهِ ۚ فَمَنْ حَجَّ الْبَيْتَ أَوِ اعْتَمَرَ فَلَا جُنَاحَ عَلَيْهِ أَنْ يَطَّوَّفَ بِهِمَاۜ وَ مَنْ تَطَوَّعَ خَيْرًاۙ فَإِنَّ اللهَ شَاكِرٌ عَلِيمٌ',
        transliteration:
            "Аллоху акбар, Аллоху акбар, лаа илааха иллаллаху валлоху акбар, Аллоху акбар ва лиллаахил-хамд.  Лаа илааха иллаллахул-Ваахидул-Ахадул-Фардус-Сомад аллазии лам яттахыз соохибатан ва лаа валадан ва лам якун лаху шариикун фил-мулки ва лам якун лаху валийун миназ-зулли ва каббирху такбироо.  Раббана хаб ланаа мин азваажинаа ва зуррийаатинаа куррота аъйунин важ’аълнаа лил-муттакина имаамаа.  Рабби-гфир вархам, ваъфу ва такарром, ва тажааваз аъммаа таълам, иннака таъламу маа лаа наълам,  иннака анталлахуль-А’аъззул-Акром. Раббанаа аатинa фид-дунйаа хасанатан ва фил-аахыроти хасанатан ва кынаа аъзаабан-наар. Рабби хаб лии мин ладунка зуррийатан тойибатан,иннака самиъуд-дуаъа.  Рабби-жаълнии мукиимас-солаати ва мин зуррийатии, Раббанаа ва такоббал дуаъа.  Фаатырос-самаваати вал-арди анта валийии фид-дунйаа вал-аахыроти, таваффании муслиман ва алхикнии бис-соолихиин. Раббана-гфир лии ва ливаалидайа ва лил-муминиина явма якуумул-хисааб. Рабби-рхамхумаа камаа раббайаании согиироо. Аллаахумма ас’алука хуббака, ва хубба ман юхиббука, ва хубба аъмалин юкоррибунии илаа хуббика. Аллаахумма хаббиб илайнаал-иимаана ва зайинху фии кулуубинаа, ва каррих илайнаал-куфро вал-фусууко вал-иъс’яана, важ’аъльнаа минар-роошидиин. Аллаахумма анта роббии лаа илааха иллаа анта холактании ва анаа аъбдука ва анаа аълаа аъхдика ва ваъдика мастатаъту, аъуузу бика мин шарри маа санаъту, абуу’у лака биниъматика аълайа, ва абуу’у лака бизанбии, фагфир лии фаиннаху лаа ягфируз-зунууба иллаа анта. Иннас-Софаа вал-Марвата мин ша’аъаириллаахи, фа ман хажжал-байта ав иътамаро фа лаа жунааха аълайхи ан яттоввафа бихимаа, ва ман таттовваъа хойрон фа инналлоха шаакирун Аълиим.",
        translation:
            'Аллах эң улуу. Аллах эң улуу. Аллахтан башка кудай жок. Аллах эң улуу жана бардык мактоолор Аллахка болсун.Аллахтан башка кудай жок. Ал жалгыз, Аллах Самад(Ага баары муктаж, Ага эч нерсе жетпейт). Ал туулбаган жана туубаган. Эч бир нерсе Ага окшош эмес жана Ал  эч кимге окшош эмес. Оо Аллахым! Жубайларыбыз, балдарыбыз менен көзүбүзгө кубаныч тартуула жана бизди Аллахтан корккон пенделерден кыл.Оо Аллахым! Бизди кечир, бизге ырайым кыл. Биздин кемчиликтерибизди билесиң, билбегендерибизди кечир. Анткени, Сенде чыныгы күч жана ырайым бар. Оо Аллахым! Бизге бул дүйнөдө жакшылык, акыретте жакшылык бер. Бизди тозок азабынан сакта. Оо Аллахым! Мага таза урпак бер. Сен  дубаны жакшы кабылдайсың. Оо Аллахым! Мени жана менин урпактарымды тынымсыз дуба кылуучу кыл. Оо,Аллахым! Намазымды кабыл кыл. Эй, асман менен жердин Жаратуучусу! Бул дүйнөдө да, акыретте да Сен менин колдоочумсуң. Менин жанымды мусулман абалында ал жана мени салихтерге кош. Оо Аллахым! Кыямат күнү мени, ата-энемди жана бардык момундарды кечир. Аллахым! Ата-энем мени кичинемден багып өстүргөн сыяктуу, аларга да ошондой мээримдүүлүк көрсөт. Оо Аллахым! Мага Өзүңө, Сени сүйгөндөргө жана мени Сага жакындаткан бардык нерсеге сөз менен иш менен сүйүү бер. Оо  Аллахым! Ыйманыбыз менен сүйүктүү кыл, жүрөгүбүздү кооз кыл. Бизге ыймансыздыкты, бузукулукту жана баш ийбестикти жийиркеничтүү кыл. Бизди туура жолдо болгондордон кыл. Оо Аллахым! Пенделериңди тирилте турган күнү бизди азабыңдан сакта. Оо Аллахым! Сен менин Раббимсиң. Сенден башка кудай жок. Сен мени жараттың жана мен Сенин кулуңмун. Мен колумдан келишинче Сага берген антыма жана убадама бекем турам жана амалдарымдын жамандыгынан Сага паана тилейм. Мен Сенин мага берген жакшылыктарыңды билемин жана күнөөлөрүмдү моюнга алам. Мени кечир, анткени Сенден башка күнөөлөрдү кечире турган эч ким жок.',
      ),
      DuaModel(
        subtitle: 'Төртүнчү айлануунун саьий дуасы',
        arabicText:
            'اَللهُ أَكْبَرُ، اَللهُ أَكْبَرُ، لَٓا إِلٰهَ إِلَّا اللهُ وَاللهُ أَكْبَرُ، اَللهُ أَكْبَرُ وَ لِلهِ الْحَمْدُ . لَٓا إِلٰهَ اِلَّا اللهُ الْمَلِكُ الْحَقُّ الْمُبِينُ مُحَمَّدٌ رَسُولُ اللهِ صَادِقُ الْوَعْدِ اْلأَمِينُ . اَللّٰهُمَّ أَحْيِنِي عَلٰى سُنَّةِ نَبِيِّكَ وَ تَوَفَّنِي عَلٰى مِلَّتِهِ وَ أَعِذْنِي مِنْ مُضِلَّاتِ الْفِتَنِ . سُبْحَانَكَ مَا عَبَدْنَاكَ حَقَّ عِبَادَتِكَ يَا اَللهُ . سُبْحَانَكَ مَا ذَكَرْنَاكَ حَقَّ ذِكْرِكَ يَا اَللهُ . سُبْحَانَكَ مَا شَكَرْنَاكَ حَقَّ شُكْرِكَ يَا اَللهُ . سُبْحَانَكَ مَا أَعْلَى شَأْنَكَ يَا اَللهُ . سُبْحَانَ اللهِ عَدَدَ خَلْقِهِ . سُبْحَانَ اللهِ رِضَا نَفْسِهِ . سُبْحَانَ اللهِ زِنَةَ عَرْشِهِ . سُبْحَانَ اللهِ مِدَادَ كَلِمَاتِهِ . اَللّٰهُمَّ إِنِّي أَسْأَلُكَ كَمَا هَدَيْتَنِي لِلْإِسْلَامِ أَنْ لَا تَنْزِعَهُ مِنِّي حَتَّى تَتَوَفَّانِي عَلَيْهِ وَ أَنَا مُسْلِمٌ . اَللّٰهُمَّ اجْعَلْ فِي قَلْبِي نُورًا ، وَ فِي لِسَانِي نُورًا ، وَ فِي بَصَرِي نُورًا ، وَ فِي سَمْعِي نُورًا وَ عَنْ يَمِينِي نُورًا ، وَ عَنْ يَسَارِي نُورًا ، وَ مِنْ فَوْقِي نُورًا ، وَ مِنْ تَحْتِي نُورًا ، وَ مِنْ أَمَامِي نُورًا ، وَ مِنْ خَلْفِي نُورًا ، وَاجْعَلْ لِي فِي نَفْسِي نُورًا . اَللّٰهُمَّ انْفَعْنِى بِمَا عَلَّمْتَنِي وَ عَلِّمْنِي ماَ يَنْفَعُنِي وَارْزُقْنِي عِلْمًا تَنْفَعُنِي بِهِ . اَللّٰهُمَّ اغْفِرْ لِي ذَنْبِي وَ وَسِّعْ لِي فِي رِزْقِي وَ بَارِكْ لِي فِيمَا رَزَقْتَنِي . اَللّٰهُمَّ أَحْسِنْ عَاقِبَتَنَا فِي الْأُمُورِ كُلِّهَا وَ أَجِرْنَا مِنْ خِزْيِ الدُّنْيَا وَ عَذَابِ الاٰخِرَةِ . اَللّٰهُمَّ طَهِّرْ قَلْبِي مِنَ النِّفَاقِ ، وَ عَمَلِي مِنَ الرِّيَاءِ ، وَ لِسَانِي مِنَ الْكَذِبِ ، وَ عَيْنِي مِنَ الْخِيَانَةِ ، فَإِنَّكَ تَعْلَمُ خَائِنَةَ الأَعْيُنِ وَ مَا تُخْفِي الصُّدُورُ . اَللّٰهُمَّ ارْحَمْنِي بِتَرْكِ الْمَعَاصِي أَبَدًا مَا أَبْقَيْتَنِي وَارْحَمْنِي أَنْ أَتَكَلَّفَ مَا لَا يَعْنِينِي وَارْزُقْنِي حُسْنَ النَّظَرِ فِيمَا يُرْضِيكَ عَنِّي . رَبِّ اغْفِرْ وَارْحَمْ وَاعْفُ وَ تَكَرَّمْ ، وَ تَجَاوَزْ عَمَّا تَعْلَمُ ، إِنَّكَ تَعْلَمُ مَا لَا نَعْلَمُ ، إِنَّكَ أَنْتَ الْأَعَزُّ الْأَكْرَمُ . رَبَّنَٓا اٰتِنَا فِي الدُّنْيَا حَسَنَةً وَ فِي الْاٰخِرَةِ حَسَنَةً وَ قِنَا عَذَابَ النَّارِ . إِنَّ الصَّفَا وَالْمَرْوَةَ مِنْ شَعَٓائِرِ اللهِ ۚ فَمَنْ حَجَّ الْبَيْتَ أَوِ اعْتَمَرَ فَلَا جُنَاحَ عَلَيْهِ أَنْ يَطَّوَّفَ بِهِمَاۜ وَ مَنْ تَطَوَّعَ خَيْرًاۙ فَإِنَّ اللهَ شَاكِرٌ عَلِيمٌ',
        transliteration:
            "Аллоху акбар, Аллоху акбар, лаа илааха иллАллааху валлоху акбар, Аллоху акбар ва лиллаахиль-хамд.  Лаа илааха илл Аллаахуль-маликуль-хаккуль-мубийну Мухаммадун расуулуллаахи соодикуль-ваъдиль-амийн.  Аллаахумма ахйиний ъалаа суннати набиййика ва таваффании ъалаа миллятихи ва аъизъний мин мудилляти ль-фитан. Субхааналлаахи маа ъабаднаака хаккл ъибадатика йаа Аллах. Субхааналлаахи маа закарнаака хакко зикрика йаа Аллах. Субхааналлаахи маа шакарнаака хакко шукрика йаа Аллах. Субхааналлаахи маа аълаа ша нака йаа Аллах.  Субхааналлаахи ъадада холкыхи. Субхааналлаахи ридаа нафсихи. Субхааналлаахи зината ъаршихи. Субхааналлаахи мидаада калимаатихи. Аллаахумма иннии ас алука камаа хадайтани лиль-Ислям ан лаа танзиъаху миннии хаттаа татаваффааний ъалайхи ва анаа муслимуун. Аллаахумма ажъаль фии колбии нуурон, ва фии лисании нуурон, ва фии басории нуурон, ва фии самъии нуурон ва ъан йамиинии нуурон, ва ъан йасаарии нуурон, ва мин фавкии нуурон, ва мин тахтии нуурон, ва мин амаамии нуурон, ва мин холфии нуурон, ва ажъаль лии фии нафсии нуурон. Аллаахумма-нфаънии бимаа ъаллямтании ва ъаллимнии маа йанфаъунии варзукнии ъильман танфаъунии бихи.  Аллаахумма-гфир лии занбии ва вассиъ лии фии ризкый ва баарик лии фиимаа розактании.  Аллаахумма ахсин ъакыбатанаа филь-умуури куллихаа ва ажирнаа мин хызйид-дунйаа ва ъазаабиль-аахироти. Аллаахумма тоххир колбии минан-нифааки, ва ъамалии минар-рийааи, ва лисании мин аль-казиби, ва ъайнии миналь-хыйаанати, фа иннака таъляму хааинаталь-аъйуни ва маа тухфис-судуур.  Аллаахумма-рхамнии битаркиль-маъаасии абадан маа абкойтании ва архамнии ан атакаллафа маа лаа йаъниинии варзукнии хуснан-назори фиимаа йурдиика ъаннии.  Робби-гфир вархам, ваъфу ва такарром, ва тажааваз аъммаа таълам, иннака таъламу маа лаа наълам, иннака анталлахуль-Ааъззул-Акром. Раббанаа аатинa фид-дунйаа хасанатан ва фил-аахыроти хасанатан ва кынаа аъзаабан-наар. Иннас-Софаа вал-Марвата мин ша’аъаириллаахи, фа ман хажжал-байта ав иътамаро фа лаа жунааха аълайхи ан яттоввафа бихимаа, ва ман таттовваъа хойрон фа инналлоха шаакирун Аълиим. ",
        translation:
            'Аллах эң улуу. Аллах эң улуу. Аллахтан башка кудай жок. Аллах эң улуу жана бардык мактоолор Аллахка болсун.Аллахтан башка кудай жок. Ал жалгыз, Аллах Самад(Ага баары муктаж, Ага эч нерсе жетпейт). Ал туулбаган жана туубаган. Эч бир нерсе Ага окшош эмес жана Ал кимге окшош эмес. Оо Аллахым! Пайгамбарыңдын сүннөтүнө ылайык жашоону жана анын динине амал кылуу менен Сенин Нур Жамалыңды көрүнүү насип эт.  Мени азгырыктардан жана адашуулардан сакта.  Оо Аллахым! Сен баарынан жогорусуң.  Биз Сага улуулугуң менен ибадат кыла албадык. Оо Аллахым! Сен баарынан жогорусуң. Биз Сени улуулугуңа жараша мактай албадык.Оо Аллахым! Сен баарынан жогорусуң.Сенин улуулугуңа жараша рахмат айта албадык.Алла Таала жараткандарынын санына жараша, Аллахка шүгүр, Анын ырайымы менен, Аршынын оордугуна жараша, Аллага шүгүр, Аллах Таала сөзүнүн санына жараша, Аллахка шүгүр. Оо Аллахым! Мага туура хидаят бергениң үчүн, өмүрүмдүн аягына чейин мени ушул улуу ырайымдан куру калтырба. Оо Аллахым! Жүрөгүмө нур бере көр. Тилиме шүгүр, көзүмө нур, кулагыма нур бер. Оң жагыма, сол жагыма, үстүмө, астыма, алдыма, артыма жарык бер. Жан дүйнөмө жарык бер. Оо Аллахым! Мага үйрөткөн нерсеңди мага пайдалуу кыл жана мага пайдалуу нерселердин илимин бер.Оо Аллахым! Күнөөлөрүмдү кечир, ырыскымды көбөйт жана мага берген ырыскыңды мага жагымдуу кыл. Оо Аллахым! Бардык амалдарымдын аягын жакшылык кыл. Бизди бул дүйнөнүн балээлеринен жана акыреттин азабынан сакта.Оо Аллахым! Менин жүрөгүмдү эки жүздүүлүктөн, амалдарымды  эл көрсүндүктөн , тилимди жалгандан, көзүмдү кыянаттан тазала. Анткени,Сен көздүн кыянаттыгын жана жүрөктөрдө эмнени жашыруун экенин  билесиң.Оо Аллахым! Тирүү кезимде күнөөлөрдөн сактанууга жардам бер. Мага тиешеси жок нерсеге чөмүлүүдөн жана бул жүктүн оордугунан мени куткар. Мага Сенин ырайымыңды алып келе турган сулуулукту көрүүнү насип кыл. Оо Аллахым! Бизди кечир, бизге ырайым кыл. Биздин кемчиликтерибизди билесиң, билбегендерибизди кечир. Анткени, сенде күч, мээрим бар. Оо Аллахым! Бизге бул дүйнөдө жакшылык, акыретте жакшылык бер. Бизди тозок азабынан сакта. ',
      ),
      DuaModel(
        subtitle: 'Бешинчи айлануунун саьий дуасы',
        arabicText:
            'اَللهُ أَكْبَرُ، اَللهُ أَكْبَرُ ، لَٓا إِلٰهَ إِلَّا اللهُ وَاللهُ أَكْبَرُ ، اَللهُ أَكْبَرُ وَ لِلهِ الْحَمْدُ . لَٓا إِلٰهَ إِلَّا اللهُ الْعَلِيُّ الْعَظِيمُ ، لَٓا إِلٰهَ إِلَّا اللهُ الْحَكِيمُ الْكَرِيمُ ، لَٓا إِلٰهَ إِلَّا اللهُ الْبَدِيعُ الْعَلِيمُ ، سُبْحَانَ اللهِ رَبِّ السَّمٰوَاتِ السَّبْعِ وَ رَبِّ الْعَرْشِ الْعَظِيمِ . رَبِّ اغْفِرْ وَارْحَمْ وَاعْفُ وَ تَكَرَّمْ ، وَ تَجَاوَزْ عَمَّا تَعْلَمُ ، إِنَّكَ تَعْلَمُ مَا لَا نَعْلَمُ ، إِنَّكَ أَنْتَ الْأَعَزُّ الْأَكْرَمُ . رَبَّنَٓا اٰتِنَا فِي الدُّنْيَا حَسَنَةً وَ فِي الْاٰخِرَةِ حَسَنَةً وَ قِنَا عَذَابَ النَّارِ . رَبَّنَا اصْرِفْ عَنَّا عَذَابَ جَهَنَّمَۗ إِنَّ عَذَابَهَا كَانَ غَرَامًاۗ. أَنْتَ وَلِيُّنَا فَاغْفِرْ لَنَا وَارْحَمْنَا وَ أَنْتَ خَيْرُ الْغَافِرِينَ . وَاكْتُبْ لَنَا فِي هٰذِهِ الدُّنْيَا حَسَنَةً وَ فِي الْاٰخِرَةِ إِنَّا هُدْنَٓا إِلَيْكَۜ . لَٓا إِلٰهَ إِلَّٓا أَنْتَ سُبْحَانَكَۗ إِنِّي كُنْتُ مِنَ الظَّالِمِينَ . رَبِّ اغْفِرْ وَارْحَمْ وَ أَنتَ خَيْرُ الرَّاحِمِينَ . رَبِّ زِدْنِي عِلْمًا وَ أَلْحِقْنِي بِالصَّالِحِينَۙ . رَبَّنَٓا اٰمَنَّا فَاغْفِرْ لَنَا وَارْحَمْنَا وَ أَنْتَ خَيْرُ الرَّاحِمِينَۚ . رَبِّ هَبْ لِي حُكْمًا وَ أَلْحِقْنِي بِالصَّالِحِينۙ ، وَاجْعَلْ لِي لِسَانَ صِدْقٍ فِي الْاٰخِرِينَۙ، وَاجْعَلْنِي مِنْ وَرَثَةِ جَنَّةِ النَّعِيمِۙ ، وَلَا تُخْزِنِي يَوْمَ يُبْعَثُونَۙ ، يَوْمَ لَا يَنْفَعُ مَالٌ وَلَا بَنُونَۙ إِلَّا مَنْ أَتَى اللهَ بِقَلْبٍ سَلِيمٍۜ . رَبَّنَا ظَلَمْنَٓا أَنْفُسَنَا وَإِنْ لَمْ تَغْفِرْ لَنَا وَ تَرْحَمْنَا لَنَكُونَنَّ مِنَ الْخَاسِرِين . رَبَّنَا لَا تُزِغْ قُلُوبَنَا بَعْدَ إِذْ هَدَيْتَنَا وَ هَبْ لَنَا مِنْ لَدُنْكَ رَحْمَةًۚ إِنَّكَ أَنْتَ الْوَهَّابُ. رَبَّنَا اغْفِرْ لَنَا ذُنُوبَنَا وَ إِسْرَافَنَا فِٓي أَمْرِنَا وَ ثَبِّتْ أَقْدَامَنَا وَانْصُرْنَا عَلَى الْقَوْمِ الْكَافِرِينَ . اَللّٰهُمَّ اغْفِرْ لِي جَمِيعَ مَا أَسْلَفْتُهُ ، وَاعْصِمْنِي فِيمَا بَقِيَ ، وَارْزُقْنِي عَمَلًا صَالِحًا تَرْضَى بِهِ عَنِّي يَا ذَا الْفَضْلِ الْعَظِيمِ . إِنَّ الصَّفَا وَالْمَرْوَةَ مِنْ شَعَٓائِرِ اللهِ ۚ فَمَنْ حَجَّ الْبَيْتَ أَوِ اعْتَمَرَ فَلَا جُنَاحَ عَلَيْهِ أَنْ يَطَّوَّفَ بِهِمَاۜ وَ مَنْ تَطَوَّعَ خَيْرًاۙ فَإِنَّ اللهَ شَاكِرٌ عَلِيمٌ',
        transliteration:
            "Аллоху акбар, Аллоху акбар, лаа илааха иллаллаху валлоху акбар, Аллоху акбар ва лиллаахил-хамд. Лаа илааха иллаллахул-аълийуль-аъзиим,  лаа илааха иллаллахул-хакиимул-кариим, лаа илааха иллаллахул-бадиъуль-аълиим, субхааналлаахи роббис-самааватис-саб’иъ ва роббиль-аършиль-аъзиим. Роббигфир вархам ваъфу ва такарром, ва тажааваз аъммаа таълам, иннака таъламу маа лаа наълам, иннака антал-аъаззуль-акром. Раббанаа аатинa фид-дунйаа хасанатан ва филь-аахыроти хасанатан ва кынаа аъзаабан-наар. Роббанаа-сриф аъннаа аъзааба жаханнама, инна аъзаабахаа каана гороомаа. Анта валийунаа фагфир ланаа вархамнаа ва анта хойрул-гоофириин. Вактуб ланаа фии хаазихид-дунйаа хасанатан ва фил-аахыроти иннаа худнаа илайка. Лаа илааха илла анта субхаанака иннии кунту миназ-зоолимиин. Роббигфир вархам ва анта хойрур-роохимийн. Робби зиднии иълман ва алхикнии бис-соолихиин. Роббанаа ааманнаа фагфир ланаа вархамнаа ва анта хойрур-роохимиин. Робби хаб лии хукман ва алхикнии бис-соолихиин,  важ’аъл лии лисаана сыдкын фил-аахыриин, важ’аъльнии мин варосати жаннатин-на’иъим, ва лаа тухзинии йаума юб’аъсуун, явма лаа янфауъ маалун ва лаа бануун иллаа ман аталлооха бикольбин салиим. Роббанаа золамнаа анфусанаа ва ин лам тагфир ланаа ва тархамнаа ланакуунанна мин ал-хоосириин. Раббанаа лаа тузиг кулуубанаа ба’аъда из хадайтанаа ва хаб ланаа мин ладунка рохматан иннака антал-ваххааб. Роббана-гфир ланаа зунуубанаа ва исроофанаа фии амринаа ва саббит акдааманаа вансурнаа аълал-ковмил-каафириин. Аллаахумма-гфир лии жамии’аъ маа аслафтуху, ваъ’симнии фии маа бакийа, варзукнии аъмалан соолихан тардоо бихи аъннии яа зал-фадлил-аъзиим. Иннас-Софаа вал-Марвата мин ша’аъаириллаахи, фа ман хажжал-байта ав иътамаро фа лаа жунааха аълайхи ан яттоввафа бихимаа, ва ман таттовваъа хойрон фа инналлоха шаакирун Аълиим.",
        translation:
            'Аллах эң улуу. Аллах эң улуу. Аллахтан башка кудай жок. Аллах эң улуу жана бардык мактоолор Аллахка болсун.Аллахтан башка кудай жок. Ал жалгыз, Аллах Самад(Ага баары муктаж, Ага эч нерсе жетпейт). Ал туулбаган жана туубаган. Эч бир нерсе Ага окшош эмес жана Ал эч кимге окшош эмес. Өзгөчө нерселерди укмуштуудай жаратат жана баарын билет. Жети асмандын жана улуу Арштын Раббиси Аллах баарынан жогору.Оо Аллахым!Бизди кечир,бизге ырайым кыл. Биздин билбегенибизди, кемчиликтерибизди билесиң,кечире көр. Анткени, Сенде күч, мээрим бар. Оо Аллахым! Бизге бул дүйнөдө жакшылык, акыретте жакшылык бер. Бизди тозок азабынан сакта. Оо Аллахым! Тозок азабынан сакта, анткени анын азабы дайыма кыйроо. Сен биздин колдоочусуң. Бизди кечир жана бизге ырайым кыл. Сен кечиримдүүлөрдүн эң Кечиримдүүсүң. Бизге бул дүйнөдө да, акыретте да жакшылыктарды бер.Туура жолго түшүр. Оо Аллахым! Илимимди арттыр жана мени салихтерге жетеле. Оо Аллахым! Мага акылмандык бер жана мени салихтердин катарына кош. Келечек муундар мени жакшылык менен эстеп калсын.  Мени бейиш жыргалдарынын мураскору кыл. Кыямат күнү мени маскара кылба.  Ал күнү мал-мүлк да, уулдар да пайда бербейт, Аллахка таза жүрөк менен келген адам гана пайда көрөт. Оо Аллахым!  Бизди туура жолго салганыңдан кийин жүрөгүбүздү акыйкаттан адаштырба.',
      ),
      DuaModel(
        subtitle: 'Алтынчы айлануу саьий дуасы',
        arabicText:
            'اَللهُ أَكْبَرُ ، اَللهُ أَكْبَرُ ، لَٓا إِلٰهَ إِلَّا اللهُ وَاللهُ أَكْبَرُ ، اَللهُ أَكْبَرُ وَ لِلهِ الْحَمْدُ . اَللّٰهُمَّ فَاطِرَ السَّمٰوَاتِ وَالْأَرْضِ عَالِمَ الْغَيْبِ وَالشَّهَادَةِ رَبَّ كُلِّ شَيْءٍ وَ مَلِيكَهُ أَشْهَدُ أَنْ لَٓا إِلٰهَ إِلَّا أَنْتَ أَعُوذُ بِكَ مِنْ شَرِّ نَفْسِي ، وَ شَرِّ الشَّيْطَانِ وَ شِرْكِهِ . اَللّٰهُمَّ إِنِّي أَعُوذُ بِكَ مِنَ الشَّكِّ وَالشِّرْكِ وَالنِّفَاقِ وَالشِّقَاقِ وَ سُوءِ الْأَخْلَاقِ . اَللّٰهُمَّ إِنِّي أَعُوذُ بِكَ مِنَ الْإِثْمِ وَ مِنْ عَذَابِ النَّارِ وَ مِنْ عَذَابِ الْقَبْرِ وَ مِنْ فِتْنَةِ الْغِنَى وَ فِتْنَةِ الْفَقْرِ . اَللّٰهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ جَهْدِ الْبَلَاءِ ، وَ دَرْكِ الشَّقَاءِ ، وَ سُوءِ الْقَضَاءِ ، وَ شَمَاتَةِ الْأَعْدَاءِ . اَللّٰهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ زَوَالِ نِعْمَتِكَ ، وَ تَحَوُّلِ عَافِيَتِكَ ، وَ فُجَآءَةِ نِقْمَتِكَ ، وَ جَمِيعِ سَخَطِكَ . اَللّٰهُمَّ إِنّي أَعُوذُ بِكَ مِنَ الْمَأْثَمِ وَالْمَغْرَمِ . اَللّٰهُمَّ إِنِّي أَعُوذُ بِكَ مِنَ الْهَمِّ وَالْحَزَنِ ، وَ مِنَ الْعَجْزِ وَالْكَسَلِ ، وَ مِنَ الْجُبْنِ وَالْبُخْلِ، وَالْقَسْوَةِ وَالْغَفْلَةِ ، وَالذِّلَّةِ وَالْمَسْكَنَةِ . اَللّٰهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ يَوْمِ السُّوءِ ، وَ مِنْ لَيْلَةِ السُّوءِ ، وَ مِنْ سَاعَةِ السُّوءِ ، وَ مِنْ صَاحِبِ السُّوءِ ، وَ مِنْ جَارِ السُّوءِ . اَللّٰهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ أَنْ أَظْلِمَ أَوْ أُظْلِمَ . رَبِّ اغْفِرْ وَارْحَمْ وَاعْفُ وَ تَكَرَّمْ ، وَ تَجَاوَزْ عَمَّا تَعْلَمُ ، إِنَّكَ تَعْلَمُ مَا لَا نَعْلَمُ ، إِنَّكَ أَنْتَ الْأَعَزُّ الْأَكْرَمُ . رَبَّنَٓا اٰتِنَا فِي الدُّنْيَا حَسَنَةً وَ فِي الْاٰخِرَةِ حَسَنَةً وَ قِنَا عَذَابَ النَّارِ . لَٓا إِلٰهَ إِلَّا اللهُ وَحْدَهُ لَا شَرِيكَ لَهُ ، لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ يُحْيِي وَ يُمِيتُ بِيَدِهِ الْخَيْرُ وَهُوَ عَلٰى كُلِّ شَيْءٍ قَدِيرٌ . إِنَّ الصَّفَا وَالْمَرْوَةَ مِنْ شَعَٓائِرِ اللهِ ۚ فَمَنْ حَجَّ الْبَيْتَ أَوِ اعْتَمَرَ فَلَا جُنَاحَ عَلَيْهِ أَنْ يَطَّوَّفَ بِهِمَاۜ وَ مَنْ تَطَوَّعَ خَيْرًاۙ فَإِنَّ اللهَ شَاكِرٌ عَلِيمٌ',
        transliteration:
            "Аллоху акбар,  Аллоху акбар,  лаа илааха иллаллаху валлоху акбар, Аллоху акбар ва лиллаахил-хамд.  Аллаахумма фаатырос-самааваати вал-арды аъалимал-гойби ваш-шахаадати робби кулли шайин ва малиикаху ашхаду ан лаа илааха иллаа анта аъуузу бика мин шарри нафси, ва шарриш-шайтоони ва ширких.  Аллаахумма иннии аъуузу бика минаш-шакки ваш-ширки ван-нифаакы ваш-шикоокы ва сууил-ахлаак.  Аллаахумма иннии аъуузу бика минаал-исми ва мин аъзаабин-наари ва мин аъзаабил-кобри ва мин фитнатил-гынаа ва фитнатил-факр.  Аллаахумма иннии аъуузу бика мин жахдил-балааи,  ва даркиш-шакоои,  ва сууил-кодоои,  ва шамаататил-а’аъдааи.  Аллаахумма иннии аъуузу бика мин заваали ниъматика, ва тахаввули аъафиятика,ва фужаа’ати никматика,ва жамииъи сахотик.Аллаахумма иннии аъуузу бика минал-ма’сами вал-магроми.  Аллаахумма иннии аъуузу бика минал-хамми вал-хазани,  ва минал-аъжзи вал-касали,  ва минал-жубни вал-бухли,  вал-косвати вал-гофлати, вал-зиллати вал-масканати. Аллаахумма иннии аъуузу бика мин явмис-сууи,  ва мин лайлатис-сууи, ва мин саа’аътис-сууи,  ва мин соохибис-сууи, ва мин жаарис-сууи.  Аллаахумма иннии аъуузу бика ан азлима ав узлам.  Роббигфир вархам ваъфу ва такарром,  ва тажааваз аъммаа таълам,  иннака таъламу маа лаа наълам,  иннака антал-аъаззуль-акром.  Раббанаа аатинa фид-дунйаа хасанатан ва филь-аахыроти хасанатан ва кынаа аъзаабан-наар.  Лаа илааха иллаллаху вахдаху лаа шариика лаху,  лахул-мульку ва лахул-хамду юхйи ва юмиту,  бийадихил-хойру ва хува аълаа кулли шайин кодиир. Иннас-Софаа вал-Марвата мин ша’аъаириллаахи,  фа ман хажжал-байта ав иътамаро фа лаа жунааха аълайхи ан яттоввафа бихимаа,  ва ман таттовваъа хойрон фа инналлоха шаакирун Аълиим.",
        translation:
            'Аллах эң улуу.Аллах эң улуу. Аллахтан башка кудай жок.  Аллах эң улуу жана бардык мактоолор Аллахка болсун.Аллахтан башка кудай жок.  Ал жалгыз,   Аллах Самад  (Ага баары муктаж;  Ага эч нерсе жетпейт).  Ал туулбаган жана туубаган.  Эч бир нерсе Ага окшош эмес жана  Ал эч кимге окшош эмес.  Оо Аллахым!  Мен Сенден шектенүүлөрдөн,  ширктен,  Исламдын өкүмдөрүн жана тыйууларын бузуудан,  эки жүздүүлүктөн жана жаман кулк-мүнөздөн коргоо тилейм. Оо Аллахым!  Күнөөдөн,  тозок азабынан,  кабыр азабынан,  байлыктын азгырыгынан,  кедейликтен Өзүңдөн коргоо тилейм.  Оо Аллахым!  Мен Сенден чыдагыс кырсыктардан,  күнөөгө батуудан,  жаман тагдырдан жана душмандарды ыраазы кыла турган балээлерден сактанамын. Оо Аллахым!  Мен Сенден Өзүңдүн пайдаларыңдын токтоп калышынан,  ден соолук жана жыргалчылыкты жоготуудан,  күтүүсүз өч алуудан жана Сенин бардык каарыңдан коргоо тилейм.  Оо Аллахым!  Мен Сенден күнөөлөрдөн жана баш ийбестиктен коргоо сурайм.Оо Аллахым!  Кырсыктан, кайгыдан, алсыздыктан, жалкоолуктан, коркоктуктан, сараңдыктан, жүрөктүн катуулугунан, көңүл бурбоодон, кордуктан, жакырчылыктан жана кайгыдан сактоону сураймын. Оо Аллахым!  Мен Сенден күндүздүн жамандыгынан, түндүн жамандыгынан, кыямат күнүнүн жамандыгынан,  жаман адамдын жамандыгынан жана жаман кошунанын жамандыгынан коргоо тилейм. Оо Аллахым!  Зулумдук кылуудан жана башканын көңүлүн оорутудан Сенден коргоо сурайм. Оо Аллахым! Кечир, ырайым кыл, бизге ырайымыңды көрсөт.  Биздин кемчиликтерибизди билесиң, билбегендерибизди кечир.  Анткени, Сенде күч, мээрим бар. Оо Аллахым!  Бизге бул дүйнөдө, акыретте жакшылык бер. Бизди тозок азабынан сакта.’',
      ),
      DuaModel(
        subtitle: 'Жетинчи айлануу саьий дуасы',
        arabicText:
            'اَللهُ أَكْبَرُ ، اَللهُ أَكْبَرُ ، لَٓا إِلٰهَ إِلَّا اللهُ وَاللهُ أَكْبَرُ ، اَللهُ أَكْبَرُ وَ لِلهِ الْحَمْدُ . لَٓا إِلٰهَ إِلَّا اللهُ الْعَظِيمُ الْحَلِيمُ ، لَٓا إِلٰهَ إِلَّا اللهُ رَبُّ السَّمٰوَاتِ وَالْأَرْضِ ، لَٓا إِلٰهَ إِلَّا اللهُ رَبُّ الْعَرْشِ الْكَرِيمِ . اَللّٰهُمَّ لَا مَانِعَ لِمَا أَعْطَيْتَ ، وَلَا مُعْطِيَ لِمَا مَنَعْتَ ، وَلَا يَنْفَعُ ذَا الْجَدِّ مِنْكَ الْجَدُّ . رَبِّ اغْفِرْ وَارْحَمْ وَاعْفُ وَ تَكَرَّمْ ، وَ تَجَاوَزْ عَمَّا تَعْلَمُ ، إِنَّكَ تَعْلَمُ مَا لَا نَعْلَمُ ، إِنَّكَ أَنْتَ الْأَعَزُّ الْأَكْرَمُ . رَبَّنَٓا اٰتِنَا فِي الدُّنْيَا حَسَنَةً وَ فِي الْاٰخِرَةِ حَسَنَةً وَ قِنَا عَذَابَ النَّارِ . اَللّٰهُمَّ اهْدِنِي فِيمَنْ هَدَيْتَ ، وَ عَافِنِي فِيمَنْ عَافَيْتَ ، وَ تَوَلَّنِي فِيمَنْ تَوَلَّيْتَ ، وَ بَارِكْ لِي فِيمَا أَعْطَيْتَ ، وَ قِنِي شَرَّ مَا قَضَيْتَ ، إِنَّكَ تَقْضِي وَلَا يُقْضَى عَلَيْكَ ، إِنَّهُ لَا يَذِلُّ مَنْ وَالَيْتَ ، وَلَا يَعِزُّ مَنْ عَادَيْتَ ، تَبَارَكْتَ رَبَّنَا وَ تَعَالَيْتَ ، فَلَكَ الْحَمْدُ عَلٰى مَا قَضَيْتَ نَسْتَغْفِرُكَ وَ نَتُوبُ إِلَيْكَ . اَللّٰهُمَّ إِنِّي أَسْأَلُكَ الْهُدَى وَالتُّقَى وَالْعَفَافَ وَالْغِنَى . اَللّٰهُمَّ إِنِّى أَسْأَلُكَ قَلْبًا سَلِيمًا وَ لِسَانًا صَادِقًا . اَللّٰهُمَّ إِنِّى أَسْأَلُكَ الصِّحَّةَ وَالْعِفَّةَ وَالْأَمَانَةَ وَ حُسْنَ الْخُلُقِ وَالرِّضَى بِالْقَدَرِ . اَللّٰهُمَّ إِنِّي أَسْأَلُكَ الطَيِّبَاتِ ، وَ تَرْكَ المُنْكَرَاتِ ، وَ حُبَّ المَسَاكِينِ ، وَ أَنْ تَتُوبَ عَلَيَّ ، وَ تَغْفِرَ لِي وَ تَرْحَمَنِي . اَللّٰهُمَّ زِدْنِي عِلْمًا وَ لَا تُزِغْ قَلْبِي بَعْدَ أَنْ هَدَيْتَنِي وَ هَبْ لِي مِنْ لَدُنْكَ رَحْمَةً إِنَّكَ أَنْتَ الْوَهَّابُ . رَبِّ أَوْزِعْنِي أَنْ أَشْكُرَ نِعْمَتَكَ الَّتِي أَنْعَمْتَ عَلَيَّ وَ عَلٰى وَالِدَيَّ وَ أَنْ أَعْمَلَ صَالِحًا تَرْضٰيهُ وَ أَدْخِلْنِي بِرَحْمَتِكَ فِي عِبَادِكَ الصَّالِحِينَ . رَبِّ ارْحَمْهُمَا كَمَا رَبَّيَانِي صَغِيرًا. رَبَّنَا اغْفِرْ لِي وَ لِوَالِدَيَّ وَ لِلْمُؤْمِنِينَ يَوْمَ يَقُومُ الْحِسَابُ . إِنَّ الصَّفَا وَالْمَرْوَةَ مِنْ شَعَٓائِرِ اللهِ ۚ فَمَنْ حَجَّ الْبَيْتَ أَوِ اعْتَمَرَ فَلَا جُنَاحَ عَلَيْهِ أَنْ يَطَّوَّفَ بِهِمَاۜ وَ مَنْ تَطَوَّعَ خَيْرًاۙ فَإِنَّ اللهَ شَاكِرٌ عَلِيمٌ',
        transliteration:
            "Аллоху акбар,Аллоху акбар,  лаа илааха иллаллаху валлоху акбар, Аллоху акбар ва лиллаахил-хамд.  Лаа илааха иллаллахул-аъзиимул-халиим, лаа илааха иллаллаху раббус-самааваати вал-арди,  лаа илааха иллаллаху раббул-аършил-кариим.  Аллаахумма лаа мааниъа лимаа аътойта, ва лаа муътийа лимаа манаъта,  ва лаа янфаъу зал-жадди минкал-жадд. Роббигфир вархам ваъфу ва такарром, ва тажааваз аъммаа таълам, иннака таъламу маа лаа наълам, иннака антал-аъаззуль-акром. Раббанаа аатинa фид-дунйаа хасанатан ва филь-аахыроти хасанатан ва кынаа аъзаабан-наар.  Аллаахумма ихдинии фииман хадайта,  ва аъафинии фииман аъафайта, ва тавалланнии фииман таваллайта,  ва баарик лии фиимаа а’аътойта, ва кынии шарра маа кодайта,  иннака такдыы ва лаа юкдоо аълайка,  иннаху лаа язиллу ман ваалайта,  ва лаа яиъззу ман аъадайта,  табааракта раббанаа ва та’аъалайта,  фа лакал-хамду аълаа маа кодайта настагфирука ва натуубу илайка. Аллаахумма иннии ас’алукал-худаа ват-тукоо вал-аъфаафа валь-гынаа.Аллаахумма иннии ас’алука колбан салииман ва лисаанан соодикон.Аллаахумма иннии ас’алукас-сыххата вал-иъффата вал-амааната ва хуснал-хулукы вар-ридоо бил-кодари. Аллаахумма иннии ас’алукат-тоййибаати, ва таркал-мункарооти, ва хуббал-масаакиини,ва ан татууба аълайя, ва тагфиро лии ва тархамании.  Аллаахумма зиднии иълман ва лаа тузиг колбии баъда ан хадайтании ва хаб лии мин ладунка рохматан иннака антал-ваххааб. Робби авзиънии ан ашкура ниъматакаллатии анъамта аълайя ва аълаа ваалидайа ва ан а’аъмала соолихан тардооху ва адхылнии бирохматика фии иъбаадикас-соолихиин. Робби-рхамхумаа камаа роббайаании сагиирон. Роббанаа-гфир лии ва ливаалидайа ва лил-муминиина явма якуумул-хисааб. Иннас-Софаа вал-Марвата мин ша’аъаириллаахи,фа ман хажжал-байта ав иътамаро фа лаа жунааха аълайхи ан яттоввафа бихимаа,ва ман таттовваъа хойрон фа инналлоха шаакирун Аълиим.’",
        translation:
            'Аллах эң улуу.  Аллах эң улуу. Аллахтан башка кудай жок. Аллах эң улуу жана бардык мактоолор Аллахка болсун.Аллахтан башка кудай жок. Ал жалгыз,  Аллах Самад (Ага баары муктаж;  Ага эч нерсе жетпейт). Ал туулбаган жана туубаган. Эч бир нерсе Ага окшош эмес жана  Ал эч кимге окшош эмес. Оо Аллахым!  Сен берген нерсеңди эч ким тартып ала албайт, Сен ажыратканды эч ким бере албайт жана Сен Өзүңө таандык болбогон бардык жетишсиздиктен аруусуң. Оо Аллахым! Мени акыйкат жолуңа кандай багыттасаң,мени да ошондой жолго сал. Кандай тынчтык берсең, мага да ошондой бер. Мени өзүңдүн тандалган досторуңдан кыл. Мага берген нерсени мен үчүн жакшы жана пайдалуу кыл. Мени жамандык менен соттобо жана андан сакта. Ким досуң болсо кор болбойт, душманың болсо баркталбайт. Сен ыйыксың  ,Аллахым,  улуусуң. Сенин чечимдериң үчүн бардык мактоолор Сага таандык. Биз Сенден кечирим сурайбыз жана Сага тообо кылабыз. Оо Аллахым!  Мен Сенден бекем хидаят, такыбалык, ар-намыс жана байлык сурайм.Оо Аллахым!Илимимди арттыр. Сен мени туура жолго салганыңдан кийин жүрөгүмдү акыйкат жолунан адаштырба. Оо Аллахым!  Мага жана ата-энеме берген немат-жакшылыктарыңа шүгүр кылууга, Өзүң ыраазы боло турган амалдарды жасоого мени туура жолго сал жана мени Өз ырайымың менен салих пенделериңе кош! Оо,Аллахым! Ата-энеме мени кичинекей кезимде багышкандай мээримдүүлүк кыл.',
      ),
      DuaModel(
        subtitle: 'Чач алдырганда окула турган дуа.',
        arabicText:
            'اللَّهُمَّ بَارِكْ فِي نَفْسِي وَاغْفِرْ لِي ذُنُوبِي وَاجْعَلْ لِي بِكُلِّ شَعْرَةٍ مِنْهَا نُورًا يَوْمَ القِيَامَةِ.',
        transliteration:
            "Оо Аллахым!Мага береке бер,күнөөмдү кечир жана чачымдын ар бир талы үчүн Кыямат күнү мага нур бер.",
        translation: '',
      ),
    ],
  ),
  SectionModel(title: ' Ажылык бөлүмү ', duas: [
    DuaModel(
      subtitle: 'Минадан Арафатка жөнөө дуасы',
      arabicText:
          "اللَّهُمَّ إِلَيْكَ تَوَجَّهْتُ وَعَلَيْكَ تَوَكَّلْتُ ووَجْهَكَ أَرَدْتُ فَاجْعَلْ ذَنْبِي مَغْفُوراً وحَجَّتِي مَبْرُورًا وارْحَمْنِي ولَا تُخَيِّبْنِي وبَارِكْ لِي فِي سَفَرِي وقِنِي بِعَرَفاتِ حاجيًّا إِنَّكَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ.",
      transliteration:
          'Окулушу:  “Аллохумма илайка таважжахту ва аълайка таваккалту ва важхака ародту фаж’аъл занбии магфуурон ва хажжатии мабруурон вархамнии ва лаа тухойибнии ва баарик лии фии сафарии ва кынии би аърофаати хаажийан иннака аълаа кулли шайин кодиир.”',
      translation:
          'Котормосу:  “Оо Аллахым!  Мен Сага жүздөндүм. Сага тобокел кылдым. Затыңды ираада кылдым. Күнөөмдү кечир, ажылыгымды мабруур кыл (кабыл кыл). Мага ырайым кылып, үмүтсүз кылбагын. Сапарыма береке бер. Арафат майданында менин муктаждыгымды толук бер.  Албетте,  Сен бардык нерсеге кадыр Затсың!”',
    ),
    DuaModel(
        subtitle: 'Арафатка кирүүдөгү дуа',
        arabicText:
            'اللَّهُمَّ إِلَيْكَ تَوَجَّهْتُ وَعَلَيْكَ تَوَكَّلْتُ وَوَجْهَكَ أَرَدْتُ اللَّهُمَّ اغْفِرْ لِي وَتُبْ عَلَيَّ و أَعْطِنِي سُؤَالِي وَوَجِّهْ لِيَ الْخَيْرَ أَيْنَمَا تَوَجَّهْتُ . سُبْحَانَ اللَّهِ وَالْحَمْدُ لِلَّهِ وَلَا إِلَهَ إِلَّا اللَّهُ وَاللَّهُ أَكْبَرُ.',
        transliteration:
            'Окулушу:  “Аллохумма илайка таважжахту ва аълайка таваккалту ва важхака ародту аллохуммагфир лии ва туб аълайа ва а’аътинии суаалии ва важжих лиял хойро айнамаа таважжахту субхааналлохи вал хамду лиллахи ва лаа илааха иллаллоху валлоху акбар.” ',
        translation:
            'Котормосу:  “Оо Аллахым!  Мен Сага жүздөндүм, Сага тобокел кылдым. Затыңды ираада кылдым. Оо Аллахым! Күнөөмдү кечир. Тообамды кабыл кыл.Сураганымды бер.  Кайсыл жерге барбайын, мени жакшылыкка жолдо.  Алланын Заты бардык айыптардан таза. Баардык алкыш-мактоолор Аллага ган таандык.  Алладан башка илах жок.Аллах Улуу.’’'),
    DuaModel(
        subtitle:
            'Арафатта пешин жана аср намаздарын чогу окугандан кийин окула турган дуа',
        arabicText:
            'لَبَّيْكَ اللَّهُمَّ لَبَّيْكَ، إِنَّ الخَيْرَ خَيْرُ الآخِرَةِ. اللَّهُمَّ لَا عَيْشَ إِلَّا عَيْشُ الآخِرَةِ. اللَّهُمَّ اهْدِنِي بِالْهُدَى وَنَقِّنِي بِالتَّقْوَى وَاغْفِرْ لِي فِي الآخِرَةِ وَالأُولَى',
        transliteration:
            'Окулушу:  “Лаббайкаллохумма лаббайк иннал-хойро хойрул аахиироти. Аллохумма лаа ъайша илла ъайшул аахироти. Аллохумма-хдинии бил-худаа ва наккинии бит-такваа вагфир лии фил-аахироти вал-уулаа.”',
        translation:
            'Котормосу:  “Оо Аллахым!Мына мен Сенин алдыңа келдим (кызматыңа келдим).  Албетте,  чыныгы жакшылык  акыреттин  жакшылыгы,  чыныгы жашоо акырет жашоосу.  Оо Аллахым!  Менин Өзүңдүн хидаятың менен хидаят жолуңа жолдогун,  такбалыгың менен тазалагын жана дүйнө, акыретте мени кечиргин.” '),
    DuaModel(
        subtitle: 'Арафат күнү Шамда окула турган дуа',
        arabicText:
            'اللَّهُمَّ لَكَ الحَمْدُ كَالَّذِي تَقُولُ وَخَيْرًا مِمَّا نَقُولُ. اللَّهُمَّ لَكَ صَلَاتِي وَنُسُكِي وَمَحْيَايَ وَمَمَاتِي وَإِلَيْكَ مَآبِي وَلَكَ رَبِّي تُرَاثِي. اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ عَذَابِ القَبْرِ وَوَسْوَسَةِ الصَّدْرِ وَشَتَاتِ الأَمْرِ',
        transliteration:
            'Окулушу:  “Аллохумма лакал-хамду кал-лазии такуул  ва хойрон миммаа накуул.  Аллохумма лака солаатии ва нусукии ва махяааяа ва мамаатии ва илайка ма-аабии ва лака робби туроосии. Аллохумма иннии ъауузу бика мин ъазаабил кобри ва васвасатис-содри ва шатаатил-амри.”',
        translation:
            'Котормосу:  “Оо Аллахым!  Сага Өзүң айткандай жана биз айткандан да жакшыраак мактоолор болсун.  Оо Аллахым!  Менин намазым,  курбанчылыгым,  жашоом жана өлүмүм Сен үчүн.  Мен сага кайтып барамын. Оо Роббим!  Менин мурасым Сен үчүн. Оо Аллахым!  Мен Сенден кабыр азабынан,  жүрөктөгү азгырыктан,  иштеримдин башаламандыгынан паана тилеймин.”'),
    DuaModel(
        subtitle: 'Арафадан муздалифага жөнөгөндө окула турган дуба',
        arabicText:
            'اللَّهُمَّ إِلَيْكَ أَفَضْتُ وَمِنْ عَذَابِكَ أَشْفَقْتُ وَإِلَيْكَ رَغِبْتُ وَمِنْ سَخَطِكَ رَهِبْتُ، فَاقْبَلْ نُسُكِي وَأَعْظِمْ أَجْرِي وَتَقَبَّلْ تَوْبَتِي وَارْحَمْ تَضَرُّعِي وَاسْتَجِبْ دُعَائِي وَأَعْطِنِي سُؤَالِي يَا أَرْحَمَ الرَّاحِمِينَ',
        transliteration:
            'Окулушу:  “Аллохумма илайка афазту ва мин ъазаабика ашфакту ва илайка рогибту ва мин сахотика рохибту факбал нусукии ва аъзим ажрии ва такоббал тавбатии вархам тазарруъии ва-стажиб  дуъааии ва аътинии суаалии яаа архамар роохимиин.”',
        translation:
            'Котормосу:  “Оо Аллахым!Алдыңа келдим,  азабыңдан корктум. Курбанчылыктарымды кабыл кыл, сообумду көбөйтүп бер.  Менин тообамды кабыл кыл, жалынып жалбарган өтүнүчүмө ырайым кыл,  дубамды кабыл кыл, сураганымды бер.  ОоМээримдүүлөрдүн Мээримдүүсү!”'),
    DuaModel(
        subtitle: 'Муздалифада окулуучу дуба',
        arabicText:
            'اللَّهُمَّ إِنِّي أَسْأَلُكَ أَنْ تَرْزُقَنِي فِي هَذَا المَكَانِ جَوَامِعَ الخَيْرِ كُلِّهِ وَأَنْ تَصْرِفَ عَنِّي السُّوءَ كُلَّهُ، فَإِنَّهُ لَا يَفْعَلُ ذَلِكَ غَيْرُكَ وَلَا يَجُودُ بِهِ إِلَّا أَنْتَ',
        transliteration:
            'Окулушу:  “Аллохумма инни ас- алука антарзуконии фии хаза-лмакаани жаваамиъа-л хойри куллихи ва ан тасрифа ъаннии-ссуу-а куллаху фаиннаху лаа яфъалу заалика гойрука ва лаа яжууду бихи илла анта.”',
        translation:
            'Котормосу:  “Оо Аллахым!  Бул жайда бар жакшылыктарыңдын баарын мага насип кылууңду жана ар түрдүү жаманчылыктардын барын кетирүүңдү сураймын. Себеби муну Сенден башкасы кыла албайт жана Сенден башка эч ким бул жакшылыкты бере албайт.”'),
    DuaModel(
        subtitle: ' “Батни  Мухассар“дан өтүүдө окулуучу дуа',
        arabicText:
            "اللّٰهمَّ لا تَقْتُلْنا بِغَضَبِكَ وَلا تُهْلِكْنا بِعَذَابِكَ وَعافِنا قَبْلَ ذٰلِكَ.",
        transliteration:
            'Окулушу:  “Аллохумма  лаа тактулнаа бигозобика ва лаа тухликнаа биъазаабика ва ъаафинаа кобла заалика”',
        translation:
            'Котормосу:  “Оо Аллахым!  Бизди Өзүңдүн ачууң менен өлтүрбөгүн, азабың менен жок кылбагын.  Мындан алдын бизди кечиргин.”'),
    DuaModel(
        subtitle: 'Минага жеткенден кийин окулуучу дуа',
        arabicText:
            'اللَّهُمَّ هَذِهِ مِنَةٌ قَدْ أَتَيْتُهَا وَأَنَا عَبْدُكَ وَابْنُ عَبْدِكَ أَسْأَلُكَ أَنْ تَمُنَّ عَلَيَّ بِمَا مَنَنْتَ بِهِ عَلَى أَوْلِيَائِكَ يَا أَرْحَمَ الرَّاحِمِينَ',
        transliteration:
            'Окулушу:  “Аллохумма хазихи мина код атайтуха ва ана ъабдука ва-бну ъабдика асалука ан тамунна ъалаййа бимаа мананта бихи ъалаа авлияааика яаа ар-хамар роохимиин.”',
        translation:
            'Окулушу:  “Аллохумма хазихи мина код атайтуха ва ана ъабдука ва-бну ъабдика асалука ан тамунна ъалаййа бимаа мананта бихи ъалаа авлияааика яаа ар-хамар роохимиин.”'),
    DuaModel(
        subtitle: 'Жамарат таштарын атууда окула турган  дуа',
        arabicText:
            'بِسْمِ اللّٰهِ اللّٰهُ أَكْبَرُ، رَغْمَانٌ لِلشَّيْطَانِ وَ رِضًا لِلرَّحْمَانِ.',
        transliteration:
            'Окулушу:  “Бисмиллахи аллоху акбар рогман ли-ш шайтоони ва ризон ли-р рохмаани.”',
        translation:
            'Котормосу:  “Мен Алланын аты менен  (шайтанга таш атамын).  Аллах Улуу Зат.  Шайтандын мурдун жерге сүйрөп Рахмандын ыраазылыгы үчүн (таш атамын).”'),
    DuaModel(
        subtitle: 'Таш аткандан кийин окула турган дуа',
        arabicText:
            'اللَّهُمَّ اجْعَلْهُ حَجًّا مَبْرُورًا وَسَعْيًا مَشْكُورًا وَذَنْبًا مَغْفُورًا',
        transliteration:
            'Окулушу:  “Аллохумма -жъалху хажжан мабруурон ва саъаяан машкуурон ва занбан магфуурон.',
        translation:
            'Котормосу:  “Оо Аллахым!  Ажылыгымды мабрур,  аракетимди пайдалуу кылгын жана күүнөөлөрүмдү кечиргин.”'),
    DuaModel(
        subtitle: 'Курбанчылыктын дуасы',
        arabicText:
            'إِنِّي وَجَّهْتُ وَجْهِيَ لِلَّذِي فَطَرَ السَّمَاوَاتِ وَالْأَرْضَ حَنِيفًا ۖ وَمَا أَنَا مِنَ الْمُشْرِكِينَ ۚ إِنَّ صَلَاتِي وَنُسُكِي وَمَحْيَايَ وَمَمَاتِي لِلَّهِ رَبِّ الْعَالَمِينَ ۖ لَا شَرِيكَ لَهُ ۖ وَبِذَٰلِكَ أُمِرْتُ وَأَنَا أَوَّلُ الْمُسْلِمِينَ.',
        transliteration:
            'Окулушу:  “Иннии важжахту важхия лиллазии фаторо - самааваати ва-л арзо ханиифав ва маа ана минал мушрикиин.  Инна солаати ва нусукии ва махяааяа ва мамаатии лиллахи роббил ъаламиин.  Лаа шариика лаху ва бизаалика умирту ва ана аввалу-л муслимин.”',
        translation:
            'Котормосу:  ”Мен туура жолду тандаган абалда, өзүмдү асмандар жана жерди жараткан Затка караттым.  Мен мушриктерден эмесмин. Шек күмөнү жок менин намазым,  курбанчылыгым,  жашоом жана өлүмүм бүткүл ааламдардын Роббиси болгон Аллах үчүн. Анын шериги жок. Ошого буйрулдум жана биринчилерден болуп мусулман болдум.”'),
    DuaModel(
        subtitle: 'Кабырыстанды зыярат кылуу дубасы',
        arabicText:
            'أَسْلَمُ عَلَيْكُمْ دَارَ قَوْمٍ مُّؤْمِنِينَ وَإِن تَشَاءَ اللَّهُ بِكُمْ لَاحِقُونَ',
        transliteration:
            'Окулушу:  “Ассаламу алайкум дааро ковмин муминиин ва иннаа ин шаа аллоху бикум лаахикуун.”',
        translation:
            'Котормосу:  “Оо Момундар коому!  Силерге салам болсун!  Ин шаа Аллах биз да силерге кошулабыз.”'),
    DuaModel(
        subtitle: 'Меккеден кайткандагы  дуа ',
        arabicText:
            'اللَّهُمَّ لَا تَجْعَلْ هَذَا الْأَخِيرَ الْخَاضِعَ مِنْ بَيْتِكَ وَارْزُقْنِي الْقَاضِيَ إِلَيْهِ لَا إِلَهَ إِلَّا اللَّهُ وَحْدَهُ لَا شَرِيكَ لَهُ، لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ وَهُوَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ.آيِبُونَ تَائِبُونَ عَابِدُونَ سَاجِدُونَ لِرَبِّنَا حَامِدُونَ سَدَقَ اللَّهُ وَعْدَهُ وَنَصَرَ عَبْدَهُ وَهَزَمَ الْأَحْزَابَ وَحْدَهُ."',
        transliteration:
            'Окулушу:  ”Аллохумма лаа тажъал хааза аахиро-л ъахди мим байтика ва-р зукнияал ъавда илайхи лаа иллаха иллаллоху вахдаху лаа шариика лах,  лахул мулку ва лахул хамду ва хува ъалаа кулли шайиң кодиир.Ааибууна тааибууна ъаабидууна саажидууна ли роббинаа хаамидууна содаколлоху ваъдаху ва насаро ъабдаху ва хазамал ахзааба вахдаху.”',
        translation:
            'Котормосу:  “Оо Аллахым!  Үйүңө кылган бул сапарымды акыркы кылбагын, кайра-кайра кайтып келүүгө насип кылгын.  Аллахтан башка илах жок.  Ал жападан Жалгыз,  Анын шериги жок.  Бардык падышачылык жана мактоо Ага гана таандык жана Ал бардык нерсеге Кадыр Зат.  Артка кайтуучубуз,  тооба кылуучубуз  ,ибадат кылуучубуз,  Роббибизге сажда кылып,  мактоо айтуучубуз. Аллах убадасын аткарды,  пендесине жардам берди жана душмандарын Өзү жалгыз жеңди.’'),
  ]),
  SectionModel(
    title: 'Мадина бөлүмү',
    duas: [
      DuaModel(
        subtitle: 'Мадина мунавварага жакын калганда окула турган дуба',
        arabicText:
            'مُ رَسُولِكَ فَاجْعَلْ دُخُولِي في جَوَارِ نَارِ وَآمَانًا مِنَ الْعَذَابِ وَسُوءِ الْحِسَابِ.',
        transliteration:
            "Аллохумма хаза харому расуулика фа-жъал духуулии викооятан мина-н наари ва амаанан минал ъазааби ва сууи-л хисааби.",
        translation:
            'Оо Аллахым!  Бул Сенин пайгамбарыңдын харамы.  Ал жерге кирүүмдү мен үчүн  тозоктон кутулууга,  тозок азабынан,  эсеп-китептин катуулугунан сактанууга ортомчу кыл.',
      ),
      DuaModel(
        subtitle: 'Мадина шаары көрүнгөндө айтылуучу дуа',
        arabicText:
            'اللهم بارك  لنا  فيها (ثلاثا) و يقول: اللهم ارزق جناها و حببنا إلى أهلها و حبّب صالحي أهلها إلينا',
        transliteration:
            "Аллахумма барик лана фиха (3 жолу). Аллахумма рзук джаннаха ва хаббибна ахлаха ва хаббиб салихи ахлиха илайна",
        translation:
            'Оо Аллах бизге бул шаарда береке бер  (үч жолу),  Оо,Аллах бизге анын мөмөлөрү менен,анын тургундарынын жана анын салихтеринин сүйүүсү  насип эт',
      ),
      DuaModel(
        subtitle: ' Пайгамбар(с.а.в)га салам айтуу',
        arabicText:
            'السلام عليك يا رسول الله, السلام عليك يا نبيّ الله, السلام عليك يا صفيّ الله, السلام عليك يا حبيب الله, السلام عليك يا نبيّ الرحمة, السلام عليك يا شفيع الأمة, السلام عليك يا سيّد  المرسلين, السلام عليك يا خاتم النبيين,  و على أهل بيتك الطيبين الطاهرين, جزاك اللّه عنا أفضل  ما جزى نبيا و رسولا عن أمته, أشهد أنك قد بلغت الرسالة, و أديت الأمانة, و نصحت الأمة, و كشفت الغمة و أوضحت الحجة و جاهدت في سبيل الله تعالى حق جهاده, و أقمت الدين حتى أتاك اليقين فصلى الله عليك إلى يوم الدين',
        transliteration:
            "Ассаламу алайка йа расулуллах,  ассаламу алайка йа набийаллах, ассаляму алайка йа сафийаллах,  ассаламу алейка йа хабибаллах,  ассаламу алайка йа набийаррахма,  ассаламу алайка йа шафиъа льуммах,  ассаламу алайка йа сайидаль мурсалин,  ассаламу алайка йа хатима ннабийин,  уа ала ахли байтика таййибина ттахирин,  джазакаллаху анна афдала ма джаза набийан уа расулан ан умматихи,  ашхаду аннака кад баллагта аррисалах  ,ва аддайта аль аманах,  ва насаха льуммах,ва кашафа аль гумма,  ва аудахта аль худжджа,  ва джаахадта фи сабилиллахи таъала хакко джихаадихи,  ва акамта ддина хатта атака аль якын,  фасаллаллаху алейка ила йаумиддин",
        translation:
            'Ассаламу алейкум Аллахтын Элчиси.  Алланын пенделеринин абзели!  Сага салам болсун.  Оопенделеринин арасынан Өзү тандап алган Зат!  Сага салам болсун.  ОоАллахтын сүйүктүүсү,  сага тынчтык, дүйнөнүн  рахматы,  тынчтыгы сага болсун. Оотынчтык  кабарчылардын башчысы! Сага тынчтык болсун. Оо,пайгамбарлардын мөөрү. Сиздин асыл жана таза үй-бүлөңүздүн мүчөлөрүнө тынчтык болсун.  Бизди эң ​​жакшы элчилер жана пайгамбарлар менен сыйлаган Аллага шүгүр айтам.  Дааватты жеткирдиң, ыйманды толук кылдың, үммөткө насаат кылдың, тумандарды тараттың, далилдерди ачыкка чыгардың, акыйкат келгенге чейин Алланын жолунда согуштуң деп күбөлүк берем. Кыяматка чейин Аллахтын саламы болсун.',
      ),
      DuaModel(
        subtitle: 'Башка бирөөнүн саламын жеткирүү',
        arabicText:
            'السلامُ عليك يا رسول الله، مَن (اسم المريض) يَسْتَشْفي بِكَ إِلَى رَبِّكَ، فَاشْفِ لَهُ وَلِجَمِيعِ المُؤْمِنِين.',
        transliteration:
            "Ассалому ъалайка яаа росуулаллох мин(салам айткандын атын айтып)ясташфиъу бика илаа роббика фашфаъ лахуу ва ли-жа-мииъил муминиин.",
        translation:
            'Оо Алланын элчиси,  баланчанын уулу баланча(ким салам айткан болсо ошол адамдын аты айтылат)тарабынан сага салам.  Ал сенин Роббиңдин алдында сенин шапаат кылууңа талапкер.  Аны да,  жалпы момундарды шапаат кыла көр.',
      ),
      DuaModel(
        subtitle: 'Абу Бакр ас-Сыддыкка(р.а)салам айтуу',
        arabicText:
            'السَّلَامُ عَلَيْكَ يَا خَلِيفَةَ رَسُولِ اللَّهِ، السَّلَامُ عَلَيْكُمْ يَا صَاحِبَ رَسُولِ اللَّهِ، وَأَنِيسَهُ فِي الْغَارِ، وَرَفِيقَهُ فِي الْأَسْفَارِ، جَزَاكَ اللَّهُ خَيْرًا مِنْ جَزَاءٍ',
        transliteration:
            "Ассаламу алейка йа халифата расулиллах, ассаламу алейкум йа саахиба расули Ллах, ва анисаху фи льгаар, ва рафиикаху филь асфаар, джазакаЛлаху ъанна хайра ль джазаа.",
        translation:
            'Сага салам болсун,  эй Расулулла  (с.а.в)  дын орун басары!  Сага салам болсун,  эй Расулуллахтын сахабасы.  Сен аны менен бирге үңкүрдө  болгон жана бардык сапарларында аны коштоп жүргөн адамсың,  Аллах сени биз үчүн эң жакшы сыйлык менен сыйласын!',
      ),
      DuaModel(
        subtitle: 'Умардын(р.а)кабырынын жанында салам айтуу',
        arabicText:
            'أَسْلَمُ عَلَيْكَ يَا أَمِيرَ الْمُؤْمِنِينَ، أَسْلَمُ عَلَيْكَ يَا مُظْهِرَ الْإِسْلَامِ وَمُكَسِّرَ الْأَصْنَامِ، جَزَاكَ اللَّهُ خَيْرًا عَنَّا أَفْضَلَ الْجَزَاءِ.',
        transliteration:
            "Ассаламу алайка йа амира льмуминин, ассаламу алейка йа музхира ль ислам уа мукассира аль аснам,  джазака ллаху ъанна афдала аль джазаа.",
        translation:
            'Ассаламу алейкум,эй момундардын амири,салам сага,эй Исламды түшүргөн жана буттарды жок кылган! Аллах сени эң жакшысы менен сыйласын!',
      ),
      DuaModel(
        subtitle: '"Риязул-жаннатда" окула турган дуа',
        arabicText:
            'أللهُمَّ إِنَّ هَذِهِ الرَّوْضَةَ رَوْضَتُهَا وَنَوَّرْتَهَا بِنُورِ نَبِيِّكَ وَحَبِيبِكَ مُحَمَّدٍ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ.اللّٰهُمَّ بَلِّغْنَا فِي زِيَارَتِهَا وَمَسِيرَتِهَا الشَّرِيفَةِ فَلَا تَحْرِمْنَا يَا اللهُ فِي الْآخِرَةِ مِنْ فَضْلِ شَفَاعَةِ مُحَمَّدٍ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ.وَأَشْرِنَا فِي زُمْرَتِهَ وَتَحْتِ لِوَائِهَ وَأُمَّتِنَا عَلَى مُحَبَّتِهَ وَسُنَّتِهَ وَاسْقِنَا مِنْ حَوْضِهِ الْمَوْرُودِ بِيَدَيْهِ الشَّرِيفَتَيْنِ شَرْبَةً هَنِيَّئَةً لَا نَظْمَأُ بَعْدَهَا أَبَدًا إِنَّكَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ.',
        transliteration:
            "Аллохумма инна хазихи ровзотун ромтаха ва наввартаха бинуури набиййика ва хабибика мухаммадин соллолоху алайхи ва саллам. Аллохумма баллигнаа фии зияаротихаа ва масиротихааш-шариифати фалаа тахримнаа яаа аллах фил аахироти мин фадли шафаа-ати мухамадин соллолоху алайхи ва саллам.Ва-хшурнаа фии зумротихи ва тахта ливааихи ва амитнаа аълаа махаббатихи ва суннатихи ва-скынаа мин хавдихи-лмаврууди биядихи -ш шариифатайни шарбатан ханииатан лаа назмауъ баъдахаа абадан иннака алаа кулли шайин кодиир. ",
        translation:
            'Оо Аллахым!  Шек күмөнү жок, бул жер бейиш бакчаларынан болгон бир бакча, аны Сен шарапаттуу, ыззаттуу, кадыр барктуу кылдың. Жана Өзүңдүн сүйүктүү Мухаммад (с.а.в) пайгамбардын нуру менен нурланттың.Оо Аллахым!  Кандай эле бизге бул дүйнөдө Пайгамбарыбыз (с.а.в)ды жана анын жайын зыярат кылууга мүмкүнчүлүк бергендей, мына ошондой акыретте пайгамбардын шапаатынан куру калтырба.  Оо Аллахым! Бизди Пайгамбарыбыз (с. а.в) дын жамаатында жана анын желегинин астында чогулта көр. Пайгамбарды сүйгөн жана анын сүннөтүн бекем карманган абалда бизге өлүм бере көр. Жана Пайгамбарыбыздын хавзы (Кавсар суусу) өз колу менен суу ичире көр, биз аны ичкенден кийин эч качан чаңкабай тургандардай болойлу. Албетте Сен бардык нерсеге Кудуреттүүсүң!',
      ),
      DuaModel(
        subtitle: 'Сапардан кайтканда окулуучу дуа',
        arabicText:
            'بِسْمِ اللهِ، أَيبُونَ تَائِبُونَ عَابِدُونَ سَاجِدُونَ لِرَبِّنَا حَامِدُونَ صدَقَ اللهُ وَعْدَهُ وَنَصَرَ عَبْدَهُ وَهَزَمَ الأَحْزَابَ وَحْدَهُ.',
        transliteration:
            "Бисмиллахи ааибууна тааибууна ъаабидууна саажидууна ли роббинаа хаамидууна содаколлоху ва’аъдаху ва насаро аъбдаху ва хазамал ахзааба вахдаху.",
        translation:
            'Аллахтын аты менен биз артка кайтуучубуз, тооба кылуучубуз,  Роббибизге сажда кылып, мактоо айтуучубуз. Аллах убадасын аткарды, пендесине жардам берди жана душмандарын Өзү жалгыз жеңди.',
      ),
    ],
  ),
];
