class AboutHadjModel {
  final String title;
  final String description;
  AboutHadjModel({required this.title, required this.description});
}

final List<AboutHadjModel> aboutHadjModel = [
  AboutHadjModel(
      title: 'Мекке бөлүмү',
      description:
          ' Сапарга аттануунун дуасыАба учагына отурганда же башка унааларга отурганда окулуучу дуа Сапар учурунда окуулучу дуа Ажылыктын ихрамын байлап жаткан убакта окулуучу дуа Умра же таматтуъ ажылыгынын ихрамын байлап жаткан убакта окулуучу дуа Кирон ажылыгынын ихрамын байлап жаткан убакта окулуучу дуа Харамдын чегине киргенде окулуучу дуа Харам мечитине кирип жатканда окулуучу дуа Байтуллону биринчи жолу көргөндө окула турган дуа Мултазамда окулуучу дуа Рахмат мийзабтын астында окулуучу дуа.(11 дуа)'),
  AboutHadjModel(
      title: ' Таваф бөлүмү',
      description:
          'Таваф кылып баштаганда окуулучу дуа. Биринчи айлануунун дуасы Рүкүн Яаминийден Хажар Асвад ортосундагы дуа Экинчи айлануунун дуасы Үчүнчү айлануунун дуасы Төртүнчү айлануунун дуасы  Бешинчи айлануунун дуасы Алтынчы айлануунун дуасы Жетинчи айлануунун дуасы Таваф намазынан кийин Маком Ибрахимде Адам Алайхи-с Саламдын дуаларын окуу Зам-зам сууну ичүү дуасы (11 дуа)'),
  AboutHadjModel(
      title: 'Саъий бөлүмү',
      description:
          'Сафа жана Марвага саъий кылуу үчүн Харам мечитинен чыгуу дуасы Сафа тарапка чыгып баратканда окула турган дуа. Сафа тоосунда турган абалда окула турган дуа Биринчи айлануу саьий дуасы Экинчи айлануу саьий дуасы  Үчүнчү айлануу саьий дуасы Төртүнчү айлануу саьий дуасы Бешинчи айлануу саьий дуасы  Алтынчы айлануу саьий дуасы Жетинчи айлануу саьий дуасы Эки жашыл сызыктын ортосунда окулуучу дуа Эки жашыл сызыктан өткөндөн кийин Марва тоосуна көтөрүлүп жатканда окула турган дуа Чач алдырганда окула турган дуа (13 дуа)'),
  AboutHadjModel(
      title: 'Ажылык бөлүмү ',
      description:
          'Минадан Арафатка жөнөө дуасы  Арафатка кирүүдөгү дуа Арафатта пешин жана аср намаздарын чогу окугандан кийин окула турган дуа Арафат күнү Шамда окула турган дуа Арафадан муздалифага жөнөгөндө окула турган дуба Муздалифада  окулуучу дуба “Батни  Мухассар “ дан өтүүдө окулуучу дуа Минага жеткенден кийин окулуучу дуа Жамарат таштарын атууда окула турган  дуа Таш аткандан кийин окула турган дуа Курбанчылыктын дуасы Меккедеги “Жаннатул Муъалла “кабырыстанына зыярат кылуу дубасы  Меккеден кайткандагы  дуа (13 дуа)'),
  AboutHadjModel(
      title: ' Мадина бөлүмү',
      description:
          'Мадина мунавварага жакын калганда окула турган дуа Мадина шаары көрүнгөндө айтылуучу дуа Навабий мечитине киргенде окуулучу дуа Пайгамбар(с.а.в)га салам айтуу Башка бирөөнүн саламын жеткирүү Абу Бакр ас-Сыддыкка (р.а) салам айтуу Умардын (р.а) кабырынын жанында салам айтуу "Риязул-жаннатда" окула турган дуа Сапардан кайтканда окулуучу дуа (9 дуа) '),
];
