class AboutModel {
  final String title;
  final String description;
  AboutModel({required this.title, required this.description});
}

final List<AboutModel> aboutFineModel = [
  AboutModel(
      title: 'Кемчиликтердин жаза-төлөмдөрү кандай болот?',
      description:
          'Ажылык парзын аткаруу учурунда кетирилген кээ бир кемчиликтерден улам ажылык бузулуп,кийинки жылы ажылыктын казасын аткаруу талап кылынса,айрым кемчиликтер абалга жараша ар кандай жаза төлөмдөр  өтүүлүсүн шарттайт'),
  AboutModel(
      title:
          'Ажылык же умра бузулуп кайрадан казасы өтөлүүсүн талап кылган кемчиликтер',
      description:
          '•Ажылык парзын аткаруу максат менен ихрамга киргенден кийин Арафатту туруу милдетин аткара электе жубайлардын жыныстык катнашта болушу ажылыкты толук бузат.'),
  AboutModel(
      title: 'Бодо мал курмандыкка чалууга тийиштүү кемчиликтер',
      description:
          '•Арафатта тургандан кийин чач алдырып же кырктырып ихрамдан чыгуудан мурун жубайлар жыныстык катнашта болсо. \n•Зыярат таваф эркектер жунуб,аялдар хайз же нифас учурунда аткарса.Таваф даараттуу болуп аткарылышы важиб.Зыярат тавабы дааратсыз аткарылса бир кой же эчки сыяктуу майда жандыкты курмандык чалуу жазасы келет.'),
  AboutModel(
      title: 'Кой же эчкини курмандыкка чалууну талап кыла турган кемчиликтер',
      description:
          'Булар ичиндеги важиптер менен байланыштуу кемчиликтер жана ихрам тыюуларына байланыштуу кемчиликтер болуп экиге бөлүнөт.'),
  AboutModel(
      title: 'Важиптерге байланыштуу кемчиликтер',
      description:
          ' • Мийкат чектеринен ихрамсыз өтүү;  \n• Сайынын бут айлампаларын же болбосо төрттөн кем эмес айлампасын жасабай коюу;\n• Харам чөлкөмүнүн сыртында чач алдыруу же кырктыруу (имам Абу Ханифа боюнча); \n •Муздалифада туруу милдетин  себепсиз калтыруу; •Арафа күнү Арафаттан күн бата электе кайтуу; \n•Зыярат тавабын Курбан айттын  3- күнү күн батканга чейин аткарбай ,кийинки күндөргө калтыруу. \n•Шайтанга таш ыргытпоо же бир күн ичинде ыргытылчу таштардын жарымынан көбүн  шайтанга таш ыргытчу күндөрдө ыргытпоо.(бир  күн ичинде 21 ден таш ыргытылат.)\n • Умра тавафынын акыркы үч айлампасын же бир-эки айлампасын чала калтыруу; \n• Умра тавафын дааратсыз же жунуп абалда аткаруу; \n• Умра тавафында аврат (уят) мүчөлөрүнүн ачык калуусу;   \n•Мийкат чектеринин сыртынан келгендер коштошуу (вадаа) тавабын  бүт бойдон аткарбоо же 4 айлампадан көп айлапасын аткарбоо; \n•Зыярат тавабы,умра тавабы жана вадаа тавабы аткарууда аурат мүчөлөрүнүн ачык калуусу; '),
  AboutModel(
      title: 'Ихрам тыюуларын бузууга байланыштуу кемчиликтер',
      description:
          '• Чач, сакал же дененин башка жериндеги түктөрдүн төрттөн бир бөлүгүн же андан да көбүн алуу же кыркуу. (Төрттөн бир бөлүгүнөнн аз болсо садака берүүгө тийиш); \n • Бир жерде жана бир эле убакытта денеге же бир мүчөгө толугу менен атыр себүү же майлоо, боёнуу же чач боёо, кына сүртүнүү. Эмдөө үчүн жытсыз май сүртсө, жаза талап кылынбайт; \n• Бир жерде жана бир эле убакытта бардык тырмактарын же бир колдун же бир буттун тырмактарын алуу. Эгерде бир жерде жана бир убакытта эмес, айрым-айрым жер жана убакыттарда тырмактар алынса ар бир тырмак үчүн садака берилет. \n• Ихрамдуу абалда жубайы менен кумар сезими козголо өбүшүү кучакташуу сыяктуу аракеттерди жасоо; \n• Эркектер тигилген кийимди толук бир күн же толук бир түн бою кийип жүрүүсү. Мисалы, чапан, шым, байпак, ич кийим, кончтуу бут кийим сыяктуулар. Башты жаап алуусу, же бетин жабуусу да жаза талап кылат. Аялдар тек гана беттерин жаппайт. Бир түн же бир күн мезгилинен аз убакыт кийим кийилсе садака берилет;  Ихрам тыюулары ар кандай себептер менен жасалса да жаза өтөлөт. Ооруп калуу, жол кырсыгына кабылуу сыяктуу адамдын эркинен тыш себептерден улам тыюулар бузулса, мисалы, чачы алынса же кийим кийдирилсе, төмөндөгү үч түрдүү арганын бирөөнү аткаруу менен жаза өтөөгө эрктүү: 1)Каалаган убакытта жана жерде үч күн орозо кармоо;  2)Алты кедейге Фитр садакасынын өлчөмүндө садака берүү;  3) Харам чөлкөмүндө каалаган убактысында бир кой же бир эчкини курмандыкка чалуу.  '),
  AboutModel(
      title:
          'Фитир садакасынын өлчөмүндө садака берүүнү талап кылган кемчиликтер',
      description:
          ' • Чач-сакалдарын төрттөн биринен аз өлчөмдө алуу же кыркуу;  \n• Бир мүчөнүн бир аз бөлүгүнө атыр себүү;  \n• Бир бут же бир колдун тырмактарынын кээ бирөөсүн алуу; \n • Тигилген кийимди бир күн же бир түндөн аз убакыт кийүү; \n • Башка бирөөнүн чачын, сакалын же мурутун алуу же кыркуу;\n •Шайтан ташка  белгиленгенден аз санда таш ыргытуу.Ар бир ыргытылчу таш  үчүн фитир садагасынын өлчөмүндө садага берилет; \n•Кудум жана вадаа тавабтарын  даратсыз аткаруу; '),
  AboutModel(
      title:
          'Фитир садакасынынан аз өлчөмдө садака берүүнү талап кылган кемчиликтер',
      description:
          '•Ихрамдуу адамдын үчтөн аз чегирткени ,бүргөнү же бит сыяктуу жандыктарды өлтүрүүсү,кармап ыргытуусу же башка бирөөнө өлтүрү үчүн көрсөтүп коюсу; \n•Денеден түк жулуу; •Ихрамсыз адамдын тырмагын же мурутун алып коюу; \n•Нафил тавабта аурат мүчөсүнүн ачык калуусу; ')
];
