import 'package:beyish_jolu/features/main/domain/models/fine_model.dart';

final List<AboutModel> preparationModel1 = [
  AboutModel(
      title: "1.Ихрам",
      description: ' Мийкат чегине келип жуунуп, таранып, ихрамга кирилет. '),
  AboutModel(
      title: "2.Ниет кылуу",
      description:
          'Ажыны гана ниет кылган адам Меккеге кирген соң даарат алат жана Каабаны көрөр замат такбир жана тахлил (Аллаху Акбар жана Лаа илааха иллал-лооху) айтат. Анан Каабаны таваф кылат. Бул таваф айлана-чөйрөдөн келгендер үчүн сүннөт болуп эсептелет. Ал эми Мийкаттын сыртынан келгендер үчүн учурашуу тавафы болуп эсептелет. Меккенин эли үчүн учурашуу тавафы болбойт. '),
  AboutModel(
      title: "3.Таваф",
      description:
          'Тавафты «Кара ташты» өбүү менен баштайт. Эгер өбүүгө мүмкүнчүлүк болбосо анда, эки алаканын ошол тарапка көтөрүп такбир жана тахлил айтат. Ташты өбүү жана сылоо үчүн башка бирөөлөргө зыян берип, түртүшүп-жөөлөшүүгө болбойт. Андан соң эшиктин тушунан сол тарабын Каабага каратып, оң кадамын алдыга таштап айланууну баштайт.'),
  AboutModel(
      title: "4. Таваф намазы",
      description:
          'Таваф кылып буткан соң, «Макоому Иброхим» деп аталган орундун артына туруп эки рекет намаз окуйт. (Бул орун алтын түстүү айнек идиштин арты). Бул намазды мечиттин ичинде кайсы жерде мүмкүнчүлүк болсо ошол жерде окуй берсе болот.'),
  AboutModel(
      title: "5.саьий кылуу ",
      description:
          'Ажы амалын аткаруучу Макааму Иброхимдин артында эки рекет намаз окугандан кийин, Сафага саьий кылууга барат барат. '),
  AboutModel(
      title: "6.Арафатка баруу",
      description:
          'Арафа күнү түш оогондо Арфатка барат. Ал жерде күн баткыча дуба кылат. Күн баткан соң Муздалифага жөнөйт.'),
  AboutModel(
      title: '7.Мина',
      description:
          'Ажы кылуучу адам бул убакта мухрим болюнча турат. Убакыл тапса Каабаны таваф кылат. Беш бак намазды Масжидул харамда окууга аракет кылат. Себеби бул жерде окулган намаздын бир рекети башка жердеги жүз миң рекет намазга барабар. Качан гана Тарвия күнү болгондо багымдат намазынан соң Минага барат.'),
  AboutModel(
      title: '8.Муздалифа',
      description:
          'Күн баткан соң Муздалифага жөнөйт. Түндү Муздалифада өткөрөт. Ошол жерден шайтанга атуучу таштарды чогултуп алуусу жакшы. Күн чыкканча кайра Минага келет. Ал  жерден шайтанга таш атууну баштайт. Алгач жети таш атат.'),
  AboutModel(
      title: '9.Чач алдыруу',
      description:
          'Муфрид адам Курбандык күнү таш аткан соң чачын алдырат же кыскартат. Чачын алдыруу же кыскартуудан кийин ихрамдан чыгат. Аял менен жыныастык катнашуудан башка баардык амалдар ага адал болот. Тагыраак айтканда тигилген кийим кийет, жыттуу мисктерди колдонот, тырмактарын алат, денесиндеги түктөрдү тазалайт.'),
  AboutModel(
      title: '10.Курбандык күнү',
      description:
          'Курбандык күндөрүнүн амалдарынан эми таваф кылуу калды башкача айтканда парз тавафты аткаруу керек.Тавафтын мөөнөтү үч күн. Айттын биринчи күнкүн чыккандан баштап, үчүнчү күнү күн батканча (айдын онунчу күнү күн чыккандан, он экинчи күнү күн батканча). Бирок онунчу күнү эле аткаруу жакшыраак. Бул тавафтан кийин аялга жакындашуу да адал болот.'),
  AboutModel(
      title: '11.Шайтанга таш атуу',
      description:
          'Минага келип шайтанга таш атат. Тагыраак айтканда, Он биринчи жана он экинчи күндөрү алгач Жамратул сугродо, анан Жамратул вустоодо, адан соң Жамратул кубродо таш атат. Аб бир атканда жети таш атат жана такбир, тахлил айтат.'),
  AboutModel(title: '12.Коштошуу тавафы аткарылат.', description: ''),
];
final List<AboutModel> preparationmodel2 = [
  AboutModel(
      title: '1. Ихрам',
      description: ' Мийкат чегине келип жуунуп, таранып, ихрамга кирилет. '),
  AboutModel(
      title: '2. Талбия айтуу',
      description:
          'Эки ирекет (биринчи ирекетинде “Кафируун” сүрөсүн, экинчи ирекетинде “Ихлас” сүрөсүн окуу абзел) ихрам намазын окуп, Аллахым! Мен өзүңдүн ыраазылыгың үчүн умра жасоого ниет кылдым. Умраны мага жеңилдете көр, аны менден кабыл ала көр!” деп ниет кылып, андан соң талбия айтат. '),
  AboutModel(
      title: '3. Таваф ',
      description:
          'Харам мечитине келген кезде «Аллахым! Сенин ыраазычылыгың үчүн умра тавафын жасоону ниет кылдым. Тавафты мага жеңилдете көр жана менден кабыл ала көр! деп тавафка ниет кылат да, андан кийин таваф кылынат.'),
  AboutModel(
      title: '4. Таваф намазы',
      description: 'Таваф кылып бүткөн соң 2 ирекет таваф намазы окулат. '),
  AboutModel(
      title: '5.Сайы',
      description:
          ' Андан соң  «Аллахым! Мен Өзүңдүн ыраазычылыгың үчүн умранын сайысын кылууну ниеттендим, сайыны мага жеңилдете көр, менден кабыл ала көр!» деп ниет кылган соң. Сафаа менен Марва дөбөлөрүнүн арасында 4 ирет барыш, үч ирет келиш жолу менен жалпы 7 каттам сайыны аткарат. '),
  AboutModel(
      title: '6. Чач алдыруу же кырктыруу',
      description:
          ' Сайыдан кийин чач алдыруу же кырктыруу менен ихрамдан чыгат. Мына бул бир умранын аткарылып бүтүшү. Умранын ажылыктан айырмасы - Арафат, Муздалифа, Минада жасалчу ибадаттар жана Кудум, Вадаа (келүү жана коштошуу) таватары умрада аткарылбайт. Курман айт күндөрүнөн башка ар кандай убакытта умранын аткарылуусу дурус болушу – умранын өзгөчөлүгү болуп саналат'),
];

final List<AboutModel> preparationmodel3 = [
  AboutModel(
      title:
          'Төмөндөгү маселелердин сыртында, аялдар ажылык менен умра ибадаттарын эркектер менен бирдей эле ыкмада аткарат ',
      description:
          ' 1.Аялдар ихрамдуу мезгилдеринде демейкидей эле кийине беришет жана байпак, колкап, кончтуу бут кийим сыяктуу ар кандай кийимдерди кийүүгө да эрктүү. Башын жабуусу керек, бирок бетин жаппайт.  \n2. Талбия-такбир, дуба-зикирлерди айтканда үнүн көтөрбөйт.\n3.Тавафта «Изтибаа» (эркектер кездеменин бир учун оң колтуктун алдынан өткөрүп, сол далысынын үстүнө таштаган абалы) жана “Рамал” (кыска кадам таштап, бой көтөргөнсүп ылдам басуу) жасабайт, сайыда жортуп жүгүрбөйт. \n4. Ихрамдан чыгуу үчүн чачын кырдырып алдырбайт. Тек гана чачынын учунан бир элидей кырктырса болот. \n5.Хажарул-асваддын жанында эркектер бар болсо аралаша кысталбастан, алысыраактан эле Хажарул-асвадга салам берип кол жаңсайт. \n6.Этек кир же нифас абалы болсо таваф жасоодон оолак болуп турат. Умранын башталышындагы шарт катары, ихрам умранын эң биринчи парзы болуп саналат')
];
final List<AboutModel> preparationmodel4 = [
  AboutModel(
      title: 'Ихрам тыйымдары',
      description:
          'Ихрамга кирген адам үчүн тыюу салынган нерселер "ихрам тыйымдары" - деп аталат. Бул тыйымдардын түрү боюнча төмөнкүчө топторго бөлүшүбүз мүмкүн: '),
  AboutModel(
      title: '1. Ихрамдуу адамдын дене-боюна байланыштуу тыйылган нерселер',
      description:
          'Чач-сакалын, мурутун алуу же кыркуу; \n• Денесинин ар кандай жериндеги түктөрдү жулуу же кыркуу; \n• Тырмак алуу;  \n• Жасануу үчүн чач-сакал, муруттарды боёо же аларга май сыйпоо, чач майлоо.  \n• Денеге же ихрамдык кийимге атыр сыяктуу жыпар жыттуу нерселерди сүртүү, атыр самын колдонуу; \n• Аялдардын ap кандай косметикалык каражаттарды колдонуулары;'),
  AboutModel(
      title: '2. Кийим-кечеге байланыштуу тыюулар',
      description:
          '• Тигилген кийим кийүү. Тигилген кийимдерди сууктан үшүгөндөн улам үстүнө жамынууга уруксат. Бирок жеңин кийип, топчуланууга болбойт. Ихрамдык кийимдер катары денеге оролуучу Изар менен Риданын четтери ачылып калбасын үчүн төөнөп алса же жыртылган жерин жамаса уруксат. Акча салуу үчүн ар кандай материалдардан тигилген капчык, белкур курчанууга, ийинге сумка асынууга уруксат. Ошондой эле күн нурунан, жайдын саратан ысыгынан коргонуу үчүн тигиши бар кол чатырларды колдонууга болот.\n• Башты же бетти жабууга, баш кийим кийүүгө, селде оронууга болбойт. \n• Колкап, байпак жана кызыл ашыктарды жаап турчу бут кийимдерди кийүүгө тыюу салынат. Кийимге байланыштуу тыюулар тек гана эркектер үчүн. Ал эми аялдар болсо демейдеги кийимдери менен жүрө беришет, бирок демейде жүздөрүн жаап жүргөн аялзаты болсо ихрамдуу мезгил ичинде беттерин жабууга тыюу салынат. 3. Харам чөлкөмүнө байланыштуу тыюулар: \n• Мекке шаары менен анын айланасындагы "харам" деп аталган аймактын жапайы аңдарын уулоо, өсүмдүктөрүн жулуу же кесип-кыркуу ихрамдуу ихрамсыз адамдардын бардыгына карата харам, тагыраак айтканда, буларга бирдей тыюу салынган.'),
  AboutModel(
      title: ' 4. Жыныстык катнашка байланыштуу тыюулар ',
      description:
          ' Ихрамдуу адам үчүн жыныстык байланыш жана жыныстык байланышка түрткөн өбүшүү, ойноо, кучакташуу, жалпысынан дене кумарды козгоочу ар кандай аракеттер жана сөздөргө тыюу салынат.'),
  AboutModel(
      title:
          '5. Жалпы күнөөлүү иштер жана башкалардын укугуна байланыштуу тыюулар ',
      description:
          '• Динибизде күнөө болуп эсептелген ар кандай харам иш аракеттерди жасоого тыюу салынат.\n• Талаш-тартыш кылуу, башкалар менен урушуп сөгүшүү, сөгүнүү, башкаларга жаман сөз айтуу, иренжитүүгө болбойт. Дегеле жалпы мусулмандарга тескери таасир берүүчү ар кандай сөз-аракеттерден, ихрамдуу адам такыр алыс болуусу зарыл.  \n• Харам аймагында болсун же анын сыртындагы чөлкөмдөрдө болсун, ихрамдуу адамдын ар кандай жапайы жана жаныбарларды уулоосу, аңчыларга көрсөтүүсү, аң уулаган адамга жардам берүүсү жана жаныбарларга зыян жеткизүүгө, үркүтүүгө тыюу салынат. Ихрамдууларга уруксат болгон иштер:\n• Көлөкөдө туруп эс алуу же кол чатыр колдонуу; \n• Ихрамдык кийимдерди жууш же аларды которуу: \n• Жуунуу жана жытсыз самын колдонуу; • Тиш пастасы менен тиштерди жууш жана көзгө сурма тартуу;  \n• Тиш жулдуруу, кан алдыруу, ийне сайдыруу, жаранын үстүнөн таңуу менен ороо;  \n• Өздүгүнөн сынган тырмакты жулуу; \n• Бычак сыяктуу нерселерди жанында бирге ала жүрүү жана билерик, шакек, сырга жана кол саат тагынуу; \n• Кур курчануу, ийинге сумка асынуу;\n• Гүлдү же мөмө-жемишти жыттоо; \n• Жыпар жыттуу нерселерди сатуучу дүкөнгө кирүү же атыр сатып алуу. Бирок аны ихрамдан чыкмайынча колдонууга болбойт.\n• Башын жана бетин жаппастан денесин жууркан, одеяло сыяктуу нерселер менен ороп жамынуу; \n• Колун жеңдерине салбастан пальто же чапан сыяктуу тигилген кийимдерди жамынуу; \n• Денедеги түктөрдү жулбоо шарты менен кашынып-тырмануу; \n• Жылан-чаян сыяктуу зыяндуу жандыктарды өлтүрүү.'),
];
