class SectionModel {
  final String title;
  final List<DuaModel> duas;

  SectionModel({
    required this.title,
    required this.duas,
  });
}

class DuaModel {
  final String subtitle;
  final String arabicText;
  final String transliteration;
  final String translation;

  DuaModel({
    required this.subtitle,
    required this.arabicText,
    required this.transliteration,
    required this.translation,
  });
}

final List<SectionModel> sections = [
  SectionModel(
    title: 'Мекке бөлүмү',
    duas: [
      DuaModel(
        subtitle: 'Сапарга аттануунун дуасы',
        arabicText:
            'بِسْمِ اللَّهِ تَوَكَّلْتُ عَلَى اللَّهِ، لَا حَوْلَ وَلَا قُوَّةَ إِلَّا بِاللَّهِ',
        transliteration:
            'Бисмиллахи таваккалту аълаллохи лаа хавла ва лаа куввата илла биллахи.',
        translation:
            'Мен Аллахтын ысымы менен сапарга чыгып жатам жана Аллахка гана тобокел кылдым',
      ),
      DuaModel(
        subtitle:
            'Аба учагына отурганда же башка унааларга отурганда окулуучу дуа',
        arabicText:
            'سُبْحَانَ الَّذِي سَخَّرَ لَنَا هَـٰذَا وَمَا كُنَّا لَهُ مُقْرِنِينَ وَإِنَّا إِلَىٰ رَبِّنَا لَمُنقَلِبُونَ',
        transliteration:
            'Субхааналлазии саххоро ланаа хаазаа ва маа куннаа лаху мукриниин ва иннаа илаа роббинаа ламуңколибуун.',
        translation:
            'Аллах таала бардык кемчилик,айыптардан таза Зат. Ал Зат аны бизге өзүбүздүн ыктыярыбызга берди.Биз баш ийдире албаган бул унааны бизге баш ийдирип койду. Албетте, биз Роббибизге кайтып баруучубуз.',
      ),
      DuaModel(
        subtitle: 'Сапар учурунда окуулучу дуа',
        arabicText:
            'اللَّهُمَّ هوِّنْ عَلَيْنَا سَفَرَنَا هَذَا وَطَوِّ عَنَّا بُعْدَهُ اللَّهُمَّ أَنْتَ الصَّاحِبُ فِي السَّفَرِ وَالْخَلِيفَةُ فِي الْأَهْلِ اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ وَعَاءِ السَّفَرِ وَكَآبَةِ الْمَنْظَرِ وَسُوءِ الْمُنْقَلَبِ فِي الْمَالِ وَالْأَهْلِ',
        transliteration:
            "Аллоохумма хаввин аълайнаа сафа-ранаа хазаа ватви аъннаа буъдаху аллоохумма антас соохибу фис сафари,вал холиифату фил ахли аллохумма иннии аъуузу бика мин ва’аъаис сафари ва ка'аабатил манзари, ва суу'ил муңколаби фил маали вал ахли.",
        translation:
            'Оо Аллахым! Бул сапарыбызды жеңил кылып узакты жакын кыл. Оо Аллахым! Cен гана сапарда бизге шериксиң, Cен гана биздин артыбызда калган үй-бүлө, балдарыбызды сактоочусуң. Оо Аллахым! Мен Cенден сапардын машакатынан, кыжаалат кыла турган көрүнүштөн жана үй-бүлөнүн алдына жаман абалда кайтып баруудан паана тилеймин!',
      ),
      DuaModel(
        subtitle: ' Ажылыктын ихрамын байлап жаткан убакта окулуучу дуа',
        arabicText:
            'اللَّهُمَّ إِنِّي أُرِيدُ الْحَجَّ فَيَسِّرْهُ لِي وَتَقَبَّلْهُ مِنِّي',
        transliteration:
            'Аллохумма иннии урийду-л хажжа фаяссир-ху-ли ва такоббал ху миннии.',
        translation:
            'Оо Аллахым! Мен ажылыкты ниет кылып жатам, аны мага жеңил кылып кабыл кыл! ',
      ),
      DuaModel(
        subtitle:
            'Умра же таматтуъ ажылыгынын ихрамын байлап жаткан убакта окулуучу дуа',
        arabicText:
            'اللَّهُمَّ إِنِّي أُرِيدُ الْعُمْرَةَ فَيَسِّرْهَا لِي وَتَقَبَّلْهَا مِنِّي',
        transliteration:
            'Аллохумма иннии урийду-л умрата фаяссир-ху-ли ва такоббал ху миннии.',
        translation:
            'Оо Аллахым! Мен умраны ниет кылып жатам, аны мага жеңил кылып кабыл кыл!',
      ),
      DuaModel(
        subtitle: 'Кирон ажылыгынын ихрамын байлап жаткан убакта окулуучу дуа',
        arabicText:
            'اللَّهُمَّ إِنِّي أُرِيدُ الْعُمْرَةَ وَالْحَجَّ فَيَسِّرْهُمَا لِي وَتَقَبَّلْهُمَا مِنِّي',
        transliteration:
            'Аллохумма иннии урийду-л умрата ва-л хажжа фаяссир-ху-ли ва такоббал ху миннии',
        translation:
            'Оо Аллахым! Мен умраны жана ажылыкты ниет кылып жатам, аны мага жеңил кылып кабыл кыл!',
      ),
      DuaModel(
        subtitle: 'Харамдын чегине киргенде окулуучу дуа',
        arabicText:
            'اللَّهُمَّ إِنَّ هَذَا حَرَامُكَ وَحَرَامُ رَسُولِكَ فَحَرِّمْ لَحْمِي وَدَمِي وَعَظْمِي وَبَشَرِي عَلَى النَّارِ، اللَّهُمَّ آمِنِّي مِنْ عَذَابِكَ يَوْمَ تَبْعَثُ عِبَادَكَ',
        transliteration:
            'Аллохумма инна хаза харамук ва харому росуулик фа харрим лахмии ва дамии ва ъазмии ва башарии ъала-н наар,аллохумма ааминнии мин аъзаабика явма табъасу иъбаадак.',
        translation:
            'Оо Аллахым! Шек күмөнү жок бул сенин жана Пайгамбарыңдын Харамы. Менин этим, каным, сөөгүм жана теримди тозок отуна арам кыл. Оо Аллахым! Пенделериңди кайра тирилте турган күндө азабыңдан мени сактагын! ',
      ),
      DuaModel(
        subtitle: 'Харам мечитине кирип жатканда окулуучу дуа',
        arabicText:
            'بِسْمِ اللَّهِ وَالصَّلَاةُ وَالسَّلَامُ عَلَى رَسُولِ اللَّهِ، اللَّهُمَّ اغْفِرْ لِي ذُنُوبِي وَافْتَحْ لِي أَبْوَابَ رَحْمَتِكَ',
        transliteration:
            'Бисмиллахи ва-с солаату ва-с саламу ъалаа росуулиллахи аллохума игфир лии зунуубии ва ифтах лии абвааба рохматик.',
        translation:
            'Алланын аты менен киремин. Алланын элчисине салам салаваттар болсун! Оо Аллахым! Мени күнөөлөрүмдү кечирип мен үчүн Өзүңдүн рахмат эшиктериңди ач!',
      ),
      DuaModel(
        subtitle: 'Каабаны биринчи жолу көргөндө окула турган дуа',
        arabicText:
            'اللَّهُمَّ أَنْتَ السَّلَامُ وَمِنْكَ السَّلَامُ، فَحَيِّنَا بِالسَّلَامِ، اللَّهُمَّ زِدْ بَيْتَكَ هَذَا تَعْظِيمًا وَتَشْرِيفًا، وَتَكْرِيمًا وَتَعْظِيمًا وَبِرًّا',
        transliteration:
            'Аллоохумма аңта-с салаам ва минка-с салаам фа хаййинаа бис-салаам аллохумма зид байтака хазаа таъзииман ва ташриифан,ва такрииман ва таъзииман ва бирроо.',
        translation:
            'Оо Аллахым! Сен дайыма саламат болуучусуң. Саламаттык Сенин тарабыңдан болот. Оо Аллахым!Бизди саламаттуулук менен жашоо кечиртир. Оо Аллахым! Өзүңдүн бул үйүңдүн урмат-сыйын,улуулугун жана сүрүн көбөйткүн. Жана ким ага ажылык жана умра кылган болсо,анын да урмат-сыйын, улуулугун жана жакшылыгын көбөйткүн.',
      ),
      DuaModel(
        subtitle: ' Мултазамда окулуучу дуа',
        arabicText:
            'اللَّهُمَّ إِنَّ هَذَا بَيْتُكَ الَّذِي جَعَلْتَهُ مُبَارَكًا وَهُدًى لِلْعَالَمِينَ، اللَّهُمَّ كَمَا هَدَيْتَنِي لَهُ فَتَقَبَّلْ مِنِّي، وَلَا تَجْعَلْ آخِرَ عَهْدِي مِنْ بَيْتِكَ وَارْزُقْنِي الْعَوْدَةَ إِلَيْهِ حَتَّى تَرْضَى عَنِّي بِرَحْمَتِكَ يَا أَرْحَمَ الرَّاحِمِينَ.',
        transliteration:
            'Аллохумма инна хаза байтука-л лазии жа’аълтаху мубаарокан ва худан лил-аъааламиин. Аллохумма камаа хадайтании лахуу фатакоббал миннии ва лаа таж’аъл хаза аахиро-л аъхди мин байтика ва-р зукния-л аъвдата илайъхи хатта тардоо аъннии бирохматика яаа ар-хамар роохимиин.',
        translation:
            'Оо Аллахым! Бул- Сен берекелүү кылган жана ааламга хидаят кылган үйүң. Оо Аллахым! Өзүң мага ажылыкты насип кылгандай, аны менден кабыл кыл! Мен үчүн бул сапарды үйүңө кылган акыркы учурашуу кылбагын. Менден ыраазы болгонго чейин кайта-кайта келүүнү насип кылгын. Оо Мээримдүүлөрдүн Мээримдүүсү! Өзүңдүн Мээримиң менен менин дубамды кабыл кылгын! ',
      ),
      DuaModel(
        subtitle: 'Рахмат мийзабтын астында окулуучу дуа',
        arabicText:
            'اللَّهُمَّ إِنِّي أَسْأَلُكَ إِيمَانًا لَا يَزُولُ وَيَقِينًا لَا يَنْفَدُ وَمُرَافَقَةَ نَبِيِّكَ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ. اللَّهُمَّ أَظِلَّنِي تَحْتَ ظِلِّ عَرْشِكَ يَوْمَ لَا ظِلَّ إِلَّا ظِلُّ عَرْشِكَ وَاسْقِنِي بِكَأْسِ مُحَمَّدٍ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ شَرْبَةً لَا أَظْمَأُ بَعْدَهَا أَبَدًا.',
        transliteration:
            'Аллохумма иннии ас-алука иимаанан лаа язуулу ва якиинан лаа янфаду ва муроофакота набаййика соллолоху алайхи ва салам.Аллохумма азиллании тахта зилли аършика явма ла зилла илла зиллу аършика ва аскинии би ка-си мухаммадин соллоллоху алайхи ва саллама шарбатан лаа азмау баъдахаа абадан.',
        translation:
            'Оо Аллахым! Сенден эч качан менден ажырабай турган ыйман, түгөнүп бүтпөс ишенич жана Пайгамбарың Мухаммад (с.а.в) менен бирге болууну сураймын. Аршыңдын көлөкөсүнөн башка көлөкө жок күнү мени Аршыңдын көлөкөсүнүн астында кыл! Мухаммад(с.а.в)дын идиши менен мени андан кийин эч качан чаңкабай тургандай кылып сугаргын! ',
      ),
    ],
  ),
  SectionModel(
    title: 'Таваф бөлүмү',
    duas: [
      DuaModel(
        subtitle: 'Таваф кылып баштаганда окуулучу дуа',
        arabicText:
            'بِسْمِ اللَّهِ اللَّهُ أَكْبَرُ وَلِلَّهِ الْحَمْدُ وَالصَّلَاةُ وَالسَّلَامُ عَلَى رَسُولِ اللَّهِ، اللَّهُمَّ إِيمَانًا بِكَ وَتَصْدِيقًا بِكِتَابِكَ وَوَفَاءً بِعَهْدِكَ وَاتِّبَاعًا لِسُنَّةِ نَبِيِّكَ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ',
        transliteration:
            'Бисмиллах Аллоху акбар ва лиллахил хамд вассолаату вас салааму ъалаа росуулиллах. Аллохумма иимаанан бика ва тасдиикон би китаабика ва вафаа-ан би ъахдика ва иттибааъан ли суннати набиййика саллаллаху алайхи ва саллам.',
        translation:
            ' Алланын аты менен тавафты(баштаймын). Аллах Улук! Бардык алкыш мактоолор Аллага гана таандык. Салам салаваттар Алланын элчисине болсун! Оо Аллахым! Мен сага ыйман келтирип,сенин китебиңди тастыктап, Сага берген убаданы аткарып, Пайгамбарың Мухаммад ъалайхис саламдын сүннөтүн ээрчиген абалда бул тавафты баштаймын! ',
      ),
      DuaModel(
        subtitle: ' Биринчи айлануунун дуасы',
        arabicText:
            'بِسْمِ اللهِ اَللهُ أَكْبَرُ، اَللّٰهُمَّ إِيمَانًا بِكَ ، وَ تَصْدِيقًا بِكِتَابِكَ ، وَ وَفَاءً بِعَهْدِكَ ، وَاتِّبَاعًا لِسُنَّةِ نَبِيِّكَ سُبْحَانَ اللهِ ، وَالْحَمْدُ لِلهِ ، وَلَٓا إِلٰهَ إِلَّا اللهُ ، وَاللهُ أَكْبَرُ ، وَلَا حَوْلَ وَلَا قُوَّةَ إِلَّا بِاللهِ الْعَلِيِّ الْعَظِيمِ. وَالصَّلَاةُ وَالسَّلَامُ عَلٰى سَيِّدِنَا مُحَمَّدٍ وَ عَلٰى آلِهِ وَ صَحْبِهِ أَجْمَعِينَ. رَبَّنَا تَقَبَّلْ مِنَّا إِنَّكَ أَنْتَ السَّمِيعُ الْعَلِيمُ. رَبَّنَا وَاجْعَلْنَا مُسْلِمَيْنِ لَكَ وَ مِنْ ذُرِّيَّتِنَا أُمَّةً مُسْلِمَةً لَكَ ، وَ أَرِنَا مَنَاسِكَنَا وَ تُبْ عَلَيْنَا إِنَّكَ أَنْتَ التَّوَّابُ الرَّحِيمُ. اَللّٰهُمَّ اجْعَلْهُ سَعْيًا مَشْكُورًا ، وَ ذَنْبًا مَغْفُورًا ، وَ عَمَلًا صَالِحًا مَقْبُولًا ، وَ تِجَارَةً لَنْ تَبُورَ. اَللّٰهُمَّ إِنَّكَ دَعَوْتَ عِبَادَكَ إِلٰى بَيْتِكَ الْحَرَامِ ، وَ قَدْ جِئْتُ طَالِبًا مَرْضَاتَكَ ، وَ أَنْتَ مَنَنْتَ عَلَيَّ بِذَلِكَ ، فَاغْفِرْ لِي وَ ارْحَمْنِي وَعَافِنِي وَاعْفُ عَنِّي ، إِنَّكَ عَلٰى كُلِّ شَيْءٍ قَدِيرٌ. اَللّٰهُمَّ إِنِّي عَبْدُكَ وَ زَائِرُكَ وَ لِكُلِّ زَائِرٍ حَقٌّ عَلٰى مَزُورٍ وَ أَنْتَ خَيْرُ مَزُورٍ ، فَأَسْأَلُكَ أَنْ تَغْفِرَ لِي ، وَ تَرْحَمَنِي ، وَ تَفُكَّ رَقَبَتِي مِنَ النَّارِ. رَبَّنَٓا اٰتِنَا فِي الدُّنْيَا حَسَنَةً وَ فِي الْاٰخِرَةِ حَسَنَةً وَ قِنَا عَذَابَ النَّارِ ، وَ أَدْخِلْنَا الْجَنَّةَ مَعَ الْأَبْرَارِ ، يَا عَزِيزُ يَا غَفَّارُ يَا رَبَّ الْعَالَمِينَ.',
        transliteration:
            'Бисмиллахи Аллаху Акбар, аллохумма иимаанан бика, ва тасдиикан бикитаабика,ва вафаа-ан биъаҳдика, ва иттибааъан лисуннати набийика. Субханалла,вал-хамду лиллахи, ва ла илаха иллалла, валлаху акбар, ва ла хавла ва ла куввата илла биллахил ъалийил ъазиим. Вас-салаату вас-салааму ъалаа саййидина Мухаммад ва ъалаа алиҳи ва сахбихи ажмаъин. Раббана такаббал миннаа иннака антас-самиъул ъалим. Раббана важъалнаа муслимайни лака ва мин зуррийяатинаа умматан муслиматан лака ва аринаа манасиканаа ва туб ъалайнаа иннака антат-таввабур-рахиим. Аллохумма ижъалху са’аъйан машкуран, ва занбан магфууран, ва ъамалан саалихан макбуулан, ва тижааратан лан табур. Аллохумма иннака да’аъвта ъибадака ила байтикал-хараам, ва код жи’ту тоолибан мардоотик, ва анта мананта ъалайа бизалика, фагфир ли вархамни ва ъафини ва’аъфу ъанни, иннака ъала кулли шайин кодир. Аллохумма инни ъабдука ва заа’ирукa ва ликулли заа’ирин хаккун ъала мазуурин, ва анта хайру мазуурин, фа ас’алука ан тагфира ли, ва тархамани, ва тафукка рокабати минан-наар. Раббана аатини фид-дунйа хасанатан ва фил-ахирати хасанатан ва кынаа ъазабан-наар, ва адхылнаа ал-жанната маъал-абраар, яа ъазиизу яа гаффаару яа роббал-ъааламиин. ',
        translation:
            'Аллах Таала бардык айыптардан таза.Бардык мактоолор Аллахка  гана болсун! Аллахтан башка ибадатка татыктуу Зат жок! Аллах Таала- баарынан Улуу Зат! Күнөөдөн сактанууга жана моюн сунууга күч кубат бир гана Алланын жардамы менен гана болот. Салам салаваттар Алланын элчисине болсун. Оо Аллахым! Мен сага ыйман келтирген, Сенин китебиңди тастыктаган, Сага берген убаданы аткарган жана Пайгамбарың Мухаммад ъалайхис саламдын сүннөтүнө ылайык бул тавафты баштаймын! Оо Аллахым! Мен Сенден динимде,дүйнөмдө акыретимде кечирим, аманчылык жана бейишке жетүүнү, тозоктон сактоону сураймын! Оо Аллахым!  Бизди Өзүңө ибадат кылуучулардан кыл. Урпактарыбызды да ибадатка бекем кыл. Тооболорубузду кабыл кыл. Сен Мээримдүү жана Даанышмансың. Оо Аллахым! Мээнетибизди текке кетирбегин, күнөөлөрүбүздү кечир, жакшы амалдарыбызды кабыл кылгын.Оо  Аллахым!Пенделериңди ыйык жерге чакырдың. Сенин ыраазычылыгыңды сураганы келдим. Сен мага бул мүмкүнчүлүктү бердиң. Мени кечир, мага ырайым кыл, ден соолук бер жана тозок отунан сакта. ',
      ),
      DuaModel(
        subtitle: '  Рүкүн Яаминийден Хажар Асвад ортосундагы дуа',
        arabicText:
            'اللَّهُمَّ إِنِّي أَسْأَلُكَ الْعَفْوَ وَالْعَافِيَةَ فِي الدُّنْيَا وَالْآخِرَةِ. رَبَّنَا آتِنَا فِي الدُّنْيَا حَسَنَةً وَفِي الْآخِرَةِ حَسَنَةً وَقِنَا عَذَابَ النَّارِ وَادْخِلْنَا الْجَنَّةَ مَعَ الْأَبْرَارِ يَا عَزِيزُ يَا غَفَّارُ يَا رَبَّ الْعَالَمِينَ',
        transliteration:
            'Аллохумма иннии ас-алука-л ъафва ва-л ъаафията фид дунйа ва-л аахироти. Роббанаа аатинаа фи-д дунйа хасанатан ва фил-аахироти хасанатан ва кынаа аъзаабан наар ва адхылнаа-л жанната маъал аброор яаа ъазиизу яаа гоффар яаа роббал ъааламин.',
        translation:
            'Оо Аллахым! Сен мага дүйнө-акыретте кечирип, амандык берүүңдү сураймын. Оо, биздин Роббибиз! Бизге дүйнөдө да, акыретте да жакшылык берип бизди тозок азабынан сакта! Оо, Бүткүл ааламдын Роббиси! Бизди жакшы адамдар менен бирге Бейишке киргиз! ',
      ),
      DuaModel(
        subtitle: 'Экинчи айлануунун дуасы',
        arabicText:
            'بِسْمِ اللهِ اَللهُ أَكْبَرُ، اَللّٰهُمَّ إِيمَانًا بِكَ ، وَ تَصْدِيقًا بِكِتَابِكَ ، وَ وَفَاءً بِعَهْدِكَ ، وَاتِّبَاعًا لِسُنَّةِ نَبِيِّكَ. سُبْحَانَ اللهِ ، وَالْحَمْدُ لِلهِ ، وَلَٓا إِلٰهَ إِلَّا اللهُ ، وَاللهُ أَكْبَرُ وَلَا حَوْلَ وَلَا قُوَّةَ إِلَّا بِاللهِ الْعَلِيِّ الْعَظِيمِ. وَالصَّلَاةُ وَالسَّلَامُ عَلٰى سَيِّدِنَا مُحَمَّدٍ وَ عَلٰى آلِهِ وَ صَحْبِهِ أَجْمَعِينَ. رَبِّ اشْرَحْ لِي صَدْرِي وَ يَسِّرْ لِي أَمْرِي. رَبِّ إِنِّي ظَلَمْتُ نَفْسِي فَاغْفِرْ لِي. لَٓا إِلٰهَ اِلَّٓا أَنْتَ سُبْحَانَكَۗ إِنِّي كُنْتُ مِنَ الظَّالِمِينَ. اَللّٰهُمَّ إِنَّ هٰذَا الْبَيْتَ بَيْتُكَ ، وَالْحَرَمَ حَرَمُكَ ، وَالْأَمْنَ أَمْنُكَ ، وَالْعَبْدَ عَبْدُكَ ، و أَنَا عَبْدُكَ وَابْنُ عَبْدِكَ ، أَتَيْتُكَ بِذُنُوبٍ كَثِيرَةٍ ، وَ أَعْمَالٍ سَيِّئَةٍ ، وَ هٰذَا مَقَامُ الْعَائِذِ بِكَ مِنَ النَّارِ ، فَحَرِّمْ لُحُومَنَا ، وَ بَشَرَتَنَا عَلَى النَّارِ ، إِنَّكَ أَنْتَ الْغَفُورُ الرَّحِيمُ. رَبِّ اغْفِرْ وَارْحَمْ وَ أَنْتَ خَيْرُ الرَّاحِمِينَ. رَبِّ زِدْنِي عِلْمًا و فَهْمًا وَ أَلْحِقْنِي بِالصَّالِحِينَ. اَللّٰهُمَّ حَبِّبْ إِلَيْنَا الْإِيمَانَ ، وَ زَيِّنْهُ فِي قُلُوبِنَا ، وَ كَرِّهْ إِلَيْنَا الْكُفْرَ وَالْفُسُوقَ وَالْعِصْيَانَ ، وَاجْعَلْنَا مِنَ الرَّاشِدِينَ. اَللّٰهُمَّ اجْعَلْهُ سَعْيًا مَشْكُورًا ، وَ ذَنْبًا مَغْفُورًا ، وَ عَمَلًا صَالِحًا مَقْبُولًا ، وَ تِجَارَةً لَنْ تَبُورَ. رَبَّنَٓا اٰتِنَا فِي الدُّنْيَا حَسَنَةً وَ فِي الْاٰخِرَةِ حَسَنَةً وَ قِنَا عَذَابَ النَّارِ وَ أَدْخِلْنَا الْجَنَّةَ مَعَ الْأَبْرَارِ يَا عَزِيزُ يَا غَفَّارُ يَا رَبَّ الْعَالَمِينَ',
        transliteration:
            " Бисмиллахи Аллаху акбар, аллахумма ииманан бика, ва тасдиикон бикитаабика, ва вафаа’ан биъахдика, ва иттибаа’ан ли-суннати набийика. Субхааналлах, ва л-хамду лиллаах, ва лаа илааха иллаллох, валлаху акбар, ва лаа хаула ва лаа куввата илла биллахи л-'алиййи л-'аъзим. Вас-солаату ва с-салааму ъалаа саййидинаа Мухаммадин ва ъалаа аалихи ва сохбихи ажма'ийин. Рабби ишрах ли садрии, ва йассир ли амрии. Рабби иннии заламту нафсии фагфир лии. Лаа илааха илла анта субхаанака, иннии кунту миназ-зоолимин. Аллохумма инна хаазал-байта байтука,вал-харама харамука, вал-амна амнука, вал-ъабда аъбдука, ва ана аъбдука ва бну  аъбдика, атайтука бизунубин касиратин, ва а‘аъмаалин сайи'атин, ва хааза макоому л-'аъаизи бика минан-наари, фахаррим лухуумана, ва башаратана ъалан-наари, иннака анта л-гафуру р-рахиим. Рабби гфир вархам,ва анта хайру р-рохимиин. Рабби зиднии  иълман ва фахман, ва алхикнии бис-соолихиин. Аллохумма хаббиб илайна л-иимана, ва заййинху фии кулуубинаа,ва каррих илайна л-куфро ва-л-фусууко ва-л-иъсйана, ва-ж’аълнаа минар-роошидиин. Аллохумма иж’аълху са’аъйан машкууран.",
        translation:
            " Аллах Таала бардык айыптардан таза.Бардык мактоолор Аллага  гана болсун! Алладан башка ибадатка татыктуу Зат жок. Алла Таала- баарынан Улуу Зат. Күнөөдөн сактанууга жана моюн сунууга күч кубат бир гана Алланын жардамы менен гана болот. Салам-салаваттар Алланын элчисине болсун.Оо Аллахым! Мен сага ыйман келтирип, китебиңди тастыктап, Сага берген убаданы аткарып, Пайгамбарың Мухаммад ъалайхис саламдын сүннөтүнө ээрчиген абалда бул тавафты баштаймын. Мага бейпилдик берип, ишимди жеңилдет. Аллахым! Мен көп күнөө кылдым, Сенден кечирим сурайм.Оо  Аллахым! Бул Сенин үйүң.Бул харам Сенин харамың. Бул жердин аманчылыгын Сен тургузгансың. Ар бир пенде Сенин пендең жана мен дагы Сенин алсыз пендеңмин жана бир алсыз пендеңдин баласымын. Бул жер- сенин жардамың менен тозок отунан паана суроочу жай. Эттерибизди, тээрилерибизди тозок отуна арам кылгын. Оо Аллахым! Бизге ыйманды сүйкүмдүү кылып,  жүрөктөрүбүздү ыймандын нуру менен нурланткын. Бизге адашууну,  фаасыктыкты жана күнөө иштерди жек көргөзүп койгун. Хидаят табуучу адамдардын катарында кылгын. Оо Аллахым! Пенделериңди кайта тирилте турган күндө азабыңдан сактагын. Оо Аллахым! Эсепсиз Бейишиңди бере көр! Оо Аллахым! Бизге бул дүйнөдө жана акыретте жакшылык бер.Бизди тозок азабынан сактап,бизди бейиште салихтер менен бирге кыл.Оо Аллахым! Оо Кудуреттүү Кечиримдүү Зат! Оо ааламдардын Раббиси!",
      ),
      DuaModel(
        subtitle: 'Үчүнчү айлануунун дуасы',
        arabicText:
            'بِسْمِ اللهِ اَللهُ أَكْبَرُ، اَللّٰهُمَّ إِيمَانًا بِكَ، وَ تَصْدِيقًا بِكِتَابِكَ ، وَ وَفَاءً بِعَهْدِكَ ، وَاتِّبَاعًا لِسُنَّةِ نَبِيِّكَ. سُبْحَانَ اللهِ ، وَالْحَمْدُ لِلهِ ، وَلَٓا إِلٰهَ إِلَّا اللهُ ، وَاللهُ أَكْبَرُ وَلَا حَوْلَ وَلَا قُوَّةَ إِلَّا بِاللهِ الْعَلِيِّ الْعَظِيمِ. وَالصَّلَاةُ وَالسَّلَامُ عَلٰى سَيِّدِنَا مُحَمَّدٍ وَ عَلٰى آلِهِ وَ صَحْبِهِ أَجْمَعِينَ. رَبَّنَا ظَلَمْنَٓا أَنْفُسَنَا وَإِنْ لَمْ تَغْفِرْ لَنَا وَ تَرْحَمْنَا لَنَكُونَنَّ مِنَ الْخَاسِرِينَ. رَبَّنَٓا إِنَّنَٓا اٰمَنَّا فَاغْفِرْ لَنَا وَارْحَمْنَا وَ أَنْتَ خَيْرُ الرَّاحِمِينَ. اَللّٰهُمَّ أَنْتَ رَبِّي لَٓا إِلٰهَ إِلَّا أَنْتَ خَلَقْتَنِي وَ أَنَا عَبْدُكَ وَ أَنَا عَلٰى عَهْدِكَ وَ وَعْدِكَ مَا اسْتَطَعْتُ ، أَعُوذُ بِكَ مِنْ شَرِّ مَا صَنَعْتُ ، أَبُوءُ لَكَ بِنِعْمَتِكَ عَلَيَّ ، وَ أَبُوءُ لَكَ بِذَنْبِي ، فَاغْفِرْ لِي فَإِنَّهُ لَا يَغْفِرُ الذُّنُوبَ إِلَّا أَنْتَ. اَللّٰهُمَّ إِنِّي أَعُوذُ بِكَ مِنَ الْخِيَانَةِ وَالْكُفْرِ وَالشِّرْكِ وَالشِّقَاقِ وَالنِّفَاقِ وَالرِّيَاءِ وَسُوءِ الْأَخْلَاقِ. اَللّٰهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ عِلْمٍ لَا يَنْفَعُ ، وَ مِنْ قَلْبٍ لَا يَخْشَعُ ، وَ مِنْ نَفْسٍ لَا تَشْبَعُ، وَ مِنْ عَيْنٍ لَا تَدْمَعُ ، وَ مِنْ دُعَاءٍ لَا يُسْتَجَابُ. اَللّٰهُمَّ اجْعَلْهُ سَعْيًا مَشْكُورًا ، وَ ذَنْبًا مَغْفُورًا، وَ عَمَلًا صَالِحًا مَقْبُولًا ، وَ تِجَارَةً لَنْ تَبُورَ. يَا عَالِمَ مَا فِي الصُّدُورِ ، أَخْرِجْنِي يَا اَللهُ مِنَ الظُّلُمَاتِ إِلَي النُّورِ. رَبَّنَٓا اٰتِنَا فِي الدُّنْيَا حَسَنَةً وَ فِي الْاٰخِرَةِ حَسَنَةً وَ قِنَا عَذَابَ النَّارِ وَ أَدْخِلْنَا الْجَنَّةَ مَعَ الْأَبْرَارِ يَا عَزِيزُ يَا غَفَّارُ يَا رَبَّ الْعَالَمِينَ.',
        transliteration:
            " Бисмиллахи аллаху акбару, аллахумма ииманан бика, ва тасдикон бикитаабика, ва вафаа’ан биъахдика, ва иттибаан ли-суннати набийика. Субханаллах, вал-хамду лиллахи, ва лаа илаха иллаллоху, валлоху акбар, ва лаа хаула ва лаа куввата илла биллахи л-аълиййи л-аъзиим. Вас-солаату ва с-саламу ъала саййидина Мухаммад ва ъалаа аалихи ва сахбихи ажмаъиин. Раббана заламна анфусана ва иллам тагфир ланаа ва тархамнаа ланакуунанна минал-хоосириин. Раббанаа иннаннаа ааманнаа фагфир ланаа ва р-рахамнаа ва 'анта хойру р-роохимиин. Аллохумма анта рабби лаа илааха илла анта холактании ва ана аъбдука ва ана аълаа аъхдика ва-ваъдика ма истатоъту,  ауъзу бика мин-шарри ма сонаъту,  абуу’у лака биниъматика аълайа,  абуу’у лака бизамбии,  фагфир лии фа'иннаху лаа ягфируз-зунууба илла анта. Аллохумма иннии ауъузу бика мин-хыяанати, вал-куфри,ваш-ширки,ваш-шикоокы, ван-нифаакы, вар-рийаа,вас-суу'ил-ахлаак. Аллохумма иннии ауъзу бика мин иълмин лаа янфауъ, ва мин колбин лаа яхшаъ, ва мин нафсин лаа ташбаъ, ва мин аъйнин лаа тадмаъ, ва мин дуаъа'ин ла юстажаабу. Аллохумма иж’аълху са’аъян машкуурон. Я аълиим ма фис- судуур, ахрижнии яа Аллах  миназ-зулумаати илан-нуур. Раббанаа аатина фид-дунйаа хасанатан ва фил-аахыроти хасанатан, ва кына аъзаабан-наари, ва адхылнаа  ал-жанната ма’аъл-абраари.Яа аъзиизу, Яа гоффаару, Яа Роббал-аъаламиин. ",
        translation:
            ' Аллах Таала бардык айыптардан таза,бардык мактоолор Аллахга  гана болсун! Аллахтан башка ибадатка татыктуу Зат жок. Аллах Таала- баарынан Улуу Зат. Күнөөдөн сактанууга жана моюн сунууга күч кубат бир гана Алланын жардамы менен гана болот. Алланын элчисине салам-салаваттар болсун.Оо  Аллахым! Мен сага ыйман келтирип,китебиңди тастыктап, Сага берген убаданы аткарып, Пайгамбарың Мухаммад ъалайхис саламдын сүннөтүнө ээрчип бул тавафты баштаймын. Оо Аллахым! Биз өзүбүзгө адилетсиздик кылдык. Эгерде Сен бизди кечирип бизге ырайым кылбасаң, анда биз кыйроого дуушар болобуз. Оо Аллахым! Ыйман келтирдик, бизди кечир, бизге ырайым кыл, Сен ырайымдуулардын эң ырайымдуусусуң. Аллахым, Сен менин Раббимсиң. Сенден башка кудай жок. Сен мени жараттың жана мен Сенин кулуңмун.Мени кечир, анткени Сенден башка эч ким күнөөлөрдү кечире  албайт. Оо Аллахым! Шек-күмөнгө түшүүдөн, ширктен, акмактыктан, эки жүздүүлүктөн,  жаман кулк мүнөздөн, кыжаалат кыла турган көрүнүштөн  жана үй-бүлө, балдардын алдына жаман абалда кайтып баруудан паана тилеймин. Тирүүлүктөгү жана жан берип жаткан учурдагы фитнадан жана дүйнө,акыретте кор болуудан паана сурайм. Оо Аллахым! Аракетибизди текке кетирбе, күнөөлөрүбүздү кечир,  амалдарыбызды женил кыл жана кабыл кыл. Бизге эч качан жоготууларды алып келбеген руханий сооданы бер.Оо баарын билүүчү Аллах!Бизди караңгылыктан жарыкка чыгар.Оо Аллахым! Бизге бул дүйнөдө жана акыретте жакшылык бер.Бизди тозок азабынан сакта. Бизди салихтер менен бирге бейишке киргиз. Оо кудуреттүү Зат! Оо Кечиримдүү! Оо ааламдардын Раббиси!',
      ),
      DuaModel(
        subtitle: '  Төртүнчү айлануунун дуасы',
        arabicText:
            'بِسْمِ اللهِ اَللهُ أَكْبَرُ، اَللّٰهُمَّ إِيمَانًا بِكَ ، وَ تَصْدِيقًا بِكِتَابِكَ ، وَ وَفَاءً بِعَهْدِكَ ، وَاتِّبَاعًا لِسُنَّةِ نَبِيِّكَ. سُبْحَانَ اللهِ ، وَالْحَمْدُ لِلهِ ، وَلَٓا إِلٰهَ إِلَّا اللهُ ، وَاللهُ أَكْبَرُ وَلَا حَوْلَ وَلَا قُوَّةَ إِلَّا بِاللهِ الْعَلِيِّ الْعَظِيمِ. وَالصَّلَاةُ وَالسَّلَامُ عَلٰى سَيِّدِنَا مُحَمَّدٍ وَ عَلٰى آلِهِ وَ صَحْبِهِ أَجْمَعِينَ. اَللّٰهُمَّ إِنِّي أَسْأَلُكَ مُوجِبَاتِ رَحْمَتِكَ ، وَ عَزَائِمَ مَغْفِرَتِكَ ، وَالسَّلَامَةَ مِنْ كُلِّ إِثْمٍ، وَالْغَنِيمَةَ مِنْ كُلِّ بِرٍّ ، وَالْفَوْزَ بالْجَنَّةِ ، وَالنَّجَاةَ مِنَ النَّارِ. رَبِّ قَنِّعْنِي بِمَا رَزَقْتَنِي ، وَ بَارِكْ لِي فِيمَا أَعْطَيْتَنِي ، وَاخْلُفْ عَلَيَّ كُلَّ غَائِبَةٍ لِي مِنْكَ بِخَيْرٍ. رَبَّنَا لَا تُؤَاخِذْنَٓا إِنْ نَسِينَٓا أَوْ أَخْطَأْنَا ، رَبَّنَا وَ لَا تَحْمِلْ عَلَيْنَٓا إِصْرًا كَمَا حَمَلْتَهُ عَلَى الَّذِينَ مِنْ قَبْلِنَا ، رَبَّنَا وَلَا تُحَمِّلْنَا مَا لَا طَاقَةَ لَنَا بِهِ ، وَاعْفُ عَنَّا وَاغْفِرْ لَنَا وَارْحَمْنَا ، أَنْتَ مَوْلٰينَا فَانْصُرْنَا عَلَى الْقَوْمِ الْكَافِرِينَ. اَللّٰهُمَّ طَهِّرْ قَلْبِي مِنَ النِّفَاقِ ، وَ عَمَلِي مِنَ الرِّيَاءِ ، وَ لِسَانِي مِنَ الْكَذِبِ ، وَ عَيْنِي مِنَ الْخِيَانَةِ ، فَإِنَّكَ تَعْلَمُ خَائِنَةَ الأَعْيُنِ وَ مَا تُخْفِي الصُّدُورُ. اَللّٰهُمَّ اهْدِنِي لِأَحْسَنِ الْأَعْمَالِ وَ أَحْسَنِ الْأَخْلَاقِ ، لَا يَهْدِي لِأَحْسَنِهَا إِلَّا أَنْتَ ، وَ قِنِي سَيِّءَ الْأَعْمَالِ وَ سَيِّءَ الْأَخْلَاقِ ، لَا يَقِي سَيِّئَهَا إِلَّا أَنْتَ. رَبَّنَٓا اٰتِنَا فِي الدُّنْيَا حَسَنَةً وَ فِي الْاٰخِرَةِ حَسَنَةً وَ قِنَا عَذَابَ النَّارِ وَ أَدْخِلْنَا الْجَنَّةَ مَعَ الْأَبْرَارِ يَا عَزِيزُ يَا غَفَّارُ يَا رَبَّ الْعَالَمِينَ.',
        transliteration:
            "Бисмиллахи аллаху акбару, аллахумма ииманан бика, ва тасдикон бикитаабика, ва вафаа’ан биъахдика, ва иттибаа’ан ли-суннати набийика. Субханаллах, вал-хамду лиллахи, ва лаа илаха иллаллоху, валлоху акбару, ва лаа хаула ва лаа куввата илла биллахил-аълийил-аъзиим. Вас-солаату вас-салааму аълаа сайидина Мухаммад ва аълаа аалиихи ва сахбихи ажмаиъин. Аллохумма иннии ас-’алука муужибаати рохматика,ва аъзааима магфиротика, вас-салаамата мин кулли исмин, вал-гониимата мин кулли биррин, вал-фавза бил-жанна, ван-нажаата минан-наар. Рабби канниъ’нии бима розактании, ва баарик лии фиимаа аътойтании, вахлуф аълайа кулла гоо’ибатин лии минка бихойрин. Раббана лаа туаахизнаа ин’насийнаа ау ахто’наа, раббанаа ва лаа тахмил аълайнаа исрон кама хамалтаху аълал-лазийна мин коблинаа, раббанаа ва лаа тухаммилнаа маа лаа тоокота ланаа бихи, ва’аъфу аъннаа вагфир ланаа вархамнаа, анта маулаанаа фансурнаа аълал-коумил-каафириин. Аллохумма тоххир колбии минан-нифаакы, ва аъмалии минар-рияа, ва лисаании минал-казиби, ва аъйнии минал-хыйанати, фа’иннака та’аъламу хоо’инатал-а’аъюн, ва ма тухфис-судуур. Аллохумма ихдинии ли-ахсанил-а’аъмали ва ахсанил-ахлааки, лаа яхдии ли-ахсанихаа илла анта, вакынии сайи-’ал-а’аъмали ва сайи’ал-ахлааки, лаа якыы сайи’ахаа илла анта. Роббанаа аатинаа фид-дунйа хасанатан ва фил-аахыроти хасанатан, ва кинаа аъзаабан-наари,ва адхылнаал-жанната ма’аъл-аброори. Яа Аъзиизу, Яа Гоффаару, Яа Роббал-аъаламиин. ",
        translation:
            'Аллах Таала кемчиликтен алыс. Аллахка мактоолор болсун. Аллахтан башка кудай жок. Аллах улук. Бардык күч жана күч Алла Таалага таандык. Пайгамбарыбыз Мухаммад(саллаллаху алейхи васаллам), анын үй-бүлөсүнө жана сахабаларына салам жана салаваттар болсун. Оо Аллахым! Мени Өзүңдүн ырайымыңа жеткир. Мага Сенин кечиримине жана ырайымыңа себеп боло турган амалдарды жасоого жардам бер. Мени бардык күнөөлөрдөн алыс кыл. Мага ар бир жакшылыкка жетүүгө жардам бер, мени Бейишке киргиз жана тозоктон сакта.Оо Аллахым! Мага берген ырыскыңа шүгүр кылуучулардан кыл жана мага пайдалуу жана берекелүү ырыскы бер. Мен ала албаган нерсени жашоомо киргизип, анын ордуна мага жакшыраак насип кыл. Оо Аллахым! Эгер биз унутуп же ката кетирсек, анда ал үчүн бизди жазалаба. Мурунку муундарга жүк кылгандай, бизге оор жүк салба. Бизге көтөрө албаган жүктү бере көрбө. Бизди кечир, бизге ырайым кыл, Сен биздин Раббибизсиң. Бизге каапырларга каршы жардам бер. Оо Аллахым! Жүрөгүмдү эки жүздүүлүктөн, амалдарымды эл көрсөндүктөн, тилимди жалган сүйлөөдөн, көзүмдү кыянаттыктан тазала! Ал тургай биздин жүрөгүбүздө катылган сырларды да билесиң. Оо Аллахым! Мага эң жакшы амалдарга жана эң сонун адеп-ахлакка жетүүгө жардам бер. Муну Сен гана жасай аласың. Мени жаман иштерден жана жаман ахлактан сакта, муну Сен гана кыла аласың. Оо,Аллахым! Бизге бул дүйнөдө жана акыретте жакшылык бер. Бизди тозок азабынан сакта. Бизди салихтер менен бирге бейишке киргиз.Оо, Жараткан! Оо, Кечиримдүү Зат! Оо, Ааламдардын Раббиси!',
      ),
      DuaModel(
        subtitle: ' Бешинчи айлануунун дуасы',
        arabicText:
            'بِسْمِ اللهِ اَللهُ أَكْبَرُ، اَللّٰهُمَّ إِيمَانًا بِكَ ، وَ تَصْدِيقًا بِكِتَابِكَ ، وَ وَفَاءً بِعَهْدِكَ ، وَاتِّبَاعًا لِسُنَّةِ نَبِيِّكَ. سُبْحَانَ اللهِ ، وَالْحَمْدُ لِلهِ ، وَلَٓا إِلٰهَ إِلَّا اللهُ ، وَاللهُ أَكْبَرُ، وَلَا حَوْلَ وَلَا قُوَّةَ إِلَّا بِاللهِ الْعَلِيِّ الْعَظِيمِ. وَالصَّلَاةُ وَالسَّلَامُ عَلٰى سَيِّدِنَا مُحَمَّدٍ وَ عَلٰى آلِهِ وَ صَحْبِهِ أَجْمَعِينَ. رَبِّ هَبْ لِي مِنْ لَدُنْكَ ذُرِّيَّةً طَيِّبَةً ، إِنَّكَ سَمِيعُ الدُّعَٓاءِ. رَبِّ اجْعَلْنِي مُقِيمَ الصَّلٰوةِ وَ مِنْ ذُرِّيَّتِي رَبَّنَا وَ تَقَبَّلْ دُعَٓاءِ. رَبِّ هَبْ لِي مِنَ الصَّالِحِينَ. تَوَفَّنِي مُسْلِمًا وَ أَلْحِقْنِي بِالصَّالِحِينَ. رَبَّنَا هَبْ لَنَا مِنْ أَزْوَاجِنَا وَ ذُرِّيَّاتِنَا قُرَّةَ أَعْيُنٍ وَاجْعَلْنَا لِلْمُتَّقِينَ إِمَامًا. اَللّٰهُمَّ أَظِلَّنِي تَحْتَ ظِلِّ عَرْشِكَ يَوْمَ لَا ظِلَّ إِلَّا ظِلُّكَ ، وَلَا بَاقِيَ إِلَّا وَجْهُكَ ، وَاسْقِنِي مِنْ حَوْضِ نَبِيِّكَ مُحَمَّدٍ صَلَّى اللهُ عَلَيْهِ وَ سَلَّمَ شَرْبةً هَنِيئَةً مَرِيئَةً لَا أَظْمَأُ بَعْدَها أَبَداً. اَللّٰهُمَّ إِنِّي أَسْأَلُكَ مِنَ الْخَيْرِ كُلِّهِ عَاجِلِهِ وَ آجِلِهِ ، مَا عَلِمْتُ مِنْهُ وَ مَا لَمْ أَعْلَمْ ، وَ أَعُوذُ بِكَ مِنَ الشَّرِّ كُلِّهِ ، عَاجِلِهِ وَ آجِلِهِ مَا عَلِمْتُ مِنْهُ وَ مَا لَمْ أَعْلَمْ ، وَ أَسْأَلُكَ الْجَنَّةَ وَ مَا قَرَّبَ إِلَيْهَا مِنْ قَوْلٍ أَوْ عَمَلٍ ، وَ أَعُوذُ بِكَ مِنَ النَّارِ وَ مَا قَرَّبَ إِلَيْهَا مِنْ قَوْلٍ أَوْ عَمَلٍ. وَ أَسْأَلُكَ خَيْرَ مَا سَأَلَكَ عَبْدُكَ وَ رَسُولُكَ مُحَمَّدٌ صَلَّى اللهُ عَلَيْهِ وَ سَلَّمَ ، وَ أَعُوذُ بِكَ مِنْ شَرِّ مَا اسْتَعَاذَ مِنْهُ عَبْدُكَ وَ رَسُولُكَ مُحَمَّدٌ صَلَّى اللهُ عَلَيْهِ وَ سَلَّمَ. رَبَّنَٓا اٰتِنَا فِي الدُّنْيَا حَسَنَةً وَ فِي الْاٰخِرَةِ حَسَنَةً وَ قِنَا عَذَابَ النَّارِ وَ أَدْخِلْنَا الْجَنَّةَ مَعَ الْأَبْرَارِ يَا عَزِيزُ يَا غَفَّارُ يَا رَبَّ الْعَالَمِينَ.',
        transliteration:
            "Бисмиллахи аллаху акбару,аллохумма иимаанан бикат, ва тасдиикон бикитаабика, ва вафаа’ан биаъхдика, ва иттибаа’ан ли-суннати набийика. Субхааналлах, вал-хамду лиллахи,ва лаа илааха иллаллоху, валлоху акбару, ва лаа хаула ва лаа куввата илла биллахил-аълийил-аъзиим. Вас-солаату вас-салааму аълаа сайидинаа Мухаммад ва аълаа аалихи ва сохбихи ажмаиъин. Рабби хаб-лии мин ладунка зуррийатан тойибатан, иннака самииуъд-дуаъа. Рабби ижаълнии мукыымас-солаати ва мин зуррийатии. Раббанаа ва такоббал дуаъа. Рабби хаб-лии минас-соолихиин. Таваффании муслиман ва алхикнии бис-соолихиин. Раббана хаб ланаа мин азваажинаа ва зуррийатинаа куррота а’аъйунин важаълнаа лил-муттакыына имаама. Аллохумма азиллании тахта зилли аршика явма ла зилла илла зиллука, ва ла баакыя илла важхука, васкынии мин хауды набийика Мухаммадин соллаллаху аълайхи ва саллама шарбатан хании’атан марии'атан ла азма’у ба’аъдахаа абадан. Аллохумма иннии ас’алука минал-хойри куллихи аажилихи ва аъжилихи, маа аълимту минху ва маа лам аълам,ва ауъзу бика минаш-шарри куллихи, аъжилихи ва аажилихи, маа аълимту минху ва маа лам а’аълам, ва ас’алукал-жанната ва маа корраба илайхаа мин ковлин ав  аъмалин, ва ауъзу бика минан-наари ва маа корраба илайхаа мин ковлин ав  аъмалин. Ва ас’алука хойра маа са’алака аъбдука ва расуулука Мухаммад соллаллаху аълайхи ва саллама,ва ауъзу бика мин шарри ма истааъаза минху аъбдука ва расуулука Мухаммад соллаллаху  аълайхи ва саллама.Раббанаа аатинаа фид-дунйа хасанатан ва фил-аахыроти хасанатан, ва кынаа аъзаабан-наари, ва адхылнаал-жанната ма’аъл-аброори. Яа Аъзиизу, Яа Гоффаару, Яа Роббал-аъаламиин.",
        translation:
            ' Аллах Таала кемчиликтен алыс. Аллахка мактоолор болсун.  Аллахтан башка кудай жок. Аллах улук. Бардык күч  Алла Таалага таандык. Пайгамбарыбыз Мухаммад(саллаллаху алейхи васаллам), анын үй-бүлөсүнө жана сахабаларына салам жана салаваттар болсун.Оо Аллахым! Мээримиңден таза муун насип эт. Албетте, сен дубаны туура угуп жатасың. Оо Аллахым! Мени дайыма намаз окугандардан кыл. Аллахым тилегимди кабыл кыл. Оо Аллахым! Мага салих урпак бер. Менин рухумду Ислам абалында ал жана мени салихтерге кош. Оо Аллахым! Мээримиң менен бизге үй-бүлөнүн, балдардын амандыгын бер жана бизди Аллахтан корккондор үчүн үлгү кыл. Оо Аллахым! Көлөкөсү жок жана Сенин улуулугуңдан башка эч нерсе калбай турган күнү мени Аршыңдын көлөкөсүнө ал.Мага ушундай ырайым бер, мен эч качан суусабайм. Оо Аллахым! Мен өзүм билген жана билбеген баардык жамандыктардан сактануу сураганымдай, өзүм билген жана билбеген бардык жакшылыктарды да Сенден сурайм. Мага бейишке кирүүнү насип кыл  жана мени тозок отунан сакта. Оо Аллахым! Сенин кулуң жана элчиң Мухаммад сенден сураган нерселердин баарын Сенден сурайм. Жана ал качкан бардык нерседен мени коргоңду сурайм. Оо Аллахым! Бизге бул дүйнөдө жана акыретте жакшылык бер.Бизди тозок азабынан сакта. Бизди салихтер менен бирге бейишке киргиз. Оо,Жараткан! Оо,Кечиримдүү Зат! Оо,Ааламдардын Раббиси!',
      ),
      DuaModel(
        subtitle: ' Алтынчы айлануунун дуасы',
        arabicText:
            'بِسْمِ اللهِ اَللهُ أَكْبَرُ، اَللّٰهُمَّ إِيمَانًا بِكَ ، وَ تَصْدِيقًا بِكِتَابِكَ ، وَ وَفَاءً بِعَهْدِكَ ، وَاتِّبَاعًا لِسُنَّةِ نَبِيِّكَ . سُبْحَانَ اللهِ ، وَالْحَمْدُ لِلهِ ، وَلَٓا إِلٰهَ إِلَّا اللهُ ، وَاللهُ أَكْبَرُ، وَلَا حَوْلَ وَلَا قُوَّةَ إِلَّا بِاللهِ الْعَلِيِّ الْعَظِيمِ. وَالصَّلَاةُ وَالسَّلَامُ عَلٰى سَيِّدِنَا مُحَمَّدٍ وَ عَلٰى آلِهِ وَ صَحْبِهِ أَجْمَعِينَ. رَبَّنَٓا اٰتِنَا مِنْ لَدُنْكَ رَحْمَةً وَهَيِّئْ لَنَا مِنْ أَمْرِنَا رَشَدًا. وَاكْتُبْ لَنَا فِي هٰذِهِ الدُّنْيَا حَسَنَةً وَ فِي الْاٰخِرَةِ إِنَّا هُدْنَٓا إِلَيْكَ. رَبَّنَٓا أَفْرِغْ عَلَيْنَا صَبْرًا وَ تَوَفَّنَا مُسْلِمِينَ. رَبَّنَٓا أَفْرِغْ عَلَيْنَا صَبْرًا وَ ثَبِّتْ أَقْدَامَنَا وَانْصُرْنَا عَلَى الْقَوْمِ الْكَافِرِينَ. رَبَّنَا اغْفِرْ لَنَا وَ لِإِخْوَانِنَا الَّذِينَ سَبَقُونَا بِالْاِيمَانِ وَ لَا تَجْعَلْ فِي قُلُوبِنَا غِلًّا لِلَّذِينَ اٰمَنُوا رَبَّنَٓا إِنَّكَ رَؤُوفٌ رَحِيمٌ. اَللّٰهُمَّ إِنَّ لَكَ عَلَيَّ حُقُوقًا كَثِيرَةً فِيمَا بَيْنِي وَ بَيْنَكَ ؛ وَحُقُوقًا كَثِيرَةً فِيمَا بَيْنِي وَبَيْنَ خَلْقِكَ ، اَللّٰهُمَّ مَا كَانَ لَكَ مِنْهَا فَاغْفِرْهُ لِي ، وَمَا كَانَ لِخَلْقِكَ فَتَحَمَّلْهُ عَنِّي. وَأَغْنِنِي بِحَلَالِكَ عَنْ حَرَامِكَ وَ بِطَاعَتِكَ عَنْ مَعْصِيَتِكَ وَ بِفَضْلِكَ عَمَّنْ سِوَاكَ يَا وَاسِعَ الْمَغْفِرَةِ. رَبَّنَٓا اٰتِنَا فِي الدُّنْيَا حَسَنَةً وَ فِي الْاٰخِرَةِ حَسَنَةً وَ قِنَا عَذَابَ النَّارِ وَ أَدْخِلْنَا الْجَنَّةَ مَعَ الْأَبْرَارِ يَا عَزِيزُ يَا غَفَّارُ يَا رَبَّ الْعَالَمِينَ.',
        transliteration:
            " Бисмиллахи аллаху акбар,аллoхумма иимаанан бика, ва тасдиикон бикитаабика, ва вафаа’ан биаъхдика, ва аттибаа’ан лисуннати набийика. Субхааналлахи вал-хамду лиллахи, ва лаа илааха иллаллаху, валлаху акбару, ва лаа хавла ва лаа куввата иллa биллахил-аълийил-аъзиим. Вас-солаату вас-салааму аълаа сайидинаа Мухаммадин ва аълаа аалихи ва сохбихи ажмаиъин. Раббанаа аатинаа мин ладунка рахматан ва хай’и ланаа мин амринаа рошада. Вактуб ланаа фи хазихид-дунйа хасанатан ва фил-аахыроти иннаа худнаа илайка. Роббанаа африг аълайнаа соброн ва таваффанаа муслимиин. Раббанаа африг аълайна собран ва саббит акдaаманаа вансурнаа аълал-ковмил-каафириин. Роббана игфир ланаа вали-ихваанинаа аллазина сабакуунаа бил-иимани ва лаа тажаъл фи кулуубинаа гиллан лиллазина ааману. Раббана иннака Роууфур-Рохиим. Аллохумма иннa лака аълайa хукуукон касиротан маа байнии ва байнака,  ва хукуукон касиротан маа байнии ва байна холкыка.Аллохумма маа каана лака минха фагфирху ли,  ва маа каана ли холкыка фатахаммалху аъннии. Ва агнинии бихалаалика аън хароомик ва битооаътика аън ма’аъсиятика ва бифадлика аъмман сиваака яа ваасиаъл-магфироти. Раббанаа аатинаа фид-дунйа хасанатан ва фил-аахыроти хасанатан, ва кынаа аъзаабан-наари, ва адхылнаал-жанната ма’аъл-аброори. Яа Аъзиизу, Яа Гоффаару, Яа Роббал-аъаламиин.",
        translation:
            'Оо Аллахым! Бизге Өзүң ырайым кыл жана Сенин ыйманыңды сактоону бизге жеңил кыл. Чындыгында, Сен дубаны Угуучусуң. Оо Аллахым! Бизге бул дүйнөдө да, акыретте да жакшылык бер, анткени биз Сага алып баруучу жолдобуз. Оо Аллахым! Бизге ырайым кыл,бутубузду бекем кыл жана каапырларга каршы турууга жардам бер. Оо Аллахым! Бизге сабырдуулук бер жана жүрөгүбүздө сакта. Момундарга душмандык кылуубузга жол бербе. Оо Аллахым! Сен өтө Мээримдүү жана өтө Боорукерсиң. Оо Аллахым! Сенин кулдарыңдын менин үстүмдө акысы көп болгон сыяктуу, Сенин менин үстүмдө көп акың бар экенин билем. Өзүңдүн алдыңда менин кемчиликтеримди кечирип, жараткандарыңдын таасиринен сактооңду суранам. Мага уруксат берилгенди гана бер, арамдан сактануу үчүн күнөөлөрдөн сактануу үчүн мени Өзүңдүн кызматыңда кыл. Мага молчулук бер, эч кимге муктаж кыла көрбө. Оо,Аллахым! Сен өтө Кечиримдүүсүң!Оо,Аллахым! Бизге бул дүйнөдө жана акыретте жакшылык бер. Бизди тозок азабынан сакта. Бизди салихтар менен бирге бейишке киргиз. Оо,Аллахым! Оо,  Кечиримдүү Зат! Оо,ааламдардын Раббиси!',
      ),
      DuaModel(
        subtitle: 'Жетинчи айлануунун дуасы',
        arabicText:
            'بِسْمِ اللهِ اَللهُ أَكْبَرُ، اَللّٰهُمَّ إِيمَانًا بِكَ ، وَ تَصْدِيقًا بِكِتَابِكَ، وَ وَفَاءً بِعَهْدِكَ ، وَاتِّبَاعًا لِسُنَّةِ نَبِيِّكَ . سُبْحَانَ اللهِ ، وَالْحَمْدُ لِلهِ ، وَلَٓا إِلٰهَ إِلَّا اللهُ ، وَاللهُ أَكْبَرُ وَلَا حَوْلَ وَلَا قُوَّةَ إِلَّا بِاللهِ الْعَلِيِّ الْعَظِيمِ . وَالصَّلَاةُ وَالسَّلَامُ عَلٰى سَيِّدِنَا مُحَمَّدٍ وَ عَلٰى آلِهِ وَ صَحْبِهِ أَجْمَعِينَ. اَللّٰهُمَّ إِنِّي أَسْأَلُكَ إِيمَانًا كَامِلًا ، وَ يَقِينًا صَادِقًا ، وَ رِزْقًا وَاسِعًا حَلَالًا طَيِّبًا، وَ قَلْبًا خَاشِعًا ، وَ لِسَانًا ذَاكِرًا ، وَ تَوْبَةً نَصُوحًا، وَ عِلْمًا نَافِعًا. اَللّٰهُمَّ إِنِّي أَسْأَلُكَ الْهُدَى وَالتُّقَى وَالْعَفَافَ وَالْغِنَى . اَللّٰهُمَّ إِنِّي أَسْأَلُكَ الصِّحَّةَ وَ الْعِفَّةَ وَ الْأَمَانَةَ وَ حُسْنَ الْخُلُقِ وَ الرِّضَى بِالْقَدَرِ. اَللّٰهُمَّ إِنِّي أَسْأَلُكَ الطَيِّبَاتِ ، وَ تَرْكَ الْمُنْكَرَاتِ ، وَ حُبَّ الْمَسَاكِينِ ، وَ أَنْ تَتُوبَ عَلَيَّ ، وَ تَغْفِرَ لِي وَ تَرْحَمَنِي. اَللّٰهُمَّ اغْفِرْ لِي جَمِيعَ مَا مَضَى مِنْ ذَنْبِي، وَاعْصِمْنِي فِيمَا بَقِيَ مِنْ عُمْرِي، وَارْزُقْنِي عَمَلًا زَاكِيًا تَرْضَى بِهِ عَنِّي. اَللّٰهُمَّ لَا تَكِلْنِي إِلٰى نَفْسِي طَرْفَةَ عَيْنٍ، وَ لَا تَنْزِعْ مِنِّي صَالِحَ مَا أَعْطَيْتَنِي. رَبَّنَا اغْفِرْ لِي وَ لِوَالِدَيَّ وَ لِلْمُؤْمِنِينَ يَوْمَ يَقُومُ الْحِسَابُ. رَبَّنَٓا اٰتِنَا فِي الدُّنْيَا حَسَنَةً وَ فِي الْاٰخِرَةِ حَسَنَةً وَ قِنَا عَذَابَ النَّارِ وَ أَدْخِلْنَا الْجَنَّةَ مَعَ الْأَبْرَارِ يَا عَزِيزُ يَا غَفَّارُ يَا رَبَّ الْعَالَمِينَ .',
        transliteration:
            "Бисмиллахи аллаху акбар, аллoхумма иимаанан бика, ва тасдиикон бикитаабика, ва вафаа’ан биаъхдика, ва аттибаа’ан лисуннати набийика, субхааналлахи, вал-хамду лиллахи, ва лаа илааха иллаллаху, валлаху акбару, ва лаа хавла ва лаа куввата иллa биллахил-аълийил-аъзиим. Вас-солаату вас-салааму аълаа сайидинаа Мухаммадин ва аълаа аалихи ва сохбихи ажмаиъин. Аллохумма иннии ас’алука иимаанан каамилан, ва яакыынан соодикон, ва ризкон ваасиаън халаалан тойибан, ва колбан хоошиаън, ва лисаанан заакирон, ва таубатан насухан, ва  иълман наафиаън. Аллохумма иннии ас’алукал-худаа ват-тукоо вал-аъфаафа вал-гинаа. Аллохумма иннии ас’алукас-сиххата вал-иъффата вал-амааната ва хуснал-хулюкы вар-рыдоо бил-кодари .Аллохумма иннии ас’алука тойибаати, ва таркал-мункарооти, ва хуббал-масаакииини, ва ан татууба аълайа, ва тагфиро лии ва тархамани. Аллохумма игфир лии жамиаъ маа мадоо мин замбии, ва’аъсимнии фиимаа бакыя мин уъмрии, варзукнии аъмалан заакиян тард̣оо бихи аъннии. Аллохумма лаа такылни илаа нафсии торфата аъйнии, ва лаа танзи’иъ миннии соолиха ма а’аътойтании. Раббана агфир лии ва ливаалидайя ва лил-му’миниина явма якуумул-хисаабу. Раббанаа аатинаа фид-дунйа хасанатан ва фил-аахыроти хасанатан,ва кынаа аъзаабан-наари, ва адхылнаал-жанната ма’аъл-аброори. Яа Аъзиизу, Яа Гоффаару, Яа Роббал-аъаламиин.",
        translation:
            'Аллах Таала кемчиликтен алыс. Аллахка мактоолор болсун. Аллахтан башка кудай жок. Аллах улук. Бардык күч жана күч Алла Таалага таандык. Пайгамбарыбыз Мухаммад(саллаллаху алейхи васаллам),анын үй-бүлөсүнө жана сахабаларына салам жана салаваттар болсун. Оо Аллахым! Мен Сенден кемчиликсиз ыйман, чыныгы ишеним, берекелүү жана адал ырыскы, Өзүңдөн корко турган жүрөк, сага шүгүр кылуучу тил, дайыма чын жүрөктөн тообо дил жана пайдалуу илим сурайм. Аллахым сенден хидаят, такыбалык, уяттуулук жана байлык сурайм. Оо Аллахым! Сенден ден соолук, уяттуулук, аманатка берилгендик, жакшы адеп-ахлак жана сенин каалооң менен ыраазылык сурайм.Оо Аллахым! Сенден жакшы амалдарды кылууну жана жакшылыктарды сактоону, жамандыктан кайтарууну,  кедей-кембагалдарды сүйүүнү сурайм, күнөөлөрүмдүн кечирилишин жана өзүмө ырайымын тилеймин.Оо Аллахым! Сенден менин мурунку кылган күнөөлөрүмдү кечир, калган өмүрүмдө күнөөлөрдөн сакташыңды суранам. Өзүң ыраазы боло турган таза амалдарды кылууну насип кыл. Оо Аллахым! Кыямат күнү сенден мени, ата-энемди жана бардык момундарды кечирүүңдү сурайм. Оо Аллахым! Бизге бул дүйнөдө да, акыретте да жакшылыктарды бер. Бизди тозок азабынан сакта жана салихтер менен бирге бейишке киргиз. Оо Кудуреттүү Зат! Оо  Мээримдүүлөрдүн Мээримдүүсү, ааламдардын Раббиси!Оо Аллахым! Мени бир көз ирмемге өзүмдүн напсим менен калтырба. Мага берген ырайымыңан куру калтырба.',
      ),
      DuaModel(
        subtitle:
            ' Таваф намазынан кийин Маком Ибрахимде Адам Алайхис-Саламдын дуаларын окуу',
        arabicText:
            'اللَّهُمَّ إِنَّكَ تَعْلَمُ سِرِّي وَتعْلَمُ نِيَّتِي فَاقْبَلْ مَعْذِرَتِي وَتَعْلَمُ حَاجَتِي فَاقْضِ سُؤْلِي وَتَعْلَمُ ما فِي نَفْسِي فَاغْفِرْ لِي ذُنُوبِي. اللَّهُمَّ إِنِّي أَسْأَلُكَ إِيمَانًا يُبَشِّرُ قَلْبِي وَيَقِينًا صَادِقًا حَتَّى أَعْلَمَ أَنَّهُ لَا يُصِيبُنِي إِلَّا مَا كَتَبْتَ لِي وَرِضًا بِمَا قَسَّمْتَ لِي يَا أَرْحَمَ الرَّاحِمِينَ.',
        transliteration:
            "Аллохумма иннака таъламу сиррии ва таъламу нийатии факбал ма’аъзиротии ва таъламу хаажатии факды су’лии ва таъламу маа фии нафсии фагфир лии зунуубии. Аллохумма иннии ас’алука иимаанан юбашширу колбии ва якиинан соодикон хатта а’аълама аннаху лаа юсиибунии илла маа катабта лии ва ридон бимаа коссамта лии яаа архамар-роохимиин. ",
        translation:
            'Оо Аллахым! Сен менин ички жана сырткы абалымды жакшы билесиң, менин кечиримимди кабыл кыл. Муктаждыгымды да билесиң, сураганымды бер. Жүрөгүмдү да билесиң, күнөөлөрүмдү кечир.Оо Аллахым!  Мен сенден,  мага эмнени жазган болсоң,  ошол нерселер гана жетээрин биле турган жана сен мага тагдырга жазган нерселерге ыраазы боло турган жүрөктөгү бекем ыйманды жана чыныгы ишенимди сураймын.',
      ),
      DuaModel(
        subtitle: 'Зам-зам сууну ичүү дуасы',
        arabicText:
            'اللَّهُمَّ إِنِّي أَسْأَلُكَ عِلْمًا نَافِعًا وَرِزْقًا وَاسِعًا وَشِفَاءً مِنْ كُلِّ دَاءٍ.',
        transliteration:
            "Аллохумма иннии ас’алука иълман наафиаън ва ризкон ваасиаън ва шифаа’ан мин кулли даа’ин. ",
        translation:
            'Оо Аллахым!  Сенден пайдалуу илим,кенен ырыскы жана ар бир оорууга шыпаа сураймын.',
      ),
    ],
  ),
  SectionModel(
    title: 'Саъий бөлүмү',
    duas: [
      DuaModel(
        subtitle:
            'Аллахтын ысымы менен сапарга чыгып жатам жана Аллахка гана тобокел кылдым',
        arabicText:
            'بِسْمِ اللَّهِ تَوَكَّلْتُ عَلَى اللَّهِ، لَا حَوْلَ وَلَا قُوَّةَ إِلَّا بِاللَّهِ',
        transliteration:
            'Бисмиллахи таваккалту аълаллохи лا хавла ва ла куввата илла биллахи',
        translation:
            'Мен Аллахтын ысымы менен сапарга чыгып жатам жана Аллахка гана тобокел кылдым',
      ),
    ],
  ),
  SectionModel(
    title: 'Мадина бөлүмү',
    duas: [
      DuaModel(
        subtitle:
            'Аллахтын ысымы менен сапарга чыгып жатам жана Аллахка гана тобокел кылдым',
        arabicText:
            'بِسْمِ اللَّهِ تَوَكَّلْتُ عَلَى اللَّهِ، لَا حَوْلَ وَلَا قُوَّةَ إِلَّا بِاللَّهِ',
        transliteration:
            'Бисмиллахи таваккалту аълаллохи лا хавла ва лا куввата илла биллахи',
        translation:
            'Мен Аллахтын ысымы менен сапарга чыгып жатам жана Аллахка гана тобокел кылдым',
      ),
      // Medine bölümündeki diğer duaları buraya ekleyebilirsiniz
    ],
  ),
];
